[
  {
    "badges": [],
    "campaign_type": "instructor_coupon",
    "caption_languages": [],
    "content_info_short": "35 mins",
    "coupon_code": "2TO38TH",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 1000,
    "coupon_uses_remaining": 994,
    "created_date": "Mon, 18 Sep 2023 10:28:35 GMT",
    "description": "<p>Welcome to \"Hack Simple Websites\" – your gateway into the intriguing world of ethical hacking!</p><p>As the internet expands, so does the number of vulnerable websites. This course isn't just about exploiting these vulnerabilities; it's about understanding them, so you can fix them.</p><p>Why Choose This Course?<br>We're dedicated to teaching you the art of hacking in the most ethical way. With real-world examples and hands-on projects, you'll learn how hackers think, operate, and more importantly, how you can protect websites against them.</p><p>What Awaits You:</p><ul><li><p>White Hat Basics: Dive deep into ethical hacking principles.</p></li><li><p>Website Vulnerabilities: Explore common weak points in simple websites.</p></li></ul><p>Who Is This Course For?</p><ul><li><p>Aspiring Ethical Hackers: Anyone keen on stepping into the world of white-hat hacking and cybersecurity.</p></li><li><p>Web Developers: Coders and designers looking to fortify their websites against common vulnerabilities.</p></li><li><p>Website Owners: Individuals aiming to understand and secure their online platforms from potential threats.</p></li><li><p>Tech Enthusiasts: Curious minds eager to understand the mechanics behind website vulnerabilities.</p></li></ul><p>Whether you're a website owner, budding developer, or just tech-curious, this course will equip you with the knowledge to think a step ahead of the average hacker.</p><p>Join \"Hack Simple Websites\" today. Understand the vulnerabilities, exploit them, defend against them, and advocate for a safer web for everyone!</p><p>Enroll Now and Step into Ethical Hacking!</p>",
    "detected_language": "en",
    "has_certificate": true,
    "has_closed_caption": false,
    "headline": "Web Hacking 101",
    "id": 5564772,
    "id_name": "hack-simple-websites",
    "image": "https://img-b.udemycdn.com/course/480x270/5564772_c699.jpg",
    "image_hq": "https://img-b.udemycdn.com/course/750x422/5564772_c699.jpg",
    "instructional_level_simple": "Beginner",
    "instructors": [
      { "Frank Anemaet": "https://www.udemy.com/user/frank-anemaet/" }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": false,
    "is_in_any_ufb_content_collection": false,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": false,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": [],
    "language": "English",
    "last_db_change_time": "Thu, 07 Nov 2024 15:11:18 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 15:02:48 GMT",
    "last_updated": "Sat, 30 Sep 2023 00:00:00 GMT",
    "num_assignments": 0,
    "num_coding_exercises": 0,
    "num_curriculum_items": 16,
    "num_lectures": 11,
    "num_practice_tests": 0,
    "num_quizzes": 5,
    "num_reviews": 93,
    "num_subscribers": 10002,
    "objectives": [
      "Exploit IDOR vulnerabilties",
      "Find Hidden Files and Folders",
      "Exploit Command Injection",
      "Brute Force"
    ],
    "primary_category": "IT & Software",
    "primary_subcategory": "Network & Security",
    "quality_review_admin_rating": 7,
    "quality_review_score": 45,
    "quality_status": "approved",
    "rating": 4.2,
    "requirements_data": ["No prior knowledge required"],
    "sm_sending_time": {
      "telegram": { "@udemy_dev": "Thu, 07 Nov 2024 15:11:18 GMT" }
    },
    "status_label": "Live",
    "target_audiences": [
      "Beignner Ethical Hackers",
      "IT Professionals",
      "Webmasters"
    ],
    "title": "Ethical Hacking: Web Hacking Intro",
    "what_you_will_learn_data": [
      "Exploit IDOR vulnerabilties",
      "Find Hidden Files and Folders",
      "Exploit Command Injection",
      "Brute Force"
    ],
    "who_should_attend_data": [
      "Beignner Ethical Hackers",
      "IT Professionals",
      "Webmasters"
    ]
  },
  {
    "badges": [],
    "campaign_type": "instructor_coupon",
    "caption_languages": ["English [Auto]"],
    "content_info_short": "8 hours",
    "coupon_code": "45EF0B2FE8FC25FE99AA",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 1000,
    "coupon_uses_remaining": 965,
    "created_date": "Mon, 05 Jul 2021 03:23:26 GMT",
    "description": "<p>This course will cover corporate dividend policy.</p><p>We will include many example problems, both in the format of presentations and Excel worksheet problems. The Excel worksheet presentations will include a downloadable Excel workbook with at least two tabs, one with the answer, the second with a preformatted worksheet that can be completed in a step-by-step process along with the instructional videos.</p><p>Dividends represent earnings that a corporation distributes to owners. Dividends for a corporation can be compared do withdrawals from a sole proprietorship or partnership. However, there are substantial differences between a partnership withdrawal and a corporate dividend due to differences in the business structure.</p><p>A partner in a partnership generally has more control over the amount of draws they can take and when they can take them. Different partners may also draw different amounts at different times.</p><p>By contrast, a corporation must give uniform distributions of dividends to each class of shares, resulting in far less direct control by an individual shareholder to determine the amount of dividends or when they will be distributed.</p><p>The dividend distribution policy of a corporate can be very complex, involving many factors, including the life cycle of the company, the cash flow of the company, and the preferences of the shareholders.</p><p>A company that is in the growth phase of its life cycle is more likely to have smaller dividends, preferring to reinvest the money to grow operations. Shareholders who would like to invest over a longer time frame may like this policy because the increase in value of the company will increase the value of the shares.</p><p>A company in a mature phase of the life cycle may not have as much need to reinvest earnings and is more likely to distribute earnings to shareholders. Many investors like investing in dividend yielding companies because they receive a return on their investment in the form of dividends.</p>",
    "detected_language": "en",
    "has_certificate": true,
    "has_closed_caption": true,
    "headline": "Learn about factors involved in corporate dividend policy decisions from a certified public accountant (CPA)",
    "id": 4164818,
    "id_name": "corporate-finance-15-dividend-policy",
    "image": "https://img-b.udemycdn.com/course/480x270/4164818_779e.jpg",
    "image_hq": "https://img-b.udemycdn.com/course/750x422/4164818_779e.jpg",
    "instructional_level_simple": "All Levels",
    "instructors": [
      {
        "Robert (Bob) Steele": "https://www.udemy.com/user/c91d6786-95f3-48d8-ab94-cc92431d2aa4/"
      }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": false,
    "is_in_any_ufb_content_collection": false,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": false,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": ["Stock Trading"],
    "language": "English",
    "last_db_change_time": "Thu, 07 Nov 2024 15:11:18 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 14:44:53 GMT",
    "last_updated": "Sun, 07 Apr 2024 00:00:00 GMT",
    "num_assignments": 0,
    "num_coding_exercises": 0,
    "num_curriculum_items": 42,
    "num_lectures": 42,
    "num_practice_tests": 0,
    "num_quizzes": 0,
    "num_reviews": 37,
    "num_subscribers": 27008,
    "objectives": [
      "Explain the factors involved when making corporate dividend policy decisions",
      "Describe dividend policy as it relates to phases in the corporate life cycle",
      "Discuss the impact shareholders have over dividend policy",
      "Explain dividend payment terms",
      "Compare stock dividends and cash dividends",
      "Describe when a company may use stock dividends",
      "Discuss the concept of a stock split",
      "Explain when a company may use a stock split"
    ],
    "primary_category": "Finance & Accounting",
    "primary_subcategory": "Other Finance & Accounting",
    "quality_review_admin_rating": 7,
    "quality_review_score": 45,
    "quality_status": "approved",
    "rating": 4.5,
    "requirements_data": ["Basic understanding of corporate finance concepts"],
    "sm_sending_time": {
      "telegram": { "@udemy_business": "Thu, 07 Nov 2024 15:11:18 GMT" }
    },
    "status_label": "Live",
    "target_audiences": ["Business students", "Business professionals"],
    "title": "Corporate Finance #15 Dividend Policy",
    "what_you_will_learn_data": [
      "Explain the factors involved when making corporate dividend policy decisions",
      "Describe dividend policy as it relates to phases in the corporate life cycle",
      "Discuss the impact shareholders have over dividend policy",
      "Explain dividend payment terms",
      "Compare stock dividends and cash dividends",
      "Describe when a company may use stock dividends",
      "Discuss the concept of a stock split",
      "Explain when a company may use a stock split"
    ],
    "who_should_attend_data": ["Business students", "Business professionals"]
  },
  {
    "badges": [],
    "campaign_type": "instructor_coupon",
    "caption_languages": ["English [Auto]"],
    "content_info_short": "1.5 hours",
    "coupon_code": "4A53A0532CABB6A53C7C",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 1000,
    "coupon_uses_remaining": 530,
    "created_date": "Sat, 04 Nov 2023 23:29:20 GMT",
    "description": "<p>Welcome to course: Python Development & Data Science: Variables and Data Types</p><p>its the module of program \"Professional Diploma in Python Development\"<br>You may join that course separately, or join the full program.</p><p><br></p><p>Course provided by MTF Institute of Management, Technology and Finance</p><p>MTF is the global educational and research institute with HQ at Lisbon, Portugal, focused on business & professional hybrid (on-campus and online) education at areas: Business & Administration, Science & Technology, Banking & Finance. </p><p>MTF R&D center focused on research activities at areas: Artificial Intelligence, Machine Learning, Data Science, Big Data, WEB3, Blockchain, Cryptocurrency & Digital Assets, Metaverses, Digital Transformation, Fintech, Electronic Commerce, Internet of Things. </p><p>MTF is the official partner of: IBM, Intel, Microsoft, member of the Portuguese Chamber of Commerce and Industry.</p><p>MTF is present in 208 countries and has been chosen by more than 380,000 students.</p><p><br></p><p><br></p><p>Course Author:</p><p>Stanisław Marek Halkiewicz</p><p>I am a seasoned educator specializing in the domains of econometrics, statistics, statistical programming, and mathematics, boasting an extensive track record exceeding three years. Notably, I have imparted my expertise to students hailing from prestigious global universities, solidifying my standing as a sought-after tutor. I have made significant contributions in research endeavors spanning statistics, econometrics, and statistical programming. Furthermore, my professional trajectory encompasses a diverse spectrum, ranging from project management to business intelligence and Data Science.</p><p><br></p><p>Course Description:</p><p>Course designed to introduce individuals to the world of Python programming. Python has gained immense popularity in recent years for its simplicity, versatility, and readability. This course is ideal for beginners who are new to programming.</p><p><br></p><p>Importance For Companies:</p><p>Versatility: Python is versatile and can be used for a wide range of applications, from web development and data analysis to artificial intelligence and automation. Companies can benefit from having Python developers who can adapt to various projects.</p><p><br></p><p>Productivity: Python's clean and readable syntax allows developers to write code more quickly and efficiently. This results in faster project development and reduced costs for companies.</p><p><br></p><p>Large Ecosystem: Python has a vast ecosystem of libraries and frameworks, making it easier for companies to find solutions to their specific needs. This reduces the need for reinventing the wheel.</p><p><br></p><p>Data Analysis and AI: Python is a go-to language for data analysis and machine learning. Companies can leverage Python to extract valuable insights from data and build AI-driven applications.</p><p><br></p><p>Community and Support: Python has a strong and active community of developers. Companies can tap into this community for support, resources, and talent recruitment.</p><p><br></p><p>Importance For Developers:</p><p><br></p><p>Career Opportunities: Learning Python opens up a wide range of career opportunities in various industries. Python developers are in high demand, and their skills are transferable to different domains.</p><p><br></p><p>Diversity of Roles: Python developers can work in roles such as web developer, data analyst, data scientist, machine learning engineer, and more. This diversity allows developers to explore different areas of interest.</p><p><br></p><p>Ease of Learning: Python's straightforward syntax makes it an ideal choice for beginners in programming. It's also accessible to experienced developers looking to add another language to their skill set.</p><p><br></p><p>Continuous Growth: Python is constantly evolving, with new libraries and frameworks being developed. This means that developers who invest in Python education can continue to grow their skill set over time.</p><p><br></p><p>Remote Work Opportunities: Python development often allows for remote work, providing developers with flexibility in their careers.</p><p><br></p><p>The course provides a foundation for individuals looking to embark on a career in programming or expand their skill set. Python's significance in the tech industry, its versatility, and its demand in the job market make it a valuable asset for both companies and developers aiming to excel in today's technology-driven world.</p>",
    "detected_language": "en",
    "has_certificate": true,
    "has_closed_caption": true,
    "headline": "Python Development, Data Science: Variables and Data Types Course by MTF Institute",
    "id": 5644182,
    "id_name": "python-development-data-science-variables-and-data-types",
    "image": "https://img-c.udemycdn.com/course/480x270/5644182_a2eb.jpg",
    "image_hq": "https://img-c.udemycdn.com/course/750x422/5644182_a2eb.jpg",
    "instructional_level_simple": "All Levels",
    "instructors": [
      {
        "MTF Institute of Management, Technology and Finance": "https://www.udemy.com/user/mtfinstitute/"
      }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": false,
    "is_in_any_ufb_content_collection": false,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": false,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": [],
    "language": "English",
    "last_db_change_time": "Thu, 07 Nov 2024 15:09:54 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 15:09:52 GMT",
    "last_updated": "Wed, 25 Sep 2024 00:00:00 GMT",
    "num_assignments": 0,
    "num_coding_exercises": 0,
    "num_curriculum_items": 12,
    "num_lectures": 12,
    "num_practice_tests": 0,
    "num_quizzes": 0,
    "num_reviews": 387,
    "num_subscribers": 31492,
    "objectives": [
      "Python Development",
      "Variables and Data Types",
      "An overview of different data types",
      "Numeric Data Types",
      "Boolean Data",
      "input() function",
      "String as a data type",
      "Constants"
    ],
    "primary_category": "Development",
    "primary_subcategory": "Programming Languages",
    "quality_review_admin_rating": 7,
    "quality_review_score": 45,
    "quality_status": "approved",
    "rating": 4.1,
    "requirements_data": [
      "For a better learning experience, we suggest you to use a laptop / mobile phone / pen and paper for taking notes, highlighting important points, and making summaries to reinforce your learning."
    ],
    "sm_sending_time": {
      "telegram": {
        "-1002210106833": "Sat, 05 Oct 2024 22:06:12 GMT",
        "@programming_courses": "Wed, 06 Nov 2024 08:39:03 GMT",
        "@udemy_dev": "Wed, 06 Nov 2024 05:52:52 GMT"
      }
    },
    "status_label": "Live",
    "target_audiences": [
      "Course Description:  Introduction to Python Development is a course designed to introduce individuals to the world of Python programming. Python has gained immense popularity in recent years for its simplicity, versatility, and readability. This course is ideal for beginners who are new to programming.",
      "Course designed to introduce individuals to the world of Python programming. Python has gained immense popularity in recent years for its simplicity, versatility, and readability. This course is ideal for beginners who are new to programming.  Importance For Companies:  Versatility: Python is versatile and can be used for a wide range of applications, from web development and data analysis to artificial intelligence and automation. Companies can benefit from having Python developers who can adapt to various projects.",
      "Productivity: Python's clean and readable syntax allows developers to write code more quickly and efficiently. This results in faster project development and reduced costs for companies.  Large Ecosystem: Python has a vast ecosystem of libraries and frameworks, making it easier for companies to find solutions to their specific needs. This reduces the need for reinventing the wheel.  Data Analysis and AI: Python is a go-to language for data analysis and machine learning. Companies can leverage Python to extract valuable insights from data and build AI-driven applications.",
      "Community and Support: Python has a strong and active community of developers. Companies can tap into this community for support, resources, and talent recruitment.",
      "Importance For Developers:  Career Opportunities: Learning Python opens up a wide range of career opportunities in various industries. Python developers are in high demand, and their skills are transferable to different domains.  Diversity of Roles: Python developers can work in roles such as web developer, data analyst, data scientist, machine learning engineer, and more. This diversity allows developers to explore different areas of interest.  Ease of Learning: Python's straightforward syntax makes it an ideal choice for beginners in programming. It's also accessible to experienced developers looking to add another language to their skill set.",
      "Continuous Growth: Python is constantly evolving, with new libraries and frameworks being developed. This means that developers who invest in Python education can continue to grow their skill set over time.  Remote Work Opportunities: Python development often allows for remote work, providing developers with flexibility in their careers.  The course provides a foundation for individuals looking to embark on a career in programming or expand their skill set. Python's significance in the tech industry, its versatility, and its demand in the job market make it a valuable asset for both companies and developers aiming to excel in today's technology-driven world."
    ],
    "title": "Python Development & Data Science: Variables and Data Types",
    "what_you_will_learn_data": [
      "Python Development",
      "Variables and Data Types",
      "An overview of different data types",
      "Numeric Data Types",
      "Boolean Data",
      "input() function",
      "String as a data type",
      "Constants"
    ],
    "who_should_attend_data": [
      "Course Description:  Introduction to Python Development is a course designed to introduce individuals to the world of Python programming. Python has gained immense popularity in recent years for its simplicity, versatility, and readability. This course is ideal for beginners who are new to programming.",
      "Course designed to introduce individuals to the world of Python programming. Python has gained immense popularity in recent years for its simplicity, versatility, and readability. This course is ideal for beginners who are new to programming.  Importance For Companies:  Versatility: Python is versatile and can be used for a wide range of applications, from web development and data analysis to artificial intelligence and automation. Companies can benefit from having Python developers who can adapt to various projects.",
      "Productivity: Python's clean and readable syntax allows developers to write code more quickly and efficiently. This results in faster project development and reduced costs for companies.  Large Ecosystem: Python has a vast ecosystem of libraries and frameworks, making it easier for companies to find solutions to their specific needs. This reduces the need for reinventing the wheel.  Data Analysis and AI: Python is a go-to language for data analysis and machine learning. Companies can leverage Python to extract valuable insights from data and build AI-driven applications.",
      "Community and Support: Python has a strong and active community of developers. Companies can tap into this community for support, resources, and talent recruitment.",
      "Importance For Developers:  Career Opportunities: Learning Python opens up a wide range of career opportunities in various industries. Python developers are in high demand, and their skills are transferable to different domains.  Diversity of Roles: Python developers can work in roles such as web developer, data analyst, data scientist, machine learning engineer, and more. This diversity allows developers to explore different areas of interest.  Ease of Learning: Python's straightforward syntax makes it an ideal choice for beginners in programming. It's also accessible to experienced developers looking to add another language to their skill set.",
      "Continuous Growth: Python is constantly evolving, with new libraries and frameworks being developed. This means that developers who invest in Python education can continue to grow their skill set over time.  Remote Work Opportunities: Python development often allows for remote work, providing developers with flexibility in their careers.  The course provides a foundation for individuals looking to embark on a career in programming or expand their skill set. Python's significance in the tech industry, its versatility, and its demand in the job market make it a valuable asset for both companies and developers aiming to excel in today's technology-driven world."
    ]
  },
  {
    "badges": ["New"],
    "campaign_type": "instructor_coupon",
    "caption_languages": [],
    "content_info_short": "200 questions",
    "coupon_code": "ABCC77A9881141A2CE00",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 100,
    "coupon_uses_remaining": 46,
    "created_date": "Tue, 08 Oct 2024 07:05:32 GMT",
    "description": "<p>Are you ready to become a certified Disciplined Agile Scrum Master (DASM) and take your agile expertise to the next level? This course is designed to help you confidently prepare for the DASM certification exam by offering a comprehensive set of practice tests that mirror the real exam.</p><p>The Disciplined Agile (DA) framework goes beyond traditional Agile, Lean, and Scrum practices, providing a flexible, context-driven toolkit that empowers organizations to customize their approach based on their unique needs. As a Scrum Master, it's essential to master these concepts to lead teams more effectively and achieve business agility.</p><p>In this course, you will:</p><ul><li><p>Access expertly crafted practice tests that reflect the actual DASM exam, helping you familiarize yourself with the question format and exam structure.</p></li><li><p>Reinforce key Disciplined Agile concepts such as choosing the right agile lifecycle, tailoring agile practices, lean governance, and continuous improvement.</p></li><li><p>Identify areas of improvement through detailed explanations and rationale for each question, allowing you to sharpen your decision-making and problem-solving skills.</p></li><li><p>Learn how to apply the Disciplined Agile toolkit to address real-world challenges and lead teams toward success in any agile environment.</p></li></ul><p>Who Should Take This Course? This course is perfect for Scrum Masters, Agile Coaches, Project Managers, Product Owners, Program Managers, and anyone looking to deepen their understanding of the Disciplined Agile framework and achieve the DASM certification.</p>",
    "detected_language": "en",
    "has_certificate": false,
    "has_closed_caption": false,
    "headline": "Disciplined Agile Scrum Master Exam Simulator: Get Certified with Confidence",
    "id": 6224329,
    "id_name": "disciplined-agile-scrum-master-dasm-practice-tests",
    "image": "https://img-c.udemycdn.com/course/480x270/6224329_8dec.jpg",
    "image_hq": "https://img-c.udemycdn.com/course/750x422/6224329_8dec.jpg",
    "instructional_level_simple": "Beginner",
    "instructors": [
      { "Manish Nadar": "https://www.udemy.com/user/manish-nadar-22/" }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": false,
    "is_in_any_ufb_content_collection": false,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": true,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": [],
    "language": "English",
    "last_db_change_time": "Thu, 07 Nov 2024 15:09:54 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 15:09:53 GMT",
    "last_updated": "Sat, 12 Oct 2024 00:00:00 GMT",
    "num_assignments": 0,
    "num_coding_exercises": 0,
    "num_curriculum_items": 6,
    "num_lectures": 0,
    "num_practice_tests": 6,
    "num_quizzes": 6,
    "num_reviews": 2,
    "num_subscribers": 354,
    "objectives": [
      "Understanding Disciplined Agile Principles:",
      "Role of a Disciplined Agile Scrum Master",
      "Agile Lifecycle Choices",
      "Tailoring Agile Practices",
      "Practice for DASM Certification Exam"
    ],
    "primary_category": "IT & Software",
    "primary_subcategory": "IT Certifications",
    "quality_review_admin_rating": null,
    "quality_review_score": null,
    "quality_status": "approved",
    "rating": 5,
    "requirements_data": ["Desire to Learn"],
    "sm_sending_time": {},
    "status_label": "Live",
    "target_audiences": [
      "Scrum Masters",
      "Agile Coaches",
      "Project Managers",
      "Product Owners",
      "Development Team Leads",
      "Business Analysts",
      "Lean Practitioners"
    ],
    "title": "Disciplined Agile Scrum Master (DASM) - Practice Tests",
    "what_you_will_learn_data": [
      "Understanding Disciplined Agile Principles:",
      "Role of a Disciplined Agile Scrum Master",
      "Agile Lifecycle Choices",
      "Tailoring Agile Practices",
      "Practice for DASM Certification Exam"
    ],
    "who_should_attend_data": [
      "Scrum Masters",
      "Agile Coaches",
      "Project Managers",
      "Product Owners",
      "Development Team Leads",
      "Business Analysts",
      "Lean Practitioners"
    ]
  },
  {
    "badges": [],
    "campaign_type": "instructor_coupon",
    "caption_languages": [],
    "content_info_short": "100 questions",
    "coupon_code": "69F5ACE3032495DDEDC4",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 1000,
    "coupon_uses_remaining": 942,
    "created_date": "Sat, 03 Aug 2024 16:59:45 GMT",
    "description": "<p>Unlock the power of SQL with the Oracle Database 11g: SQL Fundamentals I (1Z0-051) course! This comprehensive course is designed for beginners and professionals alike, providing you with the essential skills to interact with Oracle databases effectively.</p><p>Key Learning Outcomes:</p><ul><li><p>SQL Basics: Understand fundamental SQL concepts and their role in relational databases.</p></li><li><p>Data Retrieval: Master the art of writing SELECT statements to retrieve data from one or more tables.</p></li><li><p>Data Manipulation: Learn to use INSERT, UPDATE, and DELETE statements to manage data.</p></li><li><p>Function and Expression Usage: Apply single-row functions, conversion functions, and conditional expressions to customize and manipulate data.</p></li><li><p>Joins and Subqueries: Retrieve data from multiple tables using various join techniques and subqueries.</p></li><li><p>Aggregation and Grouping: Use group functions and the GROUP BY clause for data analysis.</p></li><li><p>Database Object Management: Create and manage database objects like tables, views, indexes, sequences, and synonyms.</p></li></ul><p>Who Should Enroll:</p><ul><li><p>Beginners to SQL: No prior experience required.</p></li><li><p>Database Administrators and Developers: Enhance your SQL skills for database management and application development.</p></li><li><p>Data Analysts and IT Professionals: Improve your ability to retrieve and analyze data.</p></li><li><p>Students and Career Changers: Build a solid foundation in SQL for future career opportunities.</p></li></ul><p>Course Benefits:</p><ul><li><p>Hands-On Practice: Engage in practical exercises with real-world examples.</p></li><li><p>Certification Preparation: Get ready for the Oracle Database 11g: SQL Fundamentals I (1Z0-051) certification exam.</p></li><li><p>Career Advancement: Boost your career prospects with valuable SQL skills and an industry-recognized certification.</p></li></ul><p>Join us in this engaging and interactive course to master SQL fundamentals and open doors to new career opportunities in database management and development.</p><p><br></p>",
    "detected_language": "en",
    "has_certificate": false,
    "has_closed_caption": false,
    "headline": "\"Master SQL Fundamentals and Unlock the Power of Oracle Database 11g\"",
    "id": 6108325,
    "id_name": "1z0-051-oracle-sql-fundamentals-practice-test-2024",
    "image": "https://img-c.udemycdn.com/course/480x270/6108325_650c_2.jpg",
    "image_hq": "https://img-c.udemycdn.com/course/750x422/6108325_650c_2.jpg",
    "instructional_level_simple": "All Levels",
    "instructors": [
      { "MD ZAHEDUL ISLAM": "https://www.udemy.com/user/md-zahedul-islam-10/" }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": false,
    "is_in_any_ufb_content_collection": false,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": true,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": [],
    "language": "English",
    "last_db_change_time": "Thu, 07 Nov 2024 15:09:54 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 15:09:49 GMT",
    "last_updated": "Sun, 04 Aug 2024 00:00:00 GMT",
    "num_assignments": 0,
    "num_coding_exercises": 0,
    "num_curriculum_items": 4,
    "num_lectures": 0,
    "num_practice_tests": 4,
    "num_quizzes": 4,
    "num_reviews": 0,
    "num_subscribers": 2790,
    "objectives": [
      "Introduction to SQL:  Understand the basic concepts of relational databases and SQL.",
      "Retrieving Data Using the SQL SELECT Statement:  Learn how to write basic SQL SELECT statements to retrieve data from one or more tables.",
      "Restricting and Sorting Data:  Apply various conditions to filter data using the WHERE clause.",
      "Using Single-Row Functions to Customize Output:  Utilize single-row functions such as character, number, and date functions."
    ],
    "primary_category": "IT & Software",
    "primary_subcategory": "IT Certifications",
    "quality_review_admin_rating": null,
    "quality_review_score": null,
    "quality_status": "approved",
    "rating": 0,
    "requirements_data": [
      "Basic Computer Skills:  Familiarity with using a computer, including the ability to work with files and software applications.",
      "Understanding of Databases:  A basic understanding of database concepts is helpful but not mandatory.",
      "Basic Mathematics:  Comfort with basic arithmetic and logical operations.",
      "English Proficiency:  Ability to read and understand technical documentation in English.",
      "Access to an Oracle Database Environment:  It is beneficial to have access to an Oracle Database environment for hands-on practice.",
      "Interest in SQL and Databases:  A keen interest in learning SQL and working with databases will help in staying motivated and engaged throughout the course."
    ],
    "sm_sending_time": {},
    "status_label": "Live",
    "target_audiences": [
      "Beginners to SQL:  Individuals who are new to SQL and want to learn the basics of querying and managing data in a relational database.",
      "Database Administrators:  Aspiring or current database administrators who want to solidify their understanding of SQL.",
      "Developers:  Software developers and application developers who need to interact with databases as part of their development tasks.",
      "Data Analysts:  Data analysts and business intelligence professionals who need to retrieve and analyze data stored in Oracle databases.",
      "IT Professionals:  IT professionals looking to expand their skill set to include SQL and database management.",
      "Students and Graduates:  Students in computer science, information technology, or related fields who want to gain practical SQL skills.",
      "Professionals Seeking Certification:  Anyone aiming to obtain the Oracle Database 11g: SQL Fundamentals I certification (1Z0-051) to validate their skills and enhance career prospects."
    ],
    "title": "1Z0-051: Oracle SQL Fundamentals Practice Test 2024",
    "what_you_will_learn_data": [
      "Introduction to SQL:  Understand the basic concepts of relational databases and SQL.",
      "Retrieving Data Using the SQL SELECT Statement:  Learn how to write basic SQL SELECT statements to retrieve data from one or more tables.",
      "Restricting and Sorting Data:  Apply various conditions to filter data using the WHERE clause.",
      "Using Single-Row Functions to Customize Output:  Utilize single-row functions such as character, number, and date functions."
    ],
    "who_should_attend_data": [
      "Beginners to SQL:  Individuals who are new to SQL and want to learn the basics of querying and managing data in a relational database.",
      "Database Administrators:  Aspiring or current database administrators who want to solidify their understanding of SQL.",
      "Developers:  Software developers and application developers who need to interact with databases as part of their development tasks.",
      "Data Analysts:  Data analysts and business intelligence professionals who need to retrieve and analyze data stored in Oracle databases.",
      "IT Professionals:  IT professionals looking to expand their skill set to include SQL and database management.",
      "Students and Graduates:  Students in computer science, information technology, or related fields who want to gain practical SQL skills.",
      "Professionals Seeking Certification:  Anyone aiming to obtain the Oracle Database 11g: SQL Fundamentals I certification (1Z0-051) to validate their skills and enhance career prospects."
    ]
  },
  {
    "badges": ["New"],
    "campaign_type": "instructor_coupon",
    "caption_languages": ["English [Auto]"],
    "content_info_short": "1.5 hours",
    "coupon_code": "CE40979483A36562154A",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 1000,
    "coupon_uses_remaining": 448,
    "created_date": "Thu, 17 Oct 2024 15:44:49 GMT",
    "description": "<p>Unlock the skills needed to excel in any office environment with our Professional Diploma in Office Administration Management. This course is designed for aspiring office administrators, coordinators, and professionals looking to strengthen their administrative expertise and boost their career potential.</p><p>You’ll learn core office administration skills such as effective communication, time management, document handling, and office technology proficiency. Gain insights into creating organized, productive workspaces, managing tasks and workflows efficiently, and supporting human resources functions within an office setting. Additionally, the course covers financial basics, customer service, and compliance with health and safety standards, ensuring you’re well-prepared for real-world challenges.</p><p>With hands-on exercises and practical case studies, you’ll apply what you learn directly to simulated office scenarios, building confidence in your ability to manage day-to-day office operations. By the end of this course, you’ll be equipped with the skills to handle office tasks professionally, optimize organizational processes, and make valuable contributions to any workplace.</p><p>Enroll now to start your journey toward becoming a skilled and certified office administration professional! Whether you’re a recent graduate, looking for a career change, or a current professional, this course will set you apart in the competitive job market. Upon completion, you'll receive a professional diploma, showcasing your expertise and readiness for a successful career in office administration. </p>",
    "detected_language": "en",
    "has_certificate": true,
    "has_closed_caption": true,
    "headline": "Master Essential Office Administration Skills: Organization, Communication, Document Management &amp; Office Operations",
    "id": 6241035,
    "id_name": "officeadministrationmanagement",
    "image": "https://img-c.udemycdn.com/course/480x270/6241035_25ed_3.jpg",
    "image_hq": "https://img-c.udemycdn.com/course/750x422/6241035_25ed_3.jpg",
    "instructional_level_simple": "All Levels",
    "instructors": [
      { "Md. Aliful Islam": "https://www.udemy.com/user/ion-international/" }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": false,
    "is_in_any_ufb_content_collection": false,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": false,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": [],
    "language": "English",
    "last_db_change_time": "Thu, 07 Nov 2024 15:09:54 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 15:09:54 GMT",
    "last_updated": "Sun, 03 Nov 2024 00:00:00 GMT",
    "num_assignments": 0,
    "num_coding_exercises": 0,
    "num_curriculum_items": 15,
    "num_lectures": 15,
    "num_practice_tests": 0,
    "num_quizzes": 0,
    "num_reviews": 0,
    "num_subscribers": 568,
    "objectives": [
      "Role and importance of office administration in organizations",
      "Key skills for effective office management",
      "Ethical considerations and professionalism in office settings",
      "Understanding different organizational structures",
      "Best practices for creating a productive office environment",
      "Ergonomics and workspace management",
      "Business writing and email etiquette",
      "Managing office meetings and presentations",
      "Filing systems, both physical and digital",
      "Confidentiality and information security",
      "Record retention policies and procedures",
      "Prioritizing tasks and setting realistic deadlines",
      "Time management tools and techniques",
      "Delegation skills and teamwork in office settings",
      "Using office software (e.g., Microsoft Office Suite, Google Workspace)",
      "Managing virtual meetings and digital collaboration tools",
      "Basic troubleshooting and IT support for common office equipment",
      "Basic HR functions relevant to office administration",
      "Recruitment support, onboarding, and training coordination",
      "Workplace policies, including leave, attendance, and disciplinary procedures",
      "Financial Administration Basics",
      "Customer Service and Client Interaction",
      "Health, Safety, and Office Regulations"
    ],
    "primary_category": "Business",
    "primary_subcategory": "Management",
    "quality_review_admin_rating": 7,
    "quality_review_score": 45,
    "quality_status": "approved",
    "rating": 0,
    "requirements_data": [
      "No prior experience in office administration is required.",
      "Proficiency in English for reading, writing, and following instructions.",
      "High school diploma or equivalent educational background."
    ],
    "sm_sending_time": {},
    "status_label": "Live",
    "target_audiences": [
      "Aspiring office administrators, coordinators, and administrative assistants",
      "Professionals looking to upskill in office management and administrative functions",
      "Recent graduates or career changers seeking a foundation in office administration",
      "Anyone interested in developing organizational, communication, and management skills for an office environment"
    ],
    "title": "Professional Diploma in Office Administration Management",
    "what_you_will_learn_data": [
      "Role and importance of office administration in organizations",
      "Key skills for effective office management",
      "Ethical considerations and professionalism in office settings",
      "Understanding different organizational structures",
      "Best practices for creating a productive office environment",
      "Ergonomics and workspace management",
      "Business writing and email etiquette",
      "Managing office meetings and presentations",
      "Filing systems, both physical and digital",
      "Confidentiality and information security",
      "Record retention policies and procedures",
      "Prioritizing tasks and setting realistic deadlines",
      "Time management tools and techniques",
      "Delegation skills and teamwork in office settings",
      "Using office software (e.g., Microsoft Office Suite, Google Workspace)",
      "Managing virtual meetings and digital collaboration tools",
      "Basic troubleshooting and IT support for common office equipment",
      "Basic HR functions relevant to office administration",
      "Recruitment support, onboarding, and training coordination",
      "Workplace policies, including leave, attendance, and disciplinary procedures",
      "Financial Administration Basics",
      "Customer Service and Client Interaction",
      "Health, Safety, and Office Regulations"
    ],
    "who_should_attend_data": [
      "Aspiring office administrators, coordinators, and administrative assistants",
      "Professionals looking to upskill in office management and administrative functions",
      "Recent graduates or career changers seeking a foundation in office administration",
      "Anyone interested in developing organizational, communication, and management skills for an office environment"
    ]
  },
  {
    "badges": [],
    "campaign_type": "instructor_coupon",
    "caption_languages": ["English [Auto]"],
    "content_info_short": "5.5 hours",
    "coupon_code": "4B688FA86D89EB21363F",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 1000,
    "coupon_uses_remaining": 133,
    "created_date": "Tue, 07 Jun 2022 14:53:40 GMT",
    "description": "<p>It's 2024 and this is the year, you finally land your dream job in big tech! Hiring season has already started! </p><p>Do you want to make the next big step in your software engineering career and land a a job at one of the big tech company like Google, Facebook, Amazon, Microsoft, Netflix, or other tech-savvy companies? But, you don't have any idea how to even start systematically prepare for the system design interview? Then this course is for you! </p><p>This course is taught by an experiences senior software engineer who landed a job in big tech just after going through the same as go you through right now. </p><p><br></p><p>Only a minority of developers today own a computer science degree, many more are \"self taught\" or boot camp graduates. Many feel intimidated by the system design interviews of big tech as topics large-scale architecture and design patterns you will barely learn from day-to-day coding experience.</p><p>This course allow to catch up and learn enough system design fundamentals to get through the interview, without drowning students in endless theory lessons. </p><p><br></p><p>Included in the course fee is your access to a private online community to find fellow students to discuss system design question and find a sparring partner for mock interviews! </p><p><br></p><p>In this course you will learn the following: </p><p><br></p><p>This course covers all commonly discussed systems!</p><p><br></p><p>I help you to understand what's the expectation and take you on a deep-dive into all commonly discussed systems within the system design interview. </p><p><br></p><ul><li><p>Netflix</p></li><li><p>Youtube</p></li><li><p>Amazon</p></li><li><p>Dropbox</p></li><li><p>Instagram</p></li><li><p>Facebook</p></li><li><p>Twitter</p></li><li><p>Whatsapp</p></li></ul><p><br></p><p>Learn the interview structure hands-on!</p><p>For each system we walk through the entire interview structure together step-by-step:</p><p><br></p><p>1. Functional Requirements Engineering  </p><p>2. Non-Functional Requirements Engineering</p><p>3. Capacity Estimations</p><p>4. Data Model Design</p><p>5. System Design</p><p>6. Component Design</p><p><br></p><p>All Technologies, Architectures and Patterns are explained, no prior experience needed!</p><p>We will draw each of these real-world systemsand discuss all design choices made. Iintroduce all technologies, architectures and patterns we come across:</p><p><br></p><ul><li><p>Micros Services</p></li><li><p>Load Balancer</p></li><li><p>Servers & Clients</p></li><li><p>Databases</p></li><li><p>Message Broker</p></li><li><p>Many More</p></li></ul><p><br></p><p>Drill-down to Component Level Design</p><p>The course is intended to go beyond covering the bare minimum of knowledge to barely pass the interview. I cover enough depth so you feel confident to handle any bar raiser question your interviewer might come up with. That's why we will down the the component level design to make sure you have some backup knowledge to shine with!</p><p><br></p><p>Disclaimer:This course is applied!</p><p>You won't be asked to just lean back and enjoy the show. I leverage Excalidraw, the great collaborative white board tool to draw to help you actively follow the course, make up your own mind about each design and draw it the way you believe would be best!</p><p><br></p><p> Who is your Instructor?</p><p>I am an experienced instructor with more than 10.000 taught students on Udemy alone. I am also a senior software engineer working in big tech. I have gone through the same interview process myself and Ialso conduct interviews from the other side of the table. Moreover, Idesign system architectures on a daily bases.</p><p><br></p><p>My goal is to teach you everything it takes for you to master your system design interview with confidence and ease!</p><p><br></p><p>You don't have to be an expert in any of it to get started!</p>",
    "detected_language": "en",
    "has_certificate": true,
    "has_closed_caption": true,
    "headline": "The Complete Guide to Nail Your Next System Design Interview - Hands-On, Project-Based Learning with Discord Community!",
    "id": 4722894,
    "id_name": "the-bigtech-system-design-interview-bootcamp",
    "image": "https://img-c.udemycdn.com/course/480x270/4722894_fb56.jpg",
    "image_hq": "https://img-c.udemycdn.com/course/750x422/4722894_fb56.jpg",
    "instructional_level_simple": "Intermediate",
    "instructors": [
      {
        "Fabian Hinsenkamp | Senior Software Engineer @Microsoft": "https://www.udemy.com/user/alexander-kurt/"
      }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": true,
    "is_in_any_ufb_content_collection": true,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": false,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": ["Interviewing Skills", "System Design Interview"],
    "language": "English",
    "last_db_change_time": "Thu, 07 Nov 2024 15:09:54 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 15:09:51 GMT",
    "last_updated": "Wed, 24 Apr 2024 00:00:00 GMT",
    "num_assignments": 0,
    "num_coding_exercises": 0,
    "num_curriculum_items": 72,
    "num_lectures": 57,
    "num_practice_tests": 0,
    "num_quizzes": 15,
    "num_reviews": 537,
    "num_subscribers": 26796,
    "objectives": [
      "Develop a deeper understanding of architecture principles and design patterns, which will enhance your overall software engineering skills and knowledge.",
      "Become more confident and well-prepared to tackle any system design interview with ease and effectiveness, gaining a competitive edge.",
      "Differentiate yourself from other candidates and increase your chances of landing your dream job in big tech.",
      "Knowledge of functional and non-functional requirements engineering and capacity estimation in system design.",
      "Gain Hands-on experience with component-level system design and real-world application through 10 mock interview challenges.",
      "Pursue more rewarding career opportunities in the tech industry, max-out your earning potential!"
    ],
    "primary_category": "IT & Software",
    "primary_subcategory": "Other IT & Software",
    "quality_review_admin_rating": 7,
    "quality_review_score": 45,
    "quality_status": "approved",
    "rating": 4.6,
    "requirements_data": [
      "No dedicated prior system design experience required.",
      "No paid tools required, we will use a free and easy to use web-based whiteboard tool.",
      "A discord account is required to join our private community to discuss your designs"
    ],
    "sm_sending_time": {
      "telegram": {
        "@programming_courses": "Wed, 06 Nov 2024 03:22:18 GMT",
        "@udemy_dev": "Wed, 06 Nov 2024 03:25:51 GMT"
      }
    },
    "status_label": "Live",
    "target_audiences": [
      "Any software engineer who want to prepare for a system design interview.",
      "Any graduate who want to understand how system design interviews work.",
      "Anyone who wants to become a better developer.",
      "Any self taught programmer who missed out on a computer science degree.",
      "Everyone who are interested in large-scale system architecture.",
      "Software Architects / Tech Leads who want to extend their knowledge.",
      "Experienced Engineers who have been laid off and want to brush up their interviewing skills."
    ],
    "title": "The \"BigTech\" System Design Interview Bootcamp",
    "what_you_will_learn_data": [
      "Develop a deeper understanding of architecture principles and design patterns, which will enhance your overall software engineering skills and knowledge.",
      "Become more confident and well-prepared to tackle any system design interview with ease and effectiveness, gaining a competitive edge.",
      "Differentiate yourself from other candidates and increase your chances of landing your dream job in big tech.",
      "Knowledge of functional and non-functional requirements engineering and capacity estimation in system design.",
      "Gain Hands-on experience with component-level system design and real-world application through 10 mock interview challenges.",
      "Pursue more rewarding career opportunities in the tech industry, max-out your earning potential!"
    ],
    "who_should_attend_data": [
      "Any software engineer who want to prepare for a system design interview.",
      "Any graduate who want to understand how system design interviews work.",
      "Anyone who wants to become a better developer.",
      "Any self taught programmer who missed out on a computer science degree.",
      "Everyone who are interested in large-scale system architecture.",
      "Software Architects / Tech Leads who want to extend their knowledge.",
      "Experienced Engineers who have been laid off and want to brush up their interviewing skills."
    ]
  },
  {
    "badges": [],
    "campaign_type": "instructor_coupon",
    "caption_languages": ["Spanish [Auto]"],
    "content_info_short": "1.5 hours",
    "coupon_code": "PAGINA-IA43",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 1000,
    "coupon_uses_remaining": 868,
    "created_date": "Sun, 24 Sep 2023 22:52:11 GMT",
    "description": "<p>¿DESEAS CREAR UNA PÁGINA WEB PARA TU NEGOCIO CON LA AYUDA DE LA INTELIGENCIA ARTIFICIAL?</p><p><br>Crear una página web con Inteligencia Artificial hace que todo sea más fácil y te ahorra tiempo y esfuerzo, que puedes utilizar para tareas más importantes. Si tu presupuesto no es muy alto, crear una página web con IA te ayuda a ahorrar dinero. Es más económico que contratar un desarrollador web.</p><p><br>El Creador de Sitios Web con IA de Hostinger es una herramienta online que utiliza inteligencia artificial para crear un sitio web personalizado desde cero. De esta manera, puedes generar una web de forma más fácil y rápida. Adicionalmente, el creador web con IA de Hostinger ofrece herramientas incorporadas para que puedas hacer más modificaciones a tu sitio web.</p><p><br></p><p>¿CÓMO FUNCIONA EL CREADOR DE SITIOS WEB CON IA DE HOSTINGER?</p><p><br></p><p>Es fácil. Solo tienes que describir tu negocio y elegir el sitio web que más te guste y se adapte a lo que necesitas.<br></p><p>El creador con IA escribirá el contenido, utilizará imágenes libres de derecho y elegirá los colores y tipografías adecuados para ti, según tu descripción.<br></p><p>Una vez se genera tu sitio, puedes personalizarlo aún más con el editor de arrastrar y soltar. Modifica y agrega imágenes, videos, botones, textos y más.<br><br>Cuando termines de crear y personalizar tu sitio web, puedes publicarlo en Internet.<br><br>Nuestro curso es 100% práctico, lo guiaremos a través de diversos pasos y juntos crearemos su sitio web con Inteligencia Artificial, de modo que al finalizar nuestro curso, tendrá su sitio web diseñado con su personalización y a su gusto.<br><br><br>¿QUÉ APRENDERÁS EN NUESTRO CURSO?<br><br></p><ul><li><p>Cómo obtener un dominio y hosting para crear tu sitio web con Inteligencia Artificial.</p></li><li><p>Cómo crear un logotipo con Inteligencia Artificial.</p></li><li><p>Cómo instalar el Creador de Sitios Web con IA de Hostinger.</p></li><li><p>Cómo crear sitios web profesionales con Inteligencia Artificial desde cero.</p></li><li><p>Cómo personalizar el diseño de tu sitio web de forma profesional.</p></li><li><p>Cómo crear un formulario de contacto para tu sitio web.</p></li><li><p>Cómo adaptar tu sitio web para dispositivos móviles (tablets y celulares).</p></li><li><p>Cómo realizar configuraciones SEO para posicionar tu sitio web en los principales buscadores.</p></li></ul><p><br>¿POR QUÉ ACCEDER A NUESTRO CURSO?</p><p><br>Nuestro curso de \"Cómo Crear una Página Web con Inteligencia Artificial\", es impartido por el experto y consultor de marketing digital: \"Renato Yacolca\", creador de uno de los canales de YouTube más populares del mundo en los temas de tutoriales y marketing digital: Programación Fácil, SEO y Marketing, con más de 180,000 estudiantes (Botón de Plata de YouTube), en el que le mostrará las diversas formas de crear un sitio web con Inteligencia Artificial de forma rápida y sencilla. <br><br><br>¡ACCEDE AHORA AL CURSO!</p><p><br>Inscríbase ahora y empiece con su aprendizaje en nuestro curso. Hay herramientas interesantes, atractivas y nuevas que aprender en el creador de sitios web con IA de Hostinger.<br><br></p><p>Si tiene alguna pregunta sobre el contenido del curso o algo relacionado con este tema, siempre puede publicar una pregunta en el curso o enviarme un mensaje directo.<br><br></p><p>¡Adelante, haz clic en el botón de COMPRAR AHORA y te veré en la lección 1!</p><p>Saludos,</p><p>Renato Yacolca</p>",
    "detected_language": "es",
    "has_certificate": true,
    "has_closed_caption": true,
    "headline": "Aprende a cómo crear una página web con Inteligencia Artificial de forma fácil y simple, sin saber de programación.",
    "id": 5576672,
    "id_name": "como-crear-una-pagina-web-con-inteligencia-artificial",
    "image": "https://img-c.udemycdn.com/course/480x270/5576672_6ff3.jpg",
    "image_hq": "https://img-c.udemycdn.com/course/750x422/5576672_6ff3.jpg",
    "instructional_level_simple": "All Levels",
    "instructors": [
      {
        "Renato Jesús Yacolca Neyra": "https://www.udemy.com/user/renato-jesus-yacolca-neyra-2/"
      }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": false,
    "is_in_any_ufb_content_collection": false,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": false,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": [],
    "language": "Spanish",
    "last_db_change_time": "Thu, 07 Nov 2024 15:09:54 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 15:09:53 GMT",
    "last_updated": "Thu, 03 Oct 2024 00:00:00 GMT",
    "num_assignments": 0,
    "num_coding_exercises": 0,
    "num_curriculum_items": 13,
    "num_lectures": 13,
    "num_practice_tests": 0,
    "num_quizzes": 0,
    "num_reviews": 79,
    "num_subscribers": 13631,
    "objectives": [
      "Cómo obtener un dominio y hosting para crear tu sitio web con Inteligencia Artificial.",
      "Cómo crear un logotipo con Inteligencia Artificial.",
      "Cómo instalar el Creador de Sitios Web con IA de Hostinger.",
      "Cómo crear sitios web profesionales con Inteligencia Artificial desde cero.",
      "Cómo personalizar el diseño de tu sitio web de forma profesional.",
      "Cómo crear un formulario de contacto para tu sitio web.",
      "Cómo adaptar tu sitio web para dispositivos móviles (tablets y celulares).",
      "Cómo realizar configuraciones SEO para posicionar tu sitio web en los principales buscadores."
    ],
    "primary_category": "Development",
    "primary_subcategory": "No-Code Development",
    "quality_review_admin_rating": 7,
    "quality_review_score": 35,
    "quality_status": "approved",
    "rating": 3.2,
    "requirements_data": [
      "Necesitas tener una computadora o laptop.",
      "Conexión a Internet.",
      "No necesitas tener experiencia en diseño web, ni en programación."
    ],
    "sm_sending_time": {},
    "status_label": "Live",
    "target_audiences": [
      "Emprendedores y personas que deseen conseguir tráfico web y ventas en un sitio web creado con Inteligencia Artificial.",
      "Emprendedores y personas que deseen configurar un sitio web diseñado profesionalmente desde cero.",
      "Emprendedores y personas que busquen comenzar una carrera en el nicho de creación de sitios web con Inteligencia Artificial.",
      "Emprendedores y personas que quieran aprender a usar el Creador de Sitios Web con IA de Hostinger de forma profesional."
    ],
    "title": "Cómo Crear una Página Web con Inteligencia Artificial 2024",
    "what_you_will_learn_data": [
      "Cómo obtener un dominio y hosting para crear tu sitio web con Inteligencia Artificial.",
      "Cómo crear un logotipo con Inteligencia Artificial.",
      "Cómo instalar el Creador de Sitios Web con IA de Hostinger.",
      "Cómo crear sitios web profesionales con Inteligencia Artificial desde cero.",
      "Cómo personalizar el diseño de tu sitio web de forma profesional.",
      "Cómo crear un formulario de contacto para tu sitio web.",
      "Cómo adaptar tu sitio web para dispositivos móviles (tablets y celulares).",
      "Cómo realizar configuraciones SEO para posicionar tu sitio web en los principales buscadores."
    ],
    "who_should_attend_data": [
      "Emprendedores y personas que deseen conseguir tráfico web y ventas en un sitio web creado con Inteligencia Artificial.",
      "Emprendedores y personas que deseen configurar un sitio web diseñado profesionalmente desde cero.",
      "Emprendedores y personas que busquen comenzar una carrera en el nicho de creación de sitios web con Inteligencia Artificial.",
      "Emprendedores y personas que quieran aprender a usar el Creador de Sitios Web con IA de Hostinger de forma profesional."
    ]
  },
  {
    "badges": [],
    "campaign_type": "instructor_coupon",
    "caption_languages": ["English [Auto]"],
    "content_info_short": "1 hour",
    "coupon_code": "A9AF838B9367EC28A933",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 1000,
    "coupon_uses_remaining": 540,
    "created_date": "Fri, 23 Aug 2024 12:22:15 GMT",
    "description": "<p>Unlock the secrets to a thriving freelance career with \"Freelancing Secrets: How to Build a Lucrative Career.\" This comprehensive course is designed for anyone looking to start or elevate their freelancing journey, whether you're a job holder seeking extra income, a student exploring new opportunities, or a housewife aiming to work from home.</p><p>Whether you're just starting out or looking to take your freelance business to the next level, this course provides you with the tools, strategies, and insights needed to thrive in the competitive world of freelancing. From finding clients and setting rates to managing projects and scaling your business, you'll learn how to navigate the freelancing landscape with confidence and skill.</p><p>In this course, you'll learn the essential skills and strategies to build a successful freelance business. From finding and securing high-paying clients to mastering effective networking and growing your income, you'll gain the tools and knowledge needed to create a flexible, profitable career. We’ll cover everything from setting up your freelance operations to scaling your business for long-term success.</p><p>With practical tips, real-world examples, and easy-to-implement techniques, this course is your blueprint for achieving financial independence and professional fulfillment through freelancing. Whether you’re just starting out or looking to refine your skills, this course offers valuable insights for every stage of your freelance career. Join us and take the first step toward building the freelance career you’ve always dreamed of!</p>",
    "detected_language": "en",
    "has_certificate": true,
    "has_closed_caption": true,
    "headline": "Freelancing, freelance, freelancer, fiverr, upwork, fiverr course, Freelancing tips and strategies, passive income",
    "id": 6143377,
    "id_name": "freelancingcareer",
    "image": "https://img-c.udemycdn.com/course/480x270/6143377_9daf_4.jpg",
    "image_hq": "https://img-c.udemycdn.com/course/750x422/6143377_9daf_4.jpg",
    "instructional_level_simple": "All Levels",
    "instructors": [
      { "Md. Aliful Islam": "https://www.udemy.com/user/ion-international/" }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": false,
    "is_in_any_ufb_content_collection": false,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": false,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": [],
    "language": "English",
    "last_db_change_time": "Thu, 07 Nov 2024 15:09:54 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 15:09:49 GMT",
    "last_updated": "Sun, 03 Nov 2024 00:00:00 GMT",
    "num_assignments": 0,
    "num_coding_exercises": 0,
    "num_curriculum_items": 23,
    "num_lectures": 23,
    "num_practice_tests": 0,
    "num_quizzes": 0,
    "num_reviews": 56,
    "num_subscribers": 5817,
    "objectives": [
      "Understand the fundamentals of freelancing and how to start a freelance business.",
      "Learn effective methods for finding and attracting clients.",
      "Master pricing strategies and negotiation techniques to ensure fair compensation",
      "Gain skills in managing freelance projects, including time management and client communication.",
      "Explore strategies for growing and scaling a freelance business.",
      "Learn how to maintain work-life balance and avoid burnout as a freelancer.",
      "Develop a personal brand and online presence that attracts high-paying clients.",
      "Best freelancing platforms",
      "Techniques to succeed in freelancing",
      "freelancing for job holders/housewives' to get some extra money"
    ],
    "primary_category": "Business",
    "primary_subcategory": "Entrepreneurship",
    "quality_review_admin_rating": 7,
    "quality_review_score": 45,
    "quality_status": "approved",
    "rating": 4.5,
    "requirements_data": [
      "No prior freelancing experience is required.",
      "Basic computer skills and familiarity with online tools and platforms."
    ],
    "sm_sending_time": {
      "telegram": { "@udemy_business": "Wed, 06 Nov 2024 20:04:12 GMT" }
    },
    "status_label": "Live",
    "target_audiences": [
      "Aspiring freelancers looking to start a career in freelancing.",
      "Current freelancers seeking to enhance their skills and grow their business.",
      "Professionals considering a transition from full-time employment to freelancing.",
      "Entrepreneurs interested in offering freelance services as part of their business.",
      "Anyone looking to learn the ins and outs of building a successful freelance career."
    ],
    "title": "Freelancing Secrets: How to Build a Lucrative Career",
    "what_you_will_learn_data": [
      "Understand the fundamentals of freelancing and how to start a freelance business.",
      "Learn effective methods for finding and attracting clients.",
      "Master pricing strategies and negotiation techniques to ensure fair compensation",
      "Gain skills in managing freelance projects, including time management and client communication.",
      "Explore strategies for growing and scaling a freelance business.",
      "Learn how to maintain work-life balance and avoid burnout as a freelancer.",
      "Develop a personal brand and online presence that attracts high-paying clients.",
      "Best freelancing platforms",
      "Techniques to succeed in freelancing",
      "freelancing for job holders/housewives' to get some extra money"
    ],
    "who_should_attend_data": [
      "Aspiring freelancers looking to start a career in freelancing.",
      "Current freelancers seeking to enhance their skills and grow their business.",
      "Professionals considering a transition from full-time employment to freelancing.",
      "Entrepreneurs interested in offering freelance services as part of their business.",
      "Anyone looking to learn the ins and outs of building a successful freelance career."
    ]
  },
  {
    "badges": [],
    "campaign_type": "instructor_coupon",
    "caption_languages": ["English [Auto]"],
    "content_info_short": "119 hours",
    "coupon_code": "FD31FAE88361A4CC5F64",
    "coupon_discount_percent": 100,
    "coupon_max_uses": 1000,
    "coupon_uses_remaining": 637,
    "created_date": "Wed, 28 Feb 2018 18:05:48 GMT",
    "description": "<p>Get ready for a deep dive into Financial Accounting, a critical skill for any aspiring accountant, business owner, or student. This comprehensive course offers you lifetime access to many sections of engaging video content, a multitude of real-world examples, practice problems, and an extensive, downloadable e-book in EPUB, MOBI, and PDF formats.</p><p>From the fundamentals of the double-entry accounting system to the complexities of long-term liabilities and cash flow statements, this course covers a breadth of topics equivalent to an undergraduate Financial Accounting program. The course supplements academic study by providing an online resource you can refer back to, ensuring the concepts stay fresh and readily accessible.</p><p>We begin with an introduction to Financial Accounting and progress steadily through various topics, including recording transactions, adjusting and closing entries, merchandising transactions, and various cost flow assumptions. Specialized sections delve into subsidiary ledgers, bank reconciliations, depreciation methods, payroll accounting, and more.</p><p>The course incorporates Excel for practical application of the theories taught. If you're unfamiliar with Excel, fear not! We provide pre-formatted worksheets and step-by-step instructional videos that move at a friendly pace.</p><p>We debunk the myths surrounding debits and credits, illustrate how to record transactions using these methods, and demonstrate the importance of period-end adjusting entries.</p><p>This course is more than just a procedural guide—it stresses the understanding of underlying theories to make learners flexible and adaptable in a constantly changing environment. You'll learn the rationale behind financial accounting processes, ensuring you can apply these skills in a variety of contexts.</p><p>Incorporating real-world scenarios, each section breaks down complex concepts into understandable chunks, followed by practical application in Excel.</p><p>Topics include, but are not limited to:</p><p>· Debits and Credits</p><p>· Period End Adjusting Entries</p><p>· Recording Closing Entries</p><p>· Inventory Transactions</p><p>· Subsidiary Ledgers & Special Journals</p><p>· Bank Reconciliations</p><p>· Accounts Receivable</p><p>· Depreciation Methods</p><p>· Payroll Accounting</p><p>· Partnership Accounting</p><p>· Corporate Accounting</p><p>· Bonds Payable, Notes Payable, & Long-Term Liabilities</p><p>· Cash Flow Statements</p><p>The course is designed to start at the basics and gradually advance to the level of detail expected in an undergraduate program. By course completion, you will have a firm grasp on Financial Accounting that not only stands the test of time but also serves as a continuously available resource in your accounting journey. Enroll now to become a confident, adaptable accounting professional.</p><p><br></p>",
    "detected_language": "en",
    "has_certificate": true,
    "has_closed_caption": true,
    "headline": "Unlock Financial Accounting Mastery: Comprehensive Course for Students, Professionals, and Business Owners",
    "id": 1574798,
    "id_name": "financial-accounting-accounting-cycle",
    "image": "https://img-c.udemycdn.com/course/480x270/1574798_2fcd_7.jpg",
    "image_hq": "https://img-c.udemycdn.com/course/750x422/1574798_2fcd_7.jpg",
    "instructional_level_simple": "All Levels",
    "instructors": [
      {
        "Robert (Bob) Steele": "https://www.udemy.com/user/c91d6786-95f3-48d8-ab94-cc92431d2aa4/"
      }
    ],
    "is_approved": true,
    "is_banned": false,
    "is_course_in_ub_ever": false,
    "is_in_any_ufb_content_collection": false,
    "is_language_course": false,
    "is_paid": true,
    "is_practice_test_course": false,
    "is_private": false,
    "is_published": true,
    "is_taking_disabled": false,
    "labels": ["Process Mapping", "Financial Accounting"],
    "language": "English",
    "last_db_change_time": "Thu, 07 Nov 2024 15:09:54 GMT",
    "last_udemy_refresh": "Thu, 07 Nov 2024 15:09:53 GMT",
    "last_updated": "Wed, 24 Mar 2021 00:00:00 GMT",
    "num_assignments": 1,
    "num_coding_exercises": 0,
    "num_curriculum_items": 715,
    "num_lectures": 714,
    "num_practice_tests": 0,
    "num_quizzes": 0,
    "num_reviews": 3805,
    "num_subscribers": 188791,
    "objectives": [
      "Grasp the basics of financial accounting and understand its objectives and significance in business.",
      "Demonstrate proficiency in using the double-entry accounting system and interpreting the accounting equation.",
      "Record business transactions using debits and credits, including period-end adjusting entries.",
      "Understand and apply the rules for closing entries at the end of an accounting period.",
      "Handle transactions related to the purchase and sale of inventory, including applying inventory cost flow assumptions such as FIFO, LIFO, and weighted average m",
      "Master the use of subsidiary ledgers and special journals, specifically for accounts receivable and accounts payable",
      "Conduct bank reconciliations and apply best practices for cash internal controls.",
      "Accurately estimate and record allowance for doubtful accounts using both allowance method and direct write-off methods.",
      "Understand, calculate, and record depreciation for property, plant, and equipment using various methods, including straight-line, double-declining balance, and",
      "Handle transactions related to the purchase and sale of property, plant, and equipment.",
      "Understand and execute the payroll accounting process, including the calculation of payroll taxes and recording complex payroll journal entries.",
      "Grasp the unique accounting considerations and transactions for partnerships, including income allocation, admission and withdrawal of a partner, and partnershi",
      "Handle transactions unique to a corporate form of entity, including issuance and repurchase of shares, and dividend distributions.",
      "Understand the concept of bonds payable and notes payable, including their issuance, discount/premium amortization, and interest payment.",
      "Prepare a comprehensive statement of cash flows using both direct and indirect methods, and understand its importance in financial analysis.",
      "Use Excel to perform various accounting tasks, including creation of amortization schedules and financial statement preparation.",
      "Understand how to update and adjust accounting records to reflect changes in the business environment.",
      "Grasp the importance of theory in making appropriate accounting adjustments and decisions.",
      "Learn how to compare and contrast different accounting procedures and choose the most suitable for a given business scenario.",
      "Understand and apply the time-value of money concept in the context of bond and note transactions.",
      "Determine current and long-term portions of notes payable using amortization schedules.",
      "Learn how to adapt accounting procedures and policies to ever-changing business and regulatory environments."
    ],
    "primary_category": "Finance & Accounting",
    "primary_subcategory": "Accounting & Bookkeeping",
    "quality_review_admin_rating": 7,
    "quality_review_score": 60,
    "quality_status": "approved",
    "rating": 4.4,
    "requirements_data": [
      "Familiarity with basic mathematical operations: As the course involves performing calculations for different financial processes, basic mathematical skills are necessary.",
      "Willingness to learn and engage with complex concepts: Financial accounting can be detailed and requires careful study. Being prepared to engage with the content actively will help ensure successful learning outcomes."
    ],
    "sm_sending_time": {
      "telegram": { "@udemy_business": "Tue, 05 Nov 2024 12:45:10 GMT" }
    },
    "status_label": "Live",
    "target_audiences": [
      "Accounting Students: This course serves as an excellent supplement to formal accounting education, providing a practical understanding of financial accounting concepts and their application in real-world scenarios.",
      "Professionals Transitioning to Accounting Roles: If you are considering a career change into an accounting field or seeking to enhance your accounting knowledge and skills, this course will provide a solid foundation.",
      "Small Business Owners and Entrepreneurs: Understanding financial accounting is essential for effectively managing business finances. This course will equip you with the knowledge to interpret financial statements, record transactions accurately, and make informed financial decisions.",
      "Finance and Business Professionals: Professionals working in finance, business, or related fields who want to expand their understanding of financial accounting principles and practices will benefit from this course.",
      "Self-learners and Lifelong Learners: If you have a genuine interest in learning financial accounting, whether for personal enrichment or curiosity, this course provides a comprehensive and structured learning experience.",
      "Bookkeepers and Accountants: Bookkeepers who want to enhance their knowledge of financial accounting principles or accountants looking to refresh their skills will find this course valuable for professional development.",
      "Individuals Preparing for Professional Certification Exams: If you are studying for professional accounting certifications, such as the CPA (Certified Public Accountant) exam, this course can serve as a supplementary resource to reinforce and deepen your understanding of financial accounting concepts.",
      "Anyone Interested in Understanding Business Finances: Financial literacy is crucial for personal and professional success. This course will demystify financial accounting, empowering individuals to make informed financial decisions in their personal and professional lives."
    ],
    "title": "Financial Accounting: A Comprehensive Guide with E-book",
    "what_you_will_learn_data": [
      "Grasp the basics of financial accounting and understand its objectives and significance in business.",
      "Demonstrate proficiency in using the double-entry accounting system and interpreting the accounting equation.",
      "Record business transactions using debits and credits, including period-end adjusting entries.",
      "Understand and apply the rules for closing entries at the end of an accounting period.",
      "Handle transactions related to the purchase and sale of inventory, including applying inventory cost flow assumptions such as FIFO, LIFO, and weighted average m",
      "Master the use of subsidiary ledgers and special journals, specifically for accounts receivable and accounts payable",
      "Conduct bank reconciliations and apply best practices for cash internal controls.",
      "Accurately estimate and record allowance for doubtful accounts using both allowance method and direct write-off methods.",
      "Understand, calculate, and record depreciation for property, plant, and equipment using various methods, including straight-line, double-declining balance, and",
      "Handle transactions related to the purchase and sale of property, plant, and equipment.",
      "Understand and execute the payroll accounting process, including the calculation of payroll taxes and recording complex payroll journal entries.",
      "Grasp the unique accounting considerations and transactions for partnerships, including income allocation, admission and withdrawal of a partner, and partnershi",
      "Handle transactions unique to a corporate form of entity, including issuance and repurchase of shares, and dividend distributions.",
      "Understand the concept of bonds payable and notes payable, including their issuance, discount/premium amortization, and interest payment.",
      "Prepare a comprehensive statement of cash flows using both direct and indirect methods, and understand its importance in financial analysis.",
      "Use Excel to perform various accounting tasks, including creation of amortization schedules and financial statement preparation.",
      "Understand how to update and adjust accounting records to reflect changes in the business environment.",
      "Grasp the importance of theory in making appropriate accounting adjustments and decisions.",
      "Learn how to compare and contrast different accounting procedures and choose the most suitable for a given business scenario.",
      "Understand and apply the time-value of money concept in the context of bond and note transactions.",
      "Determine current and long-term portions of notes payable using amortization schedules.",
      "Learn how to adapt accounting procedures and policies to ever-changing business and regulatory environments."
    ],
    "who_should_attend_data": [
      "Accounting Students: This course serves as an excellent supplement to formal accounting education, providing a practical understanding of financial accounting concepts and their application in real-world scenarios.",
      "Professionals Transitioning to Accounting Roles: If you are considering a career change into an accounting field or seeking to enhance your accounting knowledge and skills, this course will provide a solid foundation.",
      "Small Business Owners and Entrepreneurs: Understanding financial accounting is essential for effectively managing business finances. This course will equip you with the knowledge to interpret financial statements, record transactions accurately, and make informed financial decisions.",
      "Finance and Business Professionals: Professionals working in finance, business, or related fields who want to expand their understanding of financial accounting principles and practices will benefit from this course.",
      "Self-learners and Lifelong Learners: If you have a genuine interest in learning financial accounting, whether for personal enrichment or curiosity, this course provides a comprehensive and structured learning experience.",
      "Bookkeepers and Accountants: Bookkeepers who want to enhance their knowledge of financial accounting principles or accountants looking to refresh their skills will find this course valuable for professional development.",
      "Individuals Preparing for Professional Certification Exams: If you are studying for professional accounting certifications, such as the CPA (Certified Public Accountant) exam, this course can serve as a supplementary resource to reinforce and deepen your understanding of financial accounting concepts.",
      "Anyone Interested in Understanding Business Finances: Financial literacy is crucial for personal and professional success. This course will demystify financial accounting, empowering individuals to make informed financial decisions in their personal and professional lives."
    ]
  }
]
