{
  "message": "Courses fetched, stored, and returned successfully",
  "coursesData": [
    {
      "badges": ["New"],
      "campaign_type": "instructor_coupon",
      "caption_languages": [],
      "content_info_short": "50 questions",
      "coupon_code": "7DC033AA72FF4F43F758",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 909,
      "created_date": "Tue, 01 Oct 2024 10:42:42 GMT",
      "description": "<p>The AWS Certified Database – Specialty (DBS-C01) certification is designed for individuals who specialize in database-focused roles and are looking to validate their expertise in AWS database services. The exam covers a wide range of database concepts, from database design, deployment, migration, and management, to optimization and troubleshooting within AWS.</p><p>Key Details:</p><ul><li><p>Exam Code: DBS-C01</p></li><li><p>Level: Specialty</p></li><li><p>Duration: 180 minutes</p></li><li><p>Format: Multiple choice and multiple response</p></li><li><p>Cost: USD $300</p></li></ul><p>Exam Domains:</p><ol><li><p>Workload-Specific Database Design (26%)</p><ul><li><p>Choose appropriate database services based on workload requirements.</p></li><li><p>Evaluate database architectures and configurations for efficiency and scalability.</p></li><li><p>Analyze data access patterns to determine optimal database solutions.</p></li></ul></li><li><p>Deployment and Migration (20%)</p><ul><li><p>Deploy database solutions in AWS.</p></li><li><p>Migrate databases to AWS using services like AWS DMS (Database Migration Service).</p></li><li><p>Handle cross-region and cross-account replication.</p></li></ul></li><li><p>Management and Operations (18%)</p><ul><li><p>Manage and monitor database clusters.</p></li><li><p>Perform maintenance, upgrades, and scaling of databases in AWS.</p></li><li><p>Implement security measures, including encryption, backups, and access controls.</p></li></ul></li><li><p>Monitoring and Troubleshooting (18%)</p><ul><li><p>Monitor database performance using AWS tools such as CloudWatch and Performance Insights.</p></li><li><p>Troubleshoot performance issues and optimize databases.</p></li><li><p>Diagnose and resolve database failures.</p></li></ul></li><li><p>Database Security (18%)</p><ul><li><p>Implement database security best practices.</p></li><li><p>Ensure compliance with data regulations and encryption requirements.</p></li><li><p>Use AWS Identity and Access Management (IAM) for database access.</p></li></ul></li></ol><p>Recommended AWS Services to Know:</p><ul><li><p>Amazon RDS (Relational Database Service)</p></li><li><p>Amazon Aurora</p></li><li><p>Amazon DynamoDB</p></li><li><p>Amazon Redshift</p></li><li><p>Amazon DocumentDB</p></li><li><p>Amazon Neptune</p></li><li><p>Amazon ElastiCache</p></li></ul><p>Recommended Knowledge and Experience:</p><ul><li><p>5+ years of experience with database technologies.</p></li><li><p>Experience with both on-premises and AWS-based databases.</p></li><li><p>Hands-on experience with AWS database services and a strong understanding of database security, replication, backup, and recovery.</p></li></ul><p>Preparation Resources:</p><ul><li><p>AWS Certified Database - Specialty Exam Guide: Official guide with domain breakdown.</p></li><li><p>AWS Skill Builder: Offers self-paced learning modules.</p></li><li><p>Whitepapers: AWS's whitepapers on database migration, performance optimization, and best practices.</p></li><li><p>AWS Practice Exams: Available on the AWS Certification website.</p></li></ul><p>This certification is ideal for database administrators, architects, or developers who work on AWS cloud platforms and want to deepen their database expertise in the cloud.</p>",
      "detected_language": "en",
      "has_certificate": false,
      "has_closed_caption": false,
      "headline": "\"Mastering Database Solutions on AWS: Design, Deployment, and Management\"",
      "id": 6213101,
      "id_name": "dbs-c01-aws-certified-database-specialty-practice-test",
      "image": "https://img-b.udemycdn.com/course/480x270/6213101_791c.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6213101_791c.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "MD ZAHEDUL ISLAM": "https://www.udemy.com/user/md-zahedul-islam-10/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": true,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:17 GMT",
      "last_updated": "Sun, 06 Oct 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 2,
      "num_lectures": 0,
      "num_practice_tests": 2,
      "num_quizzes": 2,
      "num_reviews": 1,
      "num_subscribers": 1446,
      "objectives": [
        "Database Design: Understanding different AWS database services (e.g., RDS, DynamoDB, Aurora) and selecting the right solution based on application needs.",
        "Deployment and Migration: Best practices for database migration, replication, and disaster recovery.",
        "Management and Operations: Monitoring, maintenance, and optimization of databases in AWS.",
        "Security: Implementing database security, access control, and encryption.",
        "Troubleshooting: Identifying and resolving common database issues."
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "IT Certifications",
      "quality_review_admin_rating": null,
      "quality_review_score": null,
      "quality_status": "approved",
      "rating": 5,
      "requirements_data": [
        "Foundational Knowledge of AWS",
        "Understanding of Database Design",
        "Basic Networking Concepts"
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "IT Professionals, Business Professionals, Students and Recent Graduates"
      ],
      "title": "DBS-C01: AWS Certified Database Specialty Practice Test 2024",
      "what_you_will_learn_data": [
        "Database Design: Understanding different AWS database services (e.g., RDS, DynamoDB, Aurora) and selecting the right solution based on application needs.",
        "Deployment and Migration: Best practices for database migration, replication, and disaster recovery.",
        "Management and Operations: Monitoring, maintenance, and optimization of databases in AWS.",
        "Security: Implementing database security, access control, and encryption.",
        "Troubleshooting: Identifying and resolving common database issues."
      ],
      "who_should_attend_data": [
        "IT Professionals, Business Professionals, Students and Recent Graduates"
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "1.5 hours",
      "coupon_code": "646B79EB6B957DBBBDCB",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 856,
      "created_date": "Tue, 20 Feb 2024 10:21:38 GMT",
      "description": "<p>Welcome to course: Executive Diploma of CIO Chief Information Officer by MTF Institute</p><p><br></p><p>Course provided by MTF Institute of Management, Technology and Finance</p><p>MTF is the global educational and research institute with HQ at Lisbon, Portugal, focused on business & professional hybrid (on-campus and online) education at areas: Business & Administration, Science & Technology, Banking & Finance. </p><p>MTF R&D center focused on research activities at areas: Artificial Intelligence, Machine Learning, Data Science, Big Data, WEB3, Blockchain, Cryptocurrency & Digital Assets, Metaverses, Digital Transformation, Fintech, Electronic Commerce, Internet of Things. </p><p>MTF is the official partner of: IBM, Intel, Microsoft, member of the Portuguese Chamber of Commerce and Industry.</p><p>MTF is present in 208 countries and has been chosen by more than 380,000 students.</p><p><br></p><p>The Chief Information Officer (CIO) plays a crucial role in modern organizations, especially in those heavily reliant on technology. The role and functionality of a CIO encompass a wide range of responsibilities aimed at leveraging technology to achieve business objectives. Here's an overview:</p><p><br></p><p>Strategic Planning: The CIO is responsible for aligning the organization's technological resources with its overall business strategy. This involves understanding the company's goals and objectives and developing a roadmap for how technology can support and enhance them.</p><p><br></p><p>Technology Infrastructure Management: The CIO oversees the management of the organization's IT infrastructure, including hardware, software, networks, and data centers. This includes ensuring the reliability, security, and scalability of the infrastructure to support the company's operations.</p><p><br></p><p>Information Security: Protecting the organization's data and information systems from cyber threats is a critical responsibility of the CIO. This involves implementing security measures, policies, and procedures to safeguard against breaches, hacking attempts, and other security risks.</p><p><br></p><p>Digital Transformation: The CIO plays a key role in driving digital transformation initiatives within the organization. This may involve implementing new technologies, such as cloud computing, artificial intelligence, and big data analytics, to streamline processes, improve efficiency, and enhance the customer experience.</p><p><br></p><p>Vendor Management: Many organizations rely on third-party vendors for various IT services and solutions. The CIO is responsible for selecting and managing these vendors, ensuring they deliver value and meet the organization's needs.</p><p><br></p><p>Budgeting and Cost Management: The CIO oversees the IT budget, allocating resources effectively to support the organization's strategic objectives while managing costs and maximizing ROI.</p><p><br></p><p>Team Leadership: The CIO leads the IT department, providing direction, guidance, and support to IT staff to ensure they have the necessary skills and resources to perform their roles effectively.</p><p><br></p><p>Stakeholder Communication: The CIO acts as a bridge between the IT department and other business units, communicating effectively with senior management and stakeholders to ensure alignment between IT initiatives and overall business goals.</p><p><br></p><p>In terms of key advice for building a career with an impact on business results, a CIO should focus on the following:</p><p><br></p><p>Business Acumen: Develop a deep understanding of the organization's business model, industry trends, and competitive landscape. This will enable you to align IT initiatives with business objectives and demonstrate the value of technology to the company's bottom line.</p><p><br></p><p>Relationship Building: Build strong relationships with senior management, department heads, and other stakeholders across the organization. Effective communication and collaboration are essential for gaining buy-in for IT projects and driving successful outcomes.</p><p><br></p><p>Innovation and Agility: Embrace innovation and adopt an agile mindset to respond quickly to changing business needs and technological advancements. Look for opportunities to leverage emerging technologies to drive innovation and create competitive advantages for the organization.</p><p><br></p><p>Risk Management: Prioritize cybersecurity and risk management efforts to protect the organization's assets and reputation. Stay abreast of evolving threats and implement proactive measures to mitigate risks effectively.</p><p><br></p><p>Continuous Learning: The field of technology is constantly evolving, so it's crucial to stay current with the latest trends, tools, and best practices. Invest in ongoing learning and professional development to keep your skills sharp and remain at the forefront of industry advancements.</p><p><br></p><p>By focusing on these areas, a CIO can build a successful career that not only advances their own professional goals but also makes a significant impact on the business results and overall success of the company.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Executive Diploma of CIO Chief Information Officer by MTF Institute",
      "id": 5831800,
      "id_name": "executive-diploma-of-cio-chief-information-officer",
      "image": "https://img-b.udemycdn.com/course/480x270/5831800_1240.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5831800_1240.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "MTF Institute of Management, Technology and Finance": "https://www.udemy.com/user/mtfinstitute/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:14 GMT",
      "last_updated": "Wed, 25 Sep 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 19,
      "num_lectures": 19,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 73,
      "num_subscribers": 8686,
      "objectives": [
        "Career of CIO",
        "Mission of CIO",
        "CIO as Partner and Co-Founder",
        "Know-How and IT Security Protection",
        "CIO vs CDO",
        "CIO as driver of digital transformation"
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "IT Certifications",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 3.7,
      "requirements_data": [
        "For a better learning experience, we suggest you to use a laptop / mobile phone / pen and paper for taking notes, highlighting important points, and making summaries to reinforce your learning."
      ],
      "sm_sending_time": {
        "telegram": {
          "@programming_courses": "Sun, 10 Nov 2024 02:56:16 GMT",
          "@udemy_dev": "Sun, 10 Nov 2024 04:55:07 GMT"
        }
      },
      "status_label": "Live",
      "target_audiences": [
        "No special requirements. Course for any who want to build a career as CIO/CTO or improve their knowledge.",
        "The Chief Information Officer (CIO) plays a crucial role in modern organizations, especially in those heavily reliant on technology. The role and functionality of a CIO encompass a wide range of responsibilities aimed at leveraging technology to achieve business objectives. Here's an overview:  Strategic Planning: The CIO is responsible for aligning the organization's technological resources with its overall business strategy. This involves understanding the company's goals and objectives and developing a roadmap for how technology can support and enhance them.  Technology Infrastructure Management: The CIO oversees the management of the organization's IT infrastructure, including hardware, software, networks, and data centers. This includes ensuring the reliability, security, and scalability of the infrastructure to support the company's operations.  Information Security: Protecting the organization's data and information systems from cyber threats is a critical responsibility of the CIO. This involves implementing security measures, policies, and procedures to safeguard against breaches, hacking attempts, and other security risks.  Digital Transformation: The CIO plays a key role in driving digital transformation initiatives within the organization. This may involve implementing new technologies, such as cloud computing, artificial intelligence, and big data analytics, to streamline processes, improve efficiency, and enhance the customer experience.  Vendor Management: Many organizations rely on third-party vendors for various IT services and solutions. The CIO is responsible for selecting and managing these vendors, ensuring they deliver value and meet the organization's needs.  Budgeting and Cost Management: The CIO oversees the IT budget, allocating resources effectively to support the organization's strategic objectives while managing costs and maximizing ROI.  Team Leadership: The CIO leads the IT department, providing direction, guidance, and support to IT staff to ensure they have the necessary skills and resources to perform their roles effectively.  Stakeholder Communication: The CIO acts as a bridge between the IT department and other business units, communicating effectively with senior management and stakeholders to ensure alignment between IT initiatives and overall business goals.",
        "In terms of key advice for building a career with an impact on business results, a CIO should focus on the following:  Business Acumen: Develop a deep understanding of the organization's business model, industry trends, and competitive landscape. This will enable you to align IT initiatives with business objectives and demonstrate the value of technology to the company's bottom line.  Relationship Building: Build strong relationships with senior management, department heads, and other stakeholders across the organization. Effective communication and collaboration are essential for gaining buy-in for IT projects and driving successful outcomes.  Innovation and Agility: Embrace innovation and adopt an agile mindset to respond quickly to changing business needs and technological advancements. Look for opportunities to leverage emerging technologies to drive innovation and create competitive advantages for the organization.  Risk Management: Prioritize cybersecurity and risk management efforts to protect the organization's assets and reputation. Stay abreast of evolving threats and implement proactive measures to mitigate risks effectively.  Continuous Learning: The field of technology is constantly evolving, so it's crucial to stay current with the latest trends, tools, and best practices. Invest in ongoing learning and professional development to keep your skills sharp and remain at the forefront of industry advancements.  By focusing on these areas, a CIO can build a successful career that not only advances their own professional goals but also makes a significant impact on the business results and overall success of the company."
      ],
      "title": "Executive Diploma of CIO Chief Information Officer",
      "what_you_will_learn_data": [
        "Career of CIO",
        "Mission of CIO",
        "CIO as Partner and Co-Founder",
        "Know-How and IT Security Protection",
        "CIO vs CDO",
        "CIO as driver of digital transformation"
      ],
      "who_should_attend_data": [
        "No special requirements. Course for any who want to build a career as CIO/CTO or improve their knowledge.",
        "The Chief Information Officer (CIO) plays a crucial role in modern organizations, especially in those heavily reliant on technology. The role and functionality of a CIO encompass a wide range of responsibilities aimed at leveraging technology to achieve business objectives. Here's an overview:  Strategic Planning: The CIO is responsible for aligning the organization's technological resources with its overall business strategy. This involves understanding the company's goals and objectives and developing a roadmap for how technology can support and enhance them.  Technology Infrastructure Management: The CIO oversees the management of the organization's IT infrastructure, including hardware, software, networks, and data centers. This includes ensuring the reliability, security, and scalability of the infrastructure to support the company's operations.  Information Security: Protecting the organization's data and information systems from cyber threats is a critical responsibility of the CIO. This involves implementing security measures, policies, and procedures to safeguard against breaches, hacking attempts, and other security risks.  Digital Transformation: The CIO plays a key role in driving digital transformation initiatives within the organization. This may involve implementing new technologies, such as cloud computing, artificial intelligence, and big data analytics, to streamline processes, improve efficiency, and enhance the customer experience.  Vendor Management: Many organizations rely on third-party vendors for various IT services and solutions. The CIO is responsible for selecting and managing these vendors, ensuring they deliver value and meet the organization's needs.  Budgeting and Cost Management: The CIO oversees the IT budget, allocating resources effectively to support the organization's strategic objectives while managing costs and maximizing ROI.  Team Leadership: The CIO leads the IT department, providing direction, guidance, and support to IT staff to ensure they have the necessary skills and resources to perform their roles effectively.  Stakeholder Communication: The CIO acts as a bridge between the IT department and other business units, communicating effectively with senior management and stakeholders to ensure alignment between IT initiatives and overall business goals.",
        "In terms of key advice for building a career with an impact on business results, a CIO should focus on the following:  Business Acumen: Develop a deep understanding of the organization's business model, industry trends, and competitive landscape. This will enable you to align IT initiatives with business objectives and demonstrate the value of technology to the company's bottom line.  Relationship Building: Build strong relationships with senior management, department heads, and other stakeholders across the organization. Effective communication and collaboration are essential for gaining buy-in for IT projects and driving successful outcomes.  Innovation and Agility: Embrace innovation and adopt an agile mindset to respond quickly to changing business needs and technological advancements. Look for opportunities to leverage emerging technologies to drive innovation and create competitive advantages for the organization.  Risk Management: Prioritize cybersecurity and risk management efforts to protect the organization's assets and reputation. Stay abreast of evolving threats and implement proactive measures to mitigate risks effectively.  Continuous Learning: The field of technology is constantly evolving, so it's crucial to stay current with the latest trends, tools, and best practices. Invest in ongoing learning and professional development to keep your skills sharp and remain at the forefront of industry advancements.  By focusing on these areas, a CIO can build a successful career that not only advances their own professional goals but also makes a significant impact on the business results and overall success of the company."
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "3 hours",
      "coupon_code": "BREEZYBARGAIN9",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 622,
      "created_date": "Wed, 20 Dec 2023 22:41:05 GMT",
      "description": "<p>Dive into the dynamic world of web development with our comprehensive course, 'PHP Essentials: Web Development & MySQL Mastery'. This meticulously designed program caters to both beginners and intermediate learners, offering a deep dive into the fundamental principles of PHP, one of the most popular server-side scripting languages.</p><p>The journey begins with an introduction to PHP, paving the way for essential tools such as the installation of XAMPP SERVER and an exploration of PHP syntax. Our step-by-step approach ensures a solid foundation, paving the way for more advanced concepts.</p><p>Dive into the heart of PHP by tackling crucial topics such as data types, variables, and operators. Understand the importance of constant variables, arithmetic, assignment, and logical operators in PHP programming. This section is essential for mastering the syntax and logic of the language.</p><p>The course then transitions into the 'Basics of PHP', where learners engage with conditional statements (If, Else If), loops (While, Do While, For), and the construction of functions. These elements are vital in building dynamic and responsive web applications. Additionally, the module on 'Types of Strings' offers insights into efficient data handling and manipulation.</p><p>A significant portion of the course is dedicated to 'Array Methods'. Here, you'll learn about array manipulation techniques including count, sizeoff, searching, replacing, slicing, splicing, and more. These skills are indispensable for data management in PHP.</p><p>'POST and GET' methods form the backbone of data submission and retrieval in web forms. Our focused sessions on form validation using GET, POST methods, and handling input types like radio buttons, equip you with the skills to manage user inputs securely and effectively.</p><p>MySQL integration is another cornerstone of this course. You'll gain expertise in MySQL database management, table structure, configuration, and executing basic to advanced database operations.</p><p>The course culminates in a project-based module, 'Queries and Project', where you'll apply your skills in real-world scenarios. This includes database updates, form UI design, database connections, and user data management.</p><p>Concluding with a review and forward-looking insights, this course empowers you with the knowledge and skills to excel in PHP and MySQL, opening doors to numerous opportunities in web development. Enroll now to start your journey towards becoming a proficient PHP developer with a solid understanding of MySQL database management.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Learn PHP Syntax, MySQL, Array Handling, and Form Processing",
      "id": 5721676,
      "id_name": "php-essentials-deep-dive-into-the-principles-of-php",
      "image": "https://img-b.udemycdn.com/course/480x270/5721676_d36f_3.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5721676_d36f_3.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        { "Meta Brains": "https://www.udemy.com/user/metabrains/" }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:24 GMT",
      "last_updated": "Mon, 05 Feb 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 38,
      "num_lectures": 38,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 76,
      "num_subscribers": 22069,
      "objectives": [
        "Master PHP syntax, control structures, and scripting",
        "Learn advanced array and string operations in PHP.",
        "Acquire skills in web form handling and data validation.",
        "Gain expertise in MySQL database integration and management."
      ],
      "primary_category": "Development",
      "primary_subcategory": "Web Development",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.1,
      "requirements_data": [
        "Basic computer skills, internet access, eagerness to learn web development. No prior programming experience required."
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "No prior coding experience needed; access to a computer with internet and willingness to learn PHP and MySQL essentials."
      ],
      "title": "PHP Essentials: Deep dive into the Principles of PHP",
      "what_you_will_learn_data": [
        "Master PHP syntax, control structures, and scripting",
        "Learn advanced array and string operations in PHP.",
        "Acquire skills in web form handling and data validation.",
        "Gain expertise in MySQL database integration and management."
      ],
      "who_should_attend_data": [
        "No prior coding experience needed; access to a computer with internet and willingness to learn PHP and MySQL essentials."
      ]
    },
    {
      "badges": ["New"],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "2 hours",
      "coupon_code": "390F89BB4D6B14732DC5",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 435,
      "created_date": "Fri, 02 Feb 2024 21:14:54 GMT",
      "description": "<p>Every landscape in crypto is rapidly changing, so we’re back with a full guide on airdrop farming for 2024 and 2025.</p><p>Airdrop season has started and everybody loves free crypto. If you dedicate time and effort towards farming, you can have a 6-figure year. No matter what capital you start with. If you are new to the wonderful world of airdrops, I suggest you glance at the biggest airdrops of 2023 (check google), to get the blood flowing and get you excited to study this course.</p><p><br></p><p>This comprehensive course provides you with everything you need to know to capitalize on the latest airdrop opportunities in 2024 and 2025. Whether you're a crypto novice or a seasoned trader, you’ll learn the art of airdrop farming — where with dedication, time, and the right strategies, you can potentially earn six figures in free crypto, regardless of your starting capital.</p><p>We’ll break down the fundamentals of airdrops, explore the biggest airdrops of the past, and guide you through hunting strategies that maximize your chances of qualifying for valuable token distributions. From interaction-based airdrops to staking and liquidity farming, you’ll discover the key steps that can turn your wallet into a goldmine of tokens.</p><p>By the end of this course, you’ll have the knowledge and tools to navigate this exciting space and make the most out of the upcoming airdrop seasons.</p><p><br></p><p>Key Learning Outcomes:</p><ul><li><p>Understand the fundamentals of airdrops and their role in crypto projects.</p></li><li><p>Master airdrop farming strategies to maximize token rewards.</p></li><li><p>Learn how to spot promising airdrop opportunities early.</p></li><li><p>Gain insight into the biggest airdrops of 2023 to boost your motivation.</p></li><li><p>Develop the skills to participate in interaction-based, liquidity-based, and loyalty-based airdrops.</p></li><li><p>Implement safety measures to avoid risks while hunting airdrops.</p></li></ul><p>Get ready to embark on a journey to free crypto, and turn your time and effort into serious rewards!</p><p><br></p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "How To Farm Crypto Airdrop and Learn how to participate and benefit from these exciting opportunities.",
      "id": 5800826,
      "id_name": "crypto-airdrop-farming-guide-strategy-for-beginners",
      "image": "https://img-b.udemycdn.com/course/480x270/5800826_5532.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5800826_5532.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        { "Lawal Lekan": "https://www.udemy.com/user/lawal-lekan-ridwon/" }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:17 GMT",
      "last_updated": "Tue, 24 Sep 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 29,
      "num_lectures": 29,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 34,
      "num_subscribers": 2722,
      "objectives": [
        "Understand the concept of crypto airdrops",
        "Identify different types of airdrops",
        "Explore the strategies behind airdrop farming and hunting",
        "Recognize the factors that influence airdrop eligibility",
        "Evaluate the importance of decentralization and ownership in airdrop distribution",
        "Implement safety measures during airdrop hunting:",
        "Understand the role of token valuation in airdrops",
        "Gain knowledge about promotional and marketing strategies in crypto",
        "Evaluate the impact of decentralized governance through airdrops"
      ],
      "primary_category": "Finance & Accounting",
      "primary_subcategory": "Cryptocurrency & Blockchain",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.8,
      "requirements_data": ["Internet Connection", "Your Pc and Smart Phone"],
      "sm_sending_time": {
        "telegram": { "@udemy_business": "Fri, 08 Nov 2024 16:39:43 GMT" }
      },
      "status_label": "Live",
      "target_audiences": [
        "Individuals who are interested in learning about airdrops and want to understand how they work.",
        "People actively looking to maximize their rewards from airdrops.",
        "Those participating in decentralized finance platforms, wallets, and exchanges looking to benefit from free token distributions.",
        "Developers curious about how airdrops can be integrated into crypto projects as a growth strategy."
      ],
      "title": "Crypto Airdrop Farming Guide & Strategy For Beginners",
      "what_you_will_learn_data": [
        "Understand the concept of crypto airdrops",
        "Identify different types of airdrops",
        "Explore the strategies behind airdrop farming and hunting",
        "Recognize the factors that influence airdrop eligibility",
        "Evaluate the importance of decentralization and ownership in airdrop distribution",
        "Implement safety measures during airdrop hunting:",
        "Understand the role of token valuation in airdrops",
        "Gain knowledge about promotional and marketing strategies in crypto",
        "Evaluate the impact of decentralized governance through airdrops"
      ],
      "who_should_attend_data": [
        "Individuals who are interested in learning about airdrops and want to understand how they work.",
        "People actively looking to maximize their rewards from airdrops.",
        "Those participating in decentralized finance platforms, wallets, and exchanges looking to benefit from free token distributions.",
        "Developers curious about how airdrops can be integrated into crypto projects as a growth strategy."
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "1 hour",
      "coupon_code": "46B258245E84B30EF566",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 12,
      "created_date": "Sat, 11 Feb 2023 14:58:19 GMT",
      "description": "<ol><li><p>What is the meaning of Job Application?</p></li><li><p>What is the role of job application?</p></li><li><p>What is the need for writing a well-written job application?</p></li><li><p>Whether job application should be handwritten or typed one?</p></li><li><p>What are those special points which job seekers should have in mind?</p></li><li><p>What is the difference between Job Application and Informal letter?</p></li><li><p>What should be the tone of the job application?</p></li><li><p>Why job application should be brief and to the point?</p></li><li><p>Whether we can use slang language in case of job application?</p></li><li><p>If we are sending job application by post, is it necessary to sign the job application?</p></li><li><p>Do we use contractions in job applications?</p></li><li><p>It is said that we should take a print of job application to check the errors? Why it is so?</p></li><li><p>What are the important tips for writing job application?</p></li><li><p>A job application consists of two parts. What are those parts?</p></li><li><p>The format of covering letter is similar to that of formal letter or informal letter. Please clarify.</p></li><li><p>What is the proper format of covering letter?</p></li><li><p>How much paragraphs are usually there in the body of the covering letter? In how many words should we write the body of the covering letter?</p></li><li><p>Is it necessary to write subject in case of job application? If yes, in how many words?</p></li><li><p>Why there is salutation in covering letter?</p></li><li><p>Can you name the documents or papers we normally attach with the covering letter?</p></li><li><p>Where should we write the name and address of the person writing the job application?</p></li><li><p>Where are the details of enclosures mentioned in the letter?</p></li><li><p>Which salutation is generally used in job application?</p></li><li><p>With which ink we can sign the job application?</p></li><li><p>Whether we should use contractions in job applications?</p></li><li><p>Whether subject is written in the case of job applications or not?</p></li><li><p>What should be the tone in the case of job application?</p></li><li><p>Can we write the job application in a single paragraph?</p></li><li><p>Where is the date mentioned in the covering letter?</p></li><li><p>The personal details of the job seeker are written in cover letter or resume. Please clarify.</p></li><li><p>What is written in the opening paragraph of the covering letter?</p></li></ol>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Crafting Persuasive Cover  Letters that Make Employers  Say 'Yes",
      "id": 5152050,
      "id_name": "job-application-format-the-definitive-guide",
      "image": "https://img-b.udemycdn.com/course/480x270/5152050_e638.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5152050_e638.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Prabh Kirpa Classes": "https://www.udemy.com/user/prabh-kirpa-classes/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["Resume and CV Writing"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:21 GMT",
      "last_updated": "Sun, 22 Oct 2023 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 5,
      "num_lectures": 5,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 53,
      "num_subscribers": 15385,
      "objectives": [
        "Why do we write job application?",
        "What is the importance of well-written job application?",
        "What are the important tips for writing job application?",
        "What is the format for writing job application (covering letter)?"
      ],
      "primary_category": "Personal Development",
      "primary_subcategory": "Career Development",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4,
      "requirements_data": [
        "No skills, experience or equipment required on the part of learners prior to taking this course. Only a few minutes of proper attention will help in understanding the important tips and proper format for writing Job application (covering letter)."
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Students who want to learn the Job Application format."
      ],
      "title": "Crafting a Winning Job  Application: The Essentials",
      "what_you_will_learn_data": [
        "Why do we write job application?",
        "What is the importance of well-written job application?",
        "What are the important tips for writing job application?",
        "What is the format for writing job application (covering letter)?"
      ],
      "who_should_attend_data": [
        "Students who want to learn the Job Application format."
      ]
    },
    {
      "badges": ["New"],
      "campaign_type": "instructor_coupon",
      "caption_languages": [],
      "content_info_short": "50 questions",
      "coupon_code": "B289DD8858D40EEBA4E2",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 870,
      "created_date": "Sat, 31 Aug 2024 05:52:11 GMT",
      "description": "<p>Welcome to the Cisco CCNA Routing and Switching (200-101) course! This comprehensive program is designed to provide you with a solid foundation in networking concepts and practical skills needed to excel in the field of network administration and management. Whether you are new to networking or looking to deepen your existing knowledge, this course will equip you with the essential tools and expertise to succeed.</p><p>Course Overview:</p><p>The 200-101 CCNA Routing and Switching course covers fundamental networking concepts and practical skills related to routing and switching technologies. It is tailored to help you build a thorough understanding of network principles, device configurations, and troubleshooting techniques. By the end of this course, you will be well-prepared to take the Cisco CCNA Routing and Switching certification exam and apply your knowledge in real-world networking environments.</p><p>Key Learning Objectives:</p><ol><li><p>Network Fundamentals:</p><ul><li><p>Networking Models: Understand the OSI and TCP/IP models, including their layers and how they interact to facilitate network communication.</p></li><li><p>Networking Devices: Learn about different network devices such as routers, switches, and firewalls, and their roles in a network.</p></li><li><p>Network Media: Explore various types of network media (e.g., Ethernet cables, fiber optics) and their functions in data transmission.</p></li></ul></li><li><p>IP Addressing:</p><ul><li><p>IPv4 and IPv6: Gain proficiency in IP addressing, including IPv4 and IPv6 address formats, subnetting, and address allocation.</p></li><li><p>Subnetting: Learn how to calculate and apply subnets to efficiently manage IP address space.</p></li></ul></li><li><p>Routing and Switching:</p><ul><li><p>Routing Protocols: Understand the basics of routing protocols like RIP, EIGRP, and OSPF, and how they are used to direct network traffic.</p></li><li><p>Switching Concepts: Learn about VLANs, STP (Spanning Tree Protocol), and basic switch configurations to manage network traffic and enhance network performance.</p></li></ul></li><li><p>IP Services:</p><ul><li><p>Network Address Translation (NAT): Understand NAT concepts and how they are used to map private IP addresses to public addresses for internet access.</p></li><li><p>Dynamic Host Configuration Protocol (DHCP): Explore DHCP configuration and management to automate IP address assignment in a network.</p></li><li><p>Quality of Service (QoS): Learn about QoS principles and how they are applied to manage network traffic and prioritize data flow.</p></li></ul></li><li><p>Security Fundamentals:</p><ul><li><p>Network Security: Gain insights into basic security practices, including access control lists (ACLs) and device hardening techniques to protect network infrastructure.</p></li><li><p>Security Measures: Understand common security threats and how to implement measures to safeguard against them.</p></li></ul></li><li><p>Troubleshooting:</p><ul><li><p>Troubleshooting Methodologies: Learn systematic approaches to diagnose and resolve network issues effectively.</p></li><li><p>Tools and Techniques: Gain hands-on experience with troubleshooting tools and techniques to address connectivity problems and device malfunctions.</p></li></ul></li></ol><p>Course Structure:</p><ol><li><p>Instructor-Led Sessions: Participate in engaging lectures and discussions with experienced instructors who will guide you through key networking concepts and practical applications.</p></li><li><p>Hands-On Labs: Engage in interactive lab exercises that provide practical experience with network configurations, device management, and troubleshooting.</p></li><li><p>Self-Paced Learning: Access online resources, tutorials, and study materials to reinforce your understanding of the course content at your own pace.</p></li><li><p>Practice Exams: Take practice tests to assess your knowledge and prepare effectively for the CCNA Routing and Switching certification exam.</p></li></ol><p>Who Should Enroll:</p><ul><li><p>Network Engineers: Professionals seeking to build a strong foundation in routing and switching technologies and enhance their networking skills.</p></li><li><p>IT Professionals: Systems administrators, support specialists, and other IT professionals looking to improve their understanding of network fundamentals and configurations.</p></li><li><p>Career Changers: Individuals transitioning into the networking field who need a comprehensive introduction to networking concepts and practical skills.</p></li><li><p>Students and Graduates: Recent graduates or students aiming to start a career in networking and seeking to gain a recognized certification.</p></li><li><p>Certification Seekers: Candidates preparing for the CCNA Routing and Switching exam who need a structured course to guide their study and preparation.</p></li></ul><p>Conclusion:</p><p>The Cisco CCNA Routing and Switching (200-101) course offers a thorough exploration of networking fundamentals, routing and switching technologies, and practical skills essential for network management. By completing this course, you will be well-prepared to achieve Cisco CCNA certification and advance your career in networking.</p><p>Enroll today to start your journey toward mastering network fundamentals and device configuration. If you have any questions or need additional information, feel free to reach out. We’re here to support you throughout your learning experience.</p>",
      "detected_language": "en",
      "has_certificate": false,
      "has_closed_caption": false,
      "headline": "Cisco CCNA Routing and Switching - Mastering Network Fundamentals and Device Configuration",
      "id": 6157859,
      "id_name": "200-101-cisco-ccna-routing-and-switching-practice-test-2024",
      "image": "https://img-b.udemycdn.com/course/480x270/6157859_a84b_2.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6157859_a84b_2.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "MD ZAHEDUL ISLAM": "https://www.udemy.com/user/md-zahedul-islam-10/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": true,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:12 GMT",
      "last_updated": "Thu, 05 Sep 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 2,
      "num_lectures": 0,
      "num_practice_tests": 2,
      "num_quizzes": 2,
      "num_reviews": 10,
      "num_subscribers": 3196,
      "objectives": [
        "Network Fundamentals",
        "IP Connectivity",
        "IP Services",
        "Security Fundamentals"
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "IT Certifications",
      "quality_review_admin_rating": null,
      "quality_review_score": null,
      "quality_status": "approved",
      "rating": 4.2,
      "requirements_data": [
        "Basic Networking Knowledge",
        "Experience with Networking Devices",
        "Introductory Knowledge of Routing and Switching"
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Network Engineers, IT Professionals, General IT Enthusiasts"
      ],
      "title": "200-101: Cisco CCNA Routing and Switching Practice test 2024",
      "what_you_will_learn_data": [
        "Network Fundamentals",
        "IP Connectivity",
        "IP Services",
        "Security Fundamentals"
      ],
      "who_should_attend_data": [
        "Network Engineers, IT Professionals, General IT Enthusiasts"
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "10 hours",
      "coupon_code": "CA0DC9519FCA726EF818",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 911,
      "created_date": "Sat, 15 Jun 2024 05:10:08 GMT",
      "description": "<p>In this advanced course, participants will explore the transformative power of artificial intelligence in the realm of digital media production, particularly in animation and visual storytelling. The advent of AI technology has dramatically streamlined the traditional, labor-intensive process of animation, enabling creators to generate complex images and scenes swiftly and with greater ease. This course not only covers the technical aspects of AI-generated imagery but also emphasizes its application in revitalizing the art of animation, which had been overshadowed by video content in recent years.</p><p>Throughout the course, students will engage in a series of comprehensive lectures and hands-on workshops designed to equip them with the skills to utilize AI in crafting compelling visual narratives. They will learn to master AI tools for image and animation creation, adapting these technologies to fit their creative visions and project demands. The curriculum extends beyond mere tool usage, delving into the strategic acquisition and utilization of digital assets such as memes and movie clips. These elements, often relegated to niche audiences, are shown to be potent tools for storytelling across various media platforms.</p><p>This course is ideal for content creators, marketers, scriptwriters, and anyone interested in the cutting-edge intersection of technology and creativity, offering them the tools to stand out in the rapidly evolving digital landscape.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Unleashing Creativity with AI: Transforming Digital Content Through Advanced Imaging and Animation Techniques",
      "id": 6025224,
      "id_name": "creating-ai-images-movie-meme-clips-for-joke-script",
      "image": "https://img-c.udemycdn.com/course/480x270/6025224_5614.jpg",
      "image_hq": "https://img-c.udemycdn.com/course/750x422/6025224_5614.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Robert (Bob) Steele": "https://www.udemy.com/user/c91d6786-95f3-48d8-ab94-cc92431d2aa4/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:11 GMT",
      "last_updated": "Sun, 10 Nov 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 46,
      "num_lectures": 46,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 32,
      "num_subscribers": 9793,
      "objectives": [
        "Analyze AI Tools: Evaluate AI technologies for efficient visual content creation.",
        "Synthesize Creative Elements: Integrate AI-generated visuals to enhance digital narratives.",
        "Apply Resource Utilization: Employ diverse online visual resources effectively.",
        "Create Practical Projects: Construct real-world projects using AI technology.",
        "Predict Future Trends: Forecast developments in AI applications within media."
      ],
      "primary_category": "Business",
      "primary_subcategory": "Entrepreneurship",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 3.9,
      "requirements_data": [
        "Basic Computer Skills: Familiarity with operating computers and navigating the internet.",
        "Understanding of Digital Media: A general understanding of digital content creation, including basics of storytelling or media production.",
        "Interest in AI Technology: While advanced knowledge isn't necessary, an interest in learning about artificial intelligence and its applications in media will enhance the learning experience.",
        "Creative Mindset: An inclination towards creativity and innovation will help participants make the most of the course's practical projects."
      ],
      "sm_sending_time": {
        "telegram": { "@udemy_business": "Sun, 10 Nov 2024 13:44:41 GMT" }
      },
      "status_label": "Live",
      "target_audiences": [
        "Digital Content Creators: Bloggers, YouTubers, and social media influencers looking to enhance their content with AI-generated visuals.",
        "Scriptwriters and Comedians: Individuals interested in adding visual elements to their scripts or enhancing their comedic content with timely and relevant visuals.",
        "Marketing Professionals: Marketers who want to create compelling, eye-catching content quickly using AI.",
        "Educators and Trainers: Those looking to integrate more digital media into their teaching or training materials.",
        "Technology Enthusiasts: Anyone with a keen interest in the latest technological advancements and their practical applications in creative fields."
      ],
      "title": "Joke Writing Using AI for Social Media",
      "what_you_will_learn_data": [
        "Analyze AI Tools: Evaluate AI technologies for efficient visual content creation.",
        "Synthesize Creative Elements: Integrate AI-generated visuals to enhance digital narratives.",
        "Apply Resource Utilization: Employ diverse online visual resources effectively.",
        "Create Practical Projects: Construct real-world projects using AI technology.",
        "Predict Future Trends: Forecast developments in AI applications within media."
      ],
      "who_should_attend_data": [
        "Digital Content Creators: Bloggers, YouTubers, and social media influencers looking to enhance their content with AI-generated visuals.",
        "Scriptwriters and Comedians: Individuals interested in adding visual elements to their scripts or enhancing their comedic content with timely and relevant visuals.",
        "Marketing Professionals: Marketers who want to create compelling, eye-catching content quickly using AI.",
        "Educators and Trainers: Those looking to integrate more digital media into their teaching or training materials.",
        "Technology Enthusiasts: Anyone with a keen interest in the latest technological advancements and their practical applications in creative fields."
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "1 hour",
      "coupon_code": "CD2F4C0B00D395380D40",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 15,
      "created_date": "Thu, 11 Nov 2021 16:14:39 GMT",
      "description": "<p>In this course, we will learn the following :</p><p>1. What is the meaning of Direct Speech and Indirect Speech?</p><p>2. How to change the reporting verb?</p><p>3. How to change the tenses of direct speech in to indirect?</p><p>4. What are modal verbs? How to change the modals of direct speech?</p><p>5. If reported speech is universal truth, general truth or historical event whether the tense of reported speech changes?</p><p>6. How to change pronouns?</p><p>7. What to do with punctuations in case of direct-indirect speech?</p><p>8. How to convert interrogative sentences , exclamatory sentences, imperative sentences and optative sentences from direct to indirect speech?</p><p>9. What change takes places in place and time while conversion from direct to indirect speech?</p><p>10. At the last, there will be some revision.</p><p>Direct Speech means Reporting/conveying the message of the speaker in the exact words as spoken by him. In direct speech, we always use comma (,) and inverted commas (“ ”). This is done to show that we are repeating exactly the same words without any change.</p><p>Indirect speech means Reporting or conveying the message of the speaker in our own words.</p><p>No comma or inverted commas are used in indirect speech.</p><p>e.g. He said that he was playing.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "The Art of Direct and Indirect  Speech Demystified",
      "id": 4393084,
      "id_name": "direct-indirect-speech",
      "image": "https://img-b.udemycdn.com/course/480x270/4393084_146c.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/4393084_146c.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Prabh Kirpa Classes": "https://www.udemy.com/user/prabh-kirpa-classes/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": true,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["English Conversation", "English Grammar"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:10 GMT",
      "last_updated": "Mon, 23 Oct 2023 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 5,
      "num_lectures": 5,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 31,
      "num_subscribers": 10933,
      "objectives": [
        "What is the meaning of direct speech and Indirect speech?",
        "How to convert direct speech into indirect speech?",
        "What are modal verbs?",
        "How to convert interrogative, exclamatory, imperative and optative sentences?"
      ],
      "primary_category": "Teaching & Academics",
      "primary_subcategory": "Language Learning",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.3,
      "requirements_data": ["Nil"],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Students who are interested to learn Direct Indirect Speech"
      ],
      "title": "The Art of Direct and Indirect  Speech Demystified",
      "what_you_will_learn_data": [
        "What is the meaning of direct speech and Indirect speech?",
        "How to convert direct speech into indirect speech?",
        "What are modal verbs?",
        "How to convert interrogative, exclamatory, imperative and optative sentences?"
      ],
      "who_should_attend_data": [
        "Students who are interested to learn Direct Indirect Speech"
      ]
    },
    {
      "badges": ["New"],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["German [Auto]"],
      "content_info_short": "1.5 hours",
      "coupon_code": "67BFCA5954B3BF288BA9",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 630,
      "created_date": "Sun, 27 Oct 2024 02:06:13 GMT",
      "description": "<p>Willkommen zu unserem umfassenden Kurs „Wie Sie mit ChatGPT erfolgreich online Geld verdienen“! In dieser dynamischen und praxisorientierten Schulung lernen Sie, wie Sie die leistungsstarke KI-Technologie von ChatGPT nutzen können, um Ihre Online-Präsenz zu optimieren und ein lukratives Einkommen zu erzielen.</p><p><br></p><p>Haben Sie sich jemals gefragt, wie Sie Ihre Leidenschaft in ein profitables Online-Geschäft verwandeln können? Oder möchten Sie Ihre Inhalte effizienter erstellen und vermarkten? Dieser Kurs ist genau das, was Sie brauchen! Wir führen Sie Schritt für Schritt durch den Prozess der Nutzung von ChatGPT zur Content-Erstellung, Kundenbindung und Monetarisierung.</p><p><br></p><p>Was erwartet Sie in diesem Kurs?</p><p><br></p><ul><li><p>Fundiertes Wissen: Erlernen Sie die Grundlagen von ChatGPT und wie es funktioniert, sowie verschiedene Anwendungsfälle für Ihr Online-Geschäft. Wir erklären Ihnen die zugrunde liegende Technologie und deren Funktionsweise, damit Sie das volle Potenzial dieser innovativen KI ausschöpfen können.</p></li><li><p>Strategien zur Content-Erstellung: Entdecken Sie bewährte Techniken zur Erstellung ansprechender Blogartikel, Social-Media-Beiträge und E-Mail-Kampagnen, die Ihre Zielgruppe fesseln. Wir zeigen Ihnen, wie Sie ansprechende Texte generieren, die sowohl informativ als auch unterhaltsam sind. Sie lernen, wie Sie mit Hilfe von ChatGPT Ihre Schreibprozesse beschleunigen und die Kreativität ankurbeln können.</p></li><li><p>Suchmaschinenoptimierung (SEO): Lernen Sie die besten Praktiken zur Optimierung Ihrer Inhalte für Suchmaschinen kennen. Wir zeigen Ihnen, wie Sie relevante Keywords identifizieren und diese strategisch in Ihre Texte einbinden, um die Sichtbarkeit Ihrer Inhalte zu erhöhen und mehr Traffic auf Ihre Website zu bringen.</p></li><li><p>Monetarisierungsmethoden: Erfahren Sie, wie Sie mit Affiliate-Marketing, digitalen Produkten und E-Mail-Marketing erfolgreich Geld verdienen können. Wir werden verschiedene Monetarisierungsstrategien detailliert behandeln, damit Sie die Methode finden, die am besten zu Ihnen passt. Sie lernen auch, wie Sie mit ChatGPT Ihre Marketingtexte optimieren, um bessere Conversion-Raten zu erzielen.</p></li><li><p>Praktische Tipps und Tricks: Profitieren Sie von praktischen Ratschlägen und Strategien, die Ihnen helfen, Ihre Online-Präsenz zu erweitern und Ihre Ziele zu erreichen. Wir teilen bewährte Methoden, die Ihnen helfen, effizienter zu arbeiten und gleichzeitig qualitativ hochwertige Ergebnisse zu erzielen.</p></li></ul><p><br></p><p>Egal, ob Sie ein Anfänger im Online-Marketing sind, ein Selbstständiger oder ein Content-Ersteller, dieser Kurs bietet Ihnen die Werkzeuge und das Wissen, um im digitalen Raum erfolgreich zu sein. Melden Sie sich noch heute an und starten Sie Ihre Reise in die Welt des Online-Geldverdienens mit ChatGPT!</p><p><br></p><p>Lassen Sie uns gemeinsam an Ihrer Zukunft arbeiten und entdecken Sie, wie Sie mit ChatGPT Ihre finanziellen Ziele erreichen können. Dieser Kurs ist Ihre Eintrittskarte in die aufregende Welt des Online-Geschäfts – verpassen Sie nicht die Gelegenheit, Ihre Träume in die Realität umzusetzen!</p>",
      "detected_language": "de",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Wie Sie mit ChatGPT erfolgreich online Geld verdienen: Strategien zur Content-Erstellung und Monetarisierung",
      "id": 6256829,
      "id_name": "chatgpt-leitfaden-so-verdienen-sie-online-geld-mit-chatgpt-tareq-hajj",
      "image": "https://img-b.udemycdn.com/course/480x270/6256829_4d15.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6256829_4d15.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        { "Tareq Hajj": "https://www.udemy.com/user/tareq-hajj-12/" }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "German",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:12 GMT",
      "last_updated": "Sat, 26 Oct 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 24,
      "num_lectures": 24,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 0,
      "num_subscribers": 405,
      "objectives": [
        "Verständnis der ChatGPT-Technologie",
        "Entwicklung effektiver Marketingstrategien",
        "Erstellung qualitativ hochwertiger Inhalte",
        "Monetarisierung von Online-Angeboten"
      ],
      "primary_category": "Business",
      "primary_subcategory": "Entrepreneurship",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 0,
      "requirements_data": [
        "Keine Erfahrung erforderlich. In diesem Kurs lernen Sie alles, was Sie über das Online-Geldverdienen mit ChatGPT wissen müssen"
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Anfänger im Online-Marketing: Diese Gruppe umfasst Personen, die neu im Bereich Online-Marketing sind und grundlegende Kenntnisse über die Nutzung von ChatGPT zur Generierung von Einkommen und zur Erstellung von Inhalten erwerben möchten.",
        "Selbstständige und Unternehmer: Diese Teilnehmer sind Selbstständige oder Unternehmer, die ihre Geschäftsmodelle erweitern und innovative Methoden zur Monetarisierung ihrer Dienstleistungen und Produkte erkunden möchten.",
        "Content-Ersteller und Blogger: Diese Gruppe besteht aus Content-Erstellern, Bloggern und Influencern, die ihre Fähigkeiten zur Erstellung qualitativ hochwertiger Inhalte verbessern und lernen möchten, wie sie diese Inhalte effektiv monetarisieren können."
      ],
      "title": "ChatGPT-Leitfaden: So verdienen Sie online Geld mit ChatGPT",
      "what_you_will_learn_data": [
        "Verständnis der ChatGPT-Technologie",
        "Entwicklung effektiver Marketingstrategien",
        "Erstellung qualitativ hochwertiger Inhalte",
        "Monetarisierung von Online-Angeboten"
      ],
      "who_should_attend_data": [
        "Anfänger im Online-Marketing: Diese Gruppe umfasst Personen, die neu im Bereich Online-Marketing sind und grundlegende Kenntnisse über die Nutzung von ChatGPT zur Generierung von Einkommen und zur Erstellung von Inhalten erwerben möchten.",
        "Selbstständige und Unternehmer: Diese Teilnehmer sind Selbstständige oder Unternehmer, die ihre Geschäftsmodelle erweitern und innovative Methoden zur Monetarisierung ihrer Dienstleistungen und Produkte erkunden möchten.",
        "Content-Ersteller und Blogger: Diese Gruppe besteht aus Content-Erstellern, Bloggern und Influencern, die ihre Fähigkeiten zur Erstellung qualitativ hochwertiger Inhalte verbessern und lernen möchten, wie sie diese Inhalte effektiv monetarisieren können."
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "5 hours",
      "coupon_code": "F3FFA29C7AD79AB39751",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 68,
      "created_date": "Fri, 12 Nov 2021 06:24:14 GMT",
      "description": "<p>What is the meaning of Tenses?</p><p>What are the various types of Tenses?</p><p>What is present tense and its types i.e. Present Simple, Present Continuous, Present Perfect and Present Perfect Continuous. When to use present tense. How to make positive, negative and interrogative sentences using present tense.</p><p>What are the common mistakes made in using the present tense?</p><p>Explain in detail past tense and its various types?</p><p>Future Tense and its types</p><p>-What is past tense?</p><p>-What are the various types of past tense?</p><p>-When to use it?</p><p>-How we form it from regular verbs?</p><p>-What are irregular verbs?</p><p>-How to make positive, negative and interrogative sentences using past tense?</p><p>- What are the common mistakes made in using this tense? etc.</p><p>We will also discuss in detail all the four different types of Future tense:</p><p>i) Future Simple Tense</p><p>ii) Future Continuous Tense</p><p>iii) Future Perfect Tense</p><p>iv) Future Perfect Continuous Tense</p><p>What are the two types of verbs ( i.e. discussion on action/dynamic verbs and stative verbs)</p><p>Whether stative verbs can be used in the continuous form?</p><p>What change is made in the verb when to use in the continuous form?</p><p>Common errors made in using the future tense.</p><p>Difference between present continuous and present perfect tense.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Unlocking the Structure and  Significance of Verb Tenses",
      "id": 4393950,
      "id_name": "tenses-and-its-types-in-one-shot",
      "image": "https://img-b.udemycdn.com/course/480x270/4393950_afbe_2.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/4393950_afbe_2.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Prabh Kirpa Classes": "https://www.udemy.com/user/prabh-kirpa-classes/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": true,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["English Grammar"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:21 GMT",
      "last_updated": "Mon, 23 Oct 2023 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 7,
      "num_lectures": 7,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 30,
      "num_subscribers": 11260,
      "objectives": [
        "What is the meaning of tenses?",
        "What are the three types of tenses?",
        "Present Tense and its various types",
        "Past Tense and its four types",
        "Future tense and its types"
      ],
      "primary_category": "Teaching & Academics",
      "primary_subcategory": "Language Learning",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.8,
      "requirements_data": ["Nil"],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Students who are interested to learn Tenses and its types"
      ],
      "title": "Tenses Demystified: A  Fundamental Introduction",
      "what_you_will_learn_data": [
        "What is the meaning of tenses?",
        "What are the three types of tenses?",
        "Present Tense and its various types",
        "Past Tense and its four types",
        "Future tense and its types"
      ],
      "who_should_attend_data": [
        "Students who are interested to learn Tenses and its types"
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "2.5 hours",
      "coupon_code": "F3CDB837065F5134FDE6",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 679,
      "created_date": "Sun, 22 Jan 2023 16:40:21 GMT",
      "description": "<p>Hi Guys,</p><p>Welcome to my LinkedIn Ads MasterClass 2024!</p><p>In my course you will learn everything about LinkedIn Ads. I have created video lessons on every campaign and every feature of LinkedIn Ads. You will get to see the real practical implementation of how to create each and every campaign and how to use every feature of this product.</p><p>This is the most detailed course on LinkedIn Ads you will ever find on the internet. I have created different sections based on different topics of LinkedIn Ads and in each section, I have gone in-depth into explaining the concept of the each feature and how to practically implement it in LinkedIn Ads.</p><p>This course will give you a 100% understanding of LinkedIn Ads and after going through this course you will be capable of applying these concepts in building your own online business or handling LinkedIn Ads accounts of your clients. </p><p>At such a low price, you're going to get 40 detailed video lessons. A complete access to our student discussion forum, and the ability to ask me any questions you may have as you progress through the course.</p><p>On top of all that, you get lifetime access and a 30 day, 100% money back guarantee!</p><p>Topics you will learn in this course:</p><p>- LinkedIn Ads Overview - LinkedIn Ads Overview, How LinkedIn Ads Work, LinkedIn Ads Account Setup, LinkedIn Ads Auction, Bid Price & Relevancy Score, LinkedIn Ads Account Structure, LinkedIn Ads Metrics, LinkedIn Ads Account Navigation, Website Visits Campaign Creation</p><p>- Ads - Single Image Ad, Carousel Image Ad, Video Ad, Text Ad, Spotlight Ad, Document Ad, Conversation Ad, Event Ad, Follower Ad, Job Ad</p><p>- Bidding - Maximum Delivery, Cost Cap, Manual Bidding, Target Cost</p><p>- LinkedIn Audience Templates - Locations, Audience Attributes, Matched Audiences, Lookalike Audiences</p><p>- Conversion Tracking - What is Conversion Tracking & How to setup Conversion Tracking, Sitewide Insight Tag Page Load conversion, Event specific Insight Tag conversion, Event specific pixel conversion</p><p>- Remarketing - Overview, Retargeting Campaign Creation</p><p>- Video Ad - LinkedIn Video Ad Campaign</p><p>- Lead Gen - LinkedIn Lead Generation Ad Campaigns, View and download leads, metrics, and analytics for Lead Gen Form campaigns</p><p>- Dynamic Ad - LinkedIn Dynamic Ad Campaign Creation</p><p>- Carousel Image Ad - LinkedIn Carousel Image Ad Campaign</p><p>- Conversation Ad - Conversation Ad Campaign</p><p>- Message Ad - LinkedIn Message Ad Campaign</p><p>- Document Ad - Document Ad Campaign</p><p>- Event Ad - LinkedIn Event Ad Campaign</p><p>- Direct Sponsored Content - LinkedIn Direct Sponsored Content Single Image Ad Campaign</p><p>- Reports - How to use Reports in LinkedIn</p><p>- Billing - Billing Center</p><p>- Business Manager - Business Manager Overview</p><p>- Certification</p><p>Thank you so much for checking out my course. I look forward to seeing you in the course. So wait no more!</p><p>Click on the 'Buy now' button and join my course today!! Also check out my other courses!!</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "LinkedIn Ads 2024: Learn How To Create All Campaigns &amp; Features And Use It To Reach Your Customers &amp; Grow Your Revenue!!",
      "id": 5104122,
      "id_name": "linkedin-ads-masterclass-2023-all-campaigns-features",
      "image": "https://img-b.udemycdn.com/course/480x270/5104122_3f39_3.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5104122_3f39_3.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        { "Tanmoy Das": "https://www.udemy.com/user/tanmoy-kumar-das-3/" }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["LinkedIn"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:19 GMT",
      "last_updated": "Sat, 29 Jun 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 41,
      "num_lectures": 40,
      "num_practice_tests": 1,
      "num_quizzes": 1,
      "num_reviews": 271,
      "num_subscribers": 14613,
      "objectives": [
        "Bring Sales, Leads & Website Traffic To Your Online Business",
        "Get In-Depth Knowledge Of LinkedIn Ads To Grow Your Online Business",
        "Learn To Create Website Visits Campaign, Remarketing Campaign, Lead Generation Campaign, Direct Sponsored Content Single Image Ad Campaign",
        "Setup Insight Tag To Boost Sales Of Your Online Business",
        "Build Remarketing Campaigns To Follow Users On The Internet",
        "Target Different Types Of Audiences, Demographics To Reach Your Customers"
      ],
      "primary_category": "Marketing",
      "primary_subcategory": "Paid Advertising",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.8,
      "requirements_data": [
        "There Is NO Course Requirement Needed For LinkedIn Ads",
        "Anybody Who Has A Website, Blog, Facebook Page Can Use LinkedIn Ads To Promote Their Business",
        "Anyone With A Laptop, Personal Computer, Tablet Or Smartphone & Internet Connection Can Learn LinkedIn Ads"
      ],
      "sm_sending_time": {
        "telegram": { "@udemy_business": "Mon, 11 Nov 2024 05:05:55 GMT" }
      },
      "status_label": "Live",
      "target_audiences": [
        "Entrepreneurs Who Are Starting Their New Business",
        "Existing Business Who Want To Try LinkedIn Ads To Check How It Helps To Boost Sales",
        "Professionals Who Are Working In The Field Of PPC & Want To Upskill Their Knowledge About LinkedIn Ads",
        "Young Professionals Who Are Entering Into The Field Of Digital Marketing"
      ],
      "title": "LinkedIn Ads MasterClass - All Campaigns & Features",
      "what_you_will_learn_data": [
        "Bring Sales, Leads & Website Traffic To Your Online Business",
        "Get In-Depth Knowledge Of LinkedIn Ads To Grow Your Online Business",
        "Learn To Create Website Visits Campaign, Remarketing Campaign, Lead Generation Campaign, Direct Sponsored Content Single Image Ad Campaign",
        "Setup Insight Tag To Boost Sales Of Your Online Business",
        "Build Remarketing Campaigns To Follow Users On The Internet",
        "Target Different Types Of Audiences, Demographics To Reach Your Customers"
      ],
      "who_should_attend_data": [
        "Entrepreneurs Who Are Starting Their New Business",
        "Existing Business Who Want To Try LinkedIn Ads To Check How It Helps To Boost Sales",
        "Professionals Who Are Working In The Field Of PPC & Want To Upskill Their Knowledge About LinkedIn Ads",
        "Young Professionals Who Are Entering Into The Field Of Digital Marketing"
      ]
    },
    {
      "badges": ["New"],
      "campaign_type": "instructor_coupon",
      "caption_languages": [],
      "content_info_short": "40 questions",
      "coupon_code": "D276E5B37B0FDFEEDA71",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 947,
      "created_date": "Wed, 02 Oct 2024 08:14:39 GMT",
      "description": "<p>The JN0-663: Juniper Network Specialist Cloud course is designed for networking professionals who want to enhance their knowledge and skills in deploying, managing, and securing cloud-based network solutions using Juniper Networks technologies. This course provides an in-depth understanding of cloud architecture, security, and the integration of Juniper solutions within cloud environments.</p><p>Course Objectives</p><p>By the end of this course, participants will be able to:</p><ol><li><p>Understand Cloud Networking Concepts:</p><ul><li><p>Gain a solid foundation in cloud computing concepts, including service models (IaaS, PaaS, SaaS) and deployment models (public, private, hybrid).</p></li></ul></li><li><p>Design Cloud Architectures:</p><ul><li><p>Learn to design scalable and resilient cloud network architectures that meet business needs and industry best practices.</p></li></ul></li><li><p>Implement Juniper Cloud Solutions:</p><ul><li><p>Acquire hands-on experience in deploying and managing Juniper's cloud networking solutions, including the Contrail Networking platform.</p></li></ul></li><li><p>Manage Network Security in the Cloud:</p><ul><li><p>Explore best practices for securing cloud networks, including identity and access management, segmentation, and compliance.</p></li></ul></li><li><p>Integrate Automation in Cloud Operations:</p><ul><li><p>Understand how to utilize automation and orchestration tools to streamline cloud network operations and reduce manual intervention.</p></li></ul></li><li><p>Optimize Network Performance:</p><ul><li><p>Learn strategies to optimize network performance in cloud environments, ensuring low latency and high availability.</p></li></ul></li><li><p>Conduct Troubleshooting and Maintenance:</p><ul><li><p>Develop skills to troubleshoot common issues in cloud network deployments and maintain optimal network performance.</p></li></ul></li><li><p>Explore Multi-Cloud and Hybrid Solutions:</p><ul><li><p>Understand how to design and implement multi-cloud and hybrid cloud solutions, integrating different cloud service providers and on-premises resources.</p></li></ul></li></ol><p>Target Audience</p><p>This course is ideal for:</p><ul><li><p>Network Engineers: Professionals seeking to specialize in cloud networking and enhance their technical expertise.</p></li><li><p>Cloud Architects: Individuals responsible for designing and implementing cloud networking solutions.</p></li><li><p>Systems Administrators: Professionals managing cloud environments who want to deepen their understanding of networking principles.</p></li><li><p>Students: Those preparing for the Juniper Networks Certified Specialist Cloud (JNCIS-Cloud) certification.</p></li></ul><p>Prerequisites</p><p>While there are no strict prerequisites for this course, it is recommended that participants have:</p><ul><li><p>Basic Networking Knowledge: Familiarity with networking concepts, including routing, switching, and security fundamentals.</p></li><li><p>Experience with Juniper Technologies: Prior exposure to Juniper products and the Junos operating system is beneficial.</p></li><li><p>Completion of JNCIS-Cloud: Although not mandatory, the Juniper Networks Certified Specialist Cloud (JNCIS-Cloud) certification is recommended.</p></li></ul>",
      "detected_language": "en",
      "has_certificate": false,
      "has_closed_caption": false,
      "headline": "\"Mastering Cloud Networking Solutions and Security with Juniper Technologies\"",
      "id": 6214705,
      "id_name": "jn0-663-juniper-network-specialist-cloud-practice-test",
      "image": "https://img-b.udemycdn.com/course/480x270/6214705_659a.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6214705_659a.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "MD ZAHEDUL ISLAM": "https://www.udemy.com/user/md-zahedul-islam-10/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": true,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:18 GMT",
      "last_updated": "Sat, 19 Oct 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 2,
      "num_lectures": 0,
      "num_practice_tests": 2,
      "num_quizzes": 2,
      "num_reviews": 0,
      "num_subscribers": 955,
      "objectives": [
        "Cloud Networking Fundamentals: Understanding different cloud service models (IaaS, PaaS, SaaS) and deployment models (public, private, hybrid).",
        "Juniper Cloud Solutions: Knowledge of Juniper's cloud products, including Contrail, and how they integrate into networking environments.",
        "Networking Technologies in the Cloud: Implementing networking concepts within cloud environments, including virtual networks and security measures.",
        "Automation and Orchestration: Utilizing automation tools to manage cloud services and orchestrate networking tasks efficiently."
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "IT Certifications",
      "quality_review_admin_rating": null,
      "quality_review_score": null,
      "quality_status": "approved",
      "rating": 0,
      "requirements_data": [
        "Fundamental Networking Knowledge",
        "Experience with Juniper Devices",
        "Understanding of Security Concepts"
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Network Security Professionals, Network Engineers, System Administrators, Students and Newcomers to IT"
      ],
      "title": "JN0-663: Juniper Network Specialist Cloud Practice test 2024",
      "what_you_will_learn_data": [
        "Cloud Networking Fundamentals: Understanding different cloud service models (IaaS, PaaS, SaaS) and deployment models (public, private, hybrid).",
        "Juniper Cloud Solutions: Knowledge of Juniper's cloud products, including Contrail, and how they integrate into networking environments.",
        "Networking Technologies in the Cloud: Implementing networking concepts within cloud environments, including virtual networks and security measures.",
        "Automation and Orchestration: Utilizing automation tools to manage cloud services and orchestrate networking tasks efficiently."
      ],
      "who_should_attend_data": [
        "Network Security Professionals, Network Engineers, System Administrators, Students and Newcomers to IT"
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "10.5 hours",
      "coupon_code": "2ABB1CB69618DB4EA63D",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 888,
      "created_date": "Sat, 28 Aug 2021 02:17:53 GMT",
      "description": "<p>This course will focus on the importance of performing the bank reconciliation process and how to complete a bank reconciliation.</p><p>We will include many example problems, both in the format of presentations and Excel worksheet problems. The Excel worksheet presentations will include a downloadable Excel workbook with at least two tabs, one with the answer, the second with a preformatted worksheet that can be completed in a step-by-step process along with the instructional videos.</p><p>Cash management is a critical component to financial planning and taxes are a material part of cash management.</p><p>Learners will understand basic money management strategies and tax planning strategies. We will discuss the difference between a marginal tax rate and an average tax rate and how to use the appropriate tax rate when making financial plans</p><p>The course will also cover the differences between a tax deduction and a tax credit, an important distinction when doing tax planning.</p><p>Learners will know the different tax preparation options and understand which options may be best under different financial circumstances.</p><p>We will also be able to list and explain different financial services and the financial institutions that provide them, allowing us to make good decisions about which financial services to use and which financial institutions to work with.</p><p>The course will discuss the importance of reconciling the bank account, the bank reconciliation process being a big internal control over cash.</p><p>The purpose of the bank reconciliation is not just to make sure our ending cash balance is correct, but also to check that we have recorded the activity correctly.</p><p>Cash is the lifeblood of a business and of our financial activities. When thinking in terms of the double entry accounting system, cash will impact every financial cycle, meaning it will impact our revenue generation, our purchases, and our expenses, whether personal our business.</p><p>Therefore, the surer we are about the correctness of our cash transactions the surer we are about the correctness of our revenue, purchases, and expenses.</p><p>The bank reconciliation process will match our bookkeeping related to cash to the banks bookkeeping related to cash, giving us an external verification that the activity recorded is correct.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Learn about financial services, financial institutions, and how to create a personal bank reconciliation from a CPA",
      "id": 4267458,
      "id_name": "personal-finance-3financial-services-bank-reconciliation",
      "image": "https://img-b.udemycdn.com/course/480x270/4267458_b8b7.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/4267458_b8b7.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Robert (Bob) Steele": "https://www.udemy.com/user/c91d6786-95f3-48d8-ab94-cc92431d2aa4/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["Personal Finance"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:10 GMT",
      "last_updated": "Thu, 30 Dec 2021 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 46,
      "num_lectures": 46,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 42,
      "num_subscribers": 24710,
      "objectives": [
        "How to apply money management strategies",
        "How to apply tax management strategies",
        "Explain the difference between marginal tax rate and average tax rate and how to use the proper rate when planning",
        "Describe the difference between tax deductions and tax credits and how to use this information when doing tax planning",
        "List the different tax filing statuses and their impact on the tax calculation",
        "Explain the different tax preparation options and the pros and cons related to them",
        "List common financial services needed by individuals",
        "List financial institutions and the services they provide",
        "Describe what a bank reconciliation is",
        "Complete a personal bank reconciliation"
      ],
      "primary_category": "Finance & Accounting",
      "primary_subcategory": "Other Finance & Accounting",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.5,
      "requirements_data": [],
      "sm_sending_time": {
        "telegram": { "@udemy_business": "Sun, 10 Nov 2024 03:56:22 GMT" }
      },
      "status_label": "Live",
      "target_audiences": [
        "Anybody who want to improve their personal financial planning",
        "Students"
      ],
      "title": "Personal Finance #3–Financial Services & Bank Reconciliation",
      "what_you_will_learn_data": [
        "How to apply money management strategies",
        "How to apply tax management strategies",
        "Explain the difference between marginal tax rate and average tax rate and how to use the proper rate when planning",
        "Describe the difference between tax deductions and tax credits and how to use this information when doing tax planning",
        "List the different tax filing statuses and their impact on the tax calculation",
        "Explain the different tax preparation options and the pros and cons related to them",
        "List common financial services needed by individuals",
        "List financial institutions and the services they provide",
        "Describe what a bank reconciliation is",
        "Complete a personal bank reconciliation"
      ],
      "who_should_attend_data": [
        "Anybody who want to improve their personal financial planning",
        "Students"
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "1 hour",
      "coupon_code": "4A6017E62BF73C591C10",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 67,
      "created_date": "Wed, 04 Jan 2023 15:56:52 GMT",
      "description": "<p>1. What is the meaning of Online Transactions?</p><p>2. What are the three steps which are involved in the online transaction process?</p><p>3. Is it true that online transactions can be conducted using various devices?</p><p>4. What are the various features of online transactions?</p><p>5. Do you agree that there is reduced role of human in the online transactions process?</p><p>6. Is it possible to cancel an online transaction after the payment has been made?</p><p>7. Why does a transaction fail while doing on online payment?</p><p>8. What are the various benefits of online transactions?</p><p>9. Is it correct that in the case of online transaction, there is absence of delays in payments?</p><p>10. What are the various disadvantages of online transactions?</p><p>11. What are the various safety tips which should follow while doing online transactions?</p><p>12. How can we make passwords stronger which are difficult to hack?</p><p>13. Why it is advised that we should not use public computers for online transactions?</p><p>14. What is the benefit of installing good antivirus software?</p><p>15. How can we normally find that the particular site is secure or not?</p><p>16. What is the importance of using secure passwords in online transactions?</p><p>17. What is the meaning of online shopping?</p><p>18. What are the various payments options available in the case of online shopping?</p><p>19. What are the various benefits of online shopping?</p><p>20. What are the various disadvantages of online shopping?</p><p>21. What do you understand by OTP?</p><p>22. What are the various steps which we have to follow to purchase goods on Flipkart?</p><p>23. How can we create our account with Flipkart?</p><p>24. What is the full form of IRCTC?</p><p>25. How can we book ticket on IRCTC portal?</p><p>26. How we get the ticket when the ticket is booked online?</p><p>27. Why the online transactions are becoming increasingly common?</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Understanding the Basics of  Web Development and Its  Components Part- 4",
      "id": 5060138,
      "id_name": "web-applications-step-by-step-guide-part-4",
      "image": "https://img-b.udemycdn.com/course/480x270/5060138_be16_2.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5060138_be16_2.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Prabh Kirpa Classes": "https://www.udemy.com/user/prabh-kirpa-classes/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["Computer Skills"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:23 GMT",
      "last_updated": "Sat, 21 Oct 2023 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 5,
      "num_lectures": 5,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 39,
      "num_subscribers": 18071,
      "objectives": [
        "1. What is the meaning of online transactions?",
        "2. What are the various features of online transactions?",
        "3. What are the benefits and limitations of online transactions?",
        "4. What are the various safety tips which should follow while doing online transactions?"
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "Other IT & Software",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.2,
      "requirements_data": [
        "Use a trusted browser like Chrome, Mozilla Firefox or Internet Explorer/Edge for making online transaction.",
        "Have a good antivirus software installed in your computer."
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Students who are interested in learning about web applications"
      ],
      "title": "Web Application Fundamentals: Building Your Foundation Part4",
      "what_you_will_learn_data": [
        "1. What is the meaning of online transactions?",
        "2. What are the various features of online transactions?",
        "3. What are the benefits and limitations of online transactions?",
        "4. What are the various safety tips which should follow while doing online transactions?"
      ],
      "who_should_attend_data": [
        "Students who are interested in learning about web applications"
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "2 hours",
      "coupon_code": "ACC8D23069EA16558BDC",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 2,
      "created_date": "Sun, 17 Sep 2023 19:27:29 GMT",
      "description": "<p>1. What are the current trends and areas of interest in DBMS?</p><p>2. What is meant by Open source DBMS?</p><p>3. What is the meaning of Cloud-based DBMS? What are the various benefits of cloud-based DBMS?</p><p>4. Why is the data security a top most priority for DBMS?</p><p>5. What is meant by multi-cloud DBMS?</p><p>6. What are the various benefits of Automated DBMS?</p><p>7. What are the some trends that are shaping the future of DBMS?</p><p>8. Why the organizations are shifting towards Cloud-based DBMS?</p><p>9. What is meant by Blockchain technology?</p><p>10. What are various differences between SQL and NoSQL databases?</p><p>11. Which Query language is used by NoSQL databases?</p><p>12. What is the meaning of vertical scaling?</p><p>13. What is meant by Horizontal scalability?</p><p>14. Whether NoSQL databases follow ACID properties strictly?</p><p>15. How does the relational model handle data integrity and enforce constraints?</p><p>16. How does relational model ensure entity integrity?</p><p>17. How does relational model ensure referential integrity?</p><p>18. What are some commonly used constraints used by the relational model to enforce data integrity rules?</p><p>19. What does a Not-null constraint ensure?</p><p>20. What is the function of Default constraint?</p><p>21. What is the full form of “ACID” properties in DBMS?</p><p>22. What are the broad categories of data models?</p><p>23. What are the main types of NoSQL data models?</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Taking Your Database Skills to  the Next Level with real world  examples.",
      "id": 5563896,
      "id_name": "dbms-module-5",
      "image": "https://img-b.udemycdn.com/course/480x270/5563896_77cf.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5563896_77cf.jpg",
      "instructional_level_simple": "Intermediate",
      "instructors": [
        {
          "Prabh Kirpa Classes": "https://www.udemy.com/user/prabh-kirpa-classes/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:18 GMT",
      "last_updated": "Wed, 18 Oct 2023 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 5,
      "num_lectures": 5,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 57,
      "num_subscribers": 10732,
      "objectives": [
        "What are the current trends and future directions in Database  Management System?",
        "What are the various differences between SQL and NoSQL  databases?",
        "Why some Companies use a combination of both SQL and NoSQL databases to store and retrieve data?",
        "How is data integrity maintained in the relational   model?",
        "What are various data models to store data?"
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "Network & Security",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.4,
      "requirements_data": [
        "Basic computer skills and General knowledge of Information Technology concepts"
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": ["Students, businessmen and general public"],
      "title": "Database Management System Excellence: Module  5",
      "what_you_will_learn_data": [
        "What are the current trends and future directions in Database  Management System?",
        "What are the various differences between SQL and NoSQL  databases?",
        "Why some Companies use a combination of both SQL and NoSQL databases to store and retrieve data?",
        "How is data integrity maintained in the relational   model?",
        "What are various data models to store data?"
      ],
      "who_should_attend_data": ["Students, businessmen and general public"]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "2.5 hours",
      "coupon_code": "C266388F0EDBDB6BDBC4",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 946,
      "created_date": "Sun, 30 Jun 2024 03:17:43 GMT",
      "description": "<p>Welcome to this statistics course where we unravel the complexities of statistical relationships and predictive modeling. This course is meticulously designed for those who aspire to gain a profound understanding of correlation, regression, and the vital role they play in data analysis.</p><p>We start our journey by dissecting the concept of correlation, exploring its types and implications, and emphasizing that correlation does not imply causation. Through illustrative examples like the relationship between height and weight, and ice cream sales with temperature, we make these concepts tangible. We will calculate the Correlation Coefficient (r), helping us quantify the strength and direction of linear relationships.</p><p>Delving deeper, we introduce scatter plots, a pivotal tool in visualizing data relationships. Participants will learn to create and interpret scatter plots, identifying linear patterns and understanding when there might be no correlation at all. This visual prowess sets the stage for our next big topic: regression.</p><p>Why use regression? This course answers the question by guiding students through the principles of Simple Linear Regression, modeling the relationship between two variables. We explore the concept of residuals, emphasizing the goal of minimizing these values through the Least Squares Method.</p><p>However, we don't stop at just building models. The course instills a critical understanding of why \"Correlation ≠ Causation,\" exploring spurious correlations and highlighting the importance of not misinterpreting data relationships. Engaging examples ensure that these lessons are not just learned, but also applied.</p><p>By the end of this course, students will not only master the concepts of correlation and regression but also excel in utilizing these techniques for statistical analysis and predictive modeling. Join us to embark on this enlightening journey and transform your understanding of data relationships and the art of prediction.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Unraveling Statistical Relationships: Mastering Correlation and Regression Analysis",
      "id": 6049901,
      "id_name": "regressions-correlation",
      "image": "https://img-b.udemycdn.com/course/480x270/6049901_5470.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6049901_5470.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Robert (Bob) Steele": "https://www.udemy.com/user/c91d6786-95f3-48d8-ab94-cc92431d2aa4/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:24 GMT",
      "last_updated": "Wed, 03 Jul 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 9,
      "num_lectures": 9,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 7,
      "num_subscribers": 3466,
      "objectives": [
        "Understand the fundamental concepts of correlation and regression in statistical analysis.",
        "Identify different types of correlations and their implications in various datasets.",
        "Calculate the Correlation Coefficient (r) to quantify the strength and direction of linear relationships.",
        "Create scatter plots to visualize data relationships and identify linear patterns.",
        "Interpret scatter plots to determine the presence or absence of correlation.",
        "Apply the principles of Simple Linear Regression to model the relationship between two variables.",
        "Analyze residuals and employ the Least Squares Method to minimize them.",
        "Evaluate the distinction between correlation and causation, recognizing spurious correlations.",
        "Illustrate examples of statistical relationships using real-world data scenarios.",
        "Critique misinterpretations of data relationships, emphasizing the importance of accurate analysis."
      ],
      "primary_category": "Teaching & Academics",
      "primary_subcategory": "Math",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 3.7,
      "requirements_data": [
        "Basic Mathematical Skills: A foundational understanding of basic arithmetic, algebra, and mathematical concepts.",
        "Introduction to Statistics: Prior exposure to basic statistical concepts such as mean, median, mode, and standard deviation.",
        "Computer Literacy: Proficiency in using a computer for basic tasks, including file management and internet navigation.",
        "Data Handling Skills: Familiarity with data entry, manipulation, and basic spreadsheet functions (though no specific software, like Excel, will be required).",
        "Analytical Thinking: An aptitude for logical reasoning and problem-solving."
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Data Analysts: Professionals who analyze data and need a stronger grasp of correlation and regression techniques to enhance their analyses.",
        "Business Professionals: Individuals in business roles such as marketing, finance, and operations who use data to inform decision-making and strategy.",
        "Students: Learners in higher education pursuing degrees in fields such as data science, economics, psychology, sociology, and other disciplines where data analysis is essential.",
        "Anyone Interested in Data Analysis: Individuals with a curiosity about data and its applications, seeking to acquire practical skills in understanding and interpreting statistical relationships."
      ],
      "title": "Regressions & Correlation",
      "what_you_will_learn_data": [
        "Understand the fundamental concepts of correlation and regression in statistical analysis.",
        "Identify different types of correlations and their implications in various datasets.",
        "Calculate the Correlation Coefficient (r) to quantify the strength and direction of linear relationships.",
        "Create scatter plots to visualize data relationships and identify linear patterns.",
        "Interpret scatter plots to determine the presence or absence of correlation.",
        "Apply the principles of Simple Linear Regression to model the relationship between two variables.",
        "Analyze residuals and employ the Least Squares Method to minimize them.",
        "Evaluate the distinction between correlation and causation, recognizing spurious correlations.",
        "Illustrate examples of statistical relationships using real-world data scenarios.",
        "Critique misinterpretations of data relationships, emphasizing the importance of accurate analysis."
      ],
      "who_should_attend_data": [
        "Data Analysts: Professionals who analyze data and need a stronger grasp of correlation and regression techniques to enhance their analyses.",
        "Business Professionals: Individuals in business roles such as marketing, finance, and operations who use data to inform decision-making and strategy.",
        "Students: Learners in higher education pursuing degrees in fields such as data science, economics, psychology, sociology, and other disciplines where data analysis is essential.",
        "Anyone Interested in Data Analysis: Individuals with a curiosity about data and its applications, seeking to acquire practical skills in understanding and interpreting statistical relationships."
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English", "Korean [Auto]"],
      "content_info_short": "12 hours",
      "coupon_code": "FREENOV24",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 327,
      "created_date": "Sat, 10 Aug 2019 19:59:59 GMT",
      "description": "<p>You're looking for a complete Machine Learning course that can help you launch a flourishing career in the field of Data Science, Machine Learning, R and Predictive Modeling, right?</p><p>You've found the right Machine Learning course!</p><p>After completing this course, you will be able to:</p><p>· Confidently build predictive Machine Learning models using R to solve business problems and create business strategy</p><p>· Answer Machine Learning related interview questions</p><p>· Participate and perform in online Data Analytics competitions such as Kaggle competitions</p><p>Check out the table of contents below to see what all Machine Learning models you are going to learn.</p><p>How will this course help you?</p><p>A Verifiable Certificate of Completion is presented to all students who undertake this Machine learning basics course.</p><p>If you are a business manager or an executive, or a student who wants to learn and apply machine learning, R and predictive modelling in Real world problems of business, this course will give you a solid base for that by teaching you the most popular techniques of machine learning, R and predictive modelling.</p><p>Why should you choose this course?</p><p>This course covers all the steps that one should take while solving a business problem through linear regression. This course will give you an in-depth understanding of machine learning and predictive modelling techniques using R.</p><p>Most courses only focus on teaching how to run the analysis but we believe that what happens before and after running analysis is even more important i.e. before running analysis it is very important that you have the right data and do some pre-processing on it. And after running analysis, you should be able to judge how good your model is and interpret the results to actually be able to help your business.</p><p>What makes us qualified to teach you?</p><p>The course is taught by Abhishek and Pukhraj. As managers in Global Analytics Consulting firm, we have helped businesses solve their business problem using machine learning techniques using R, Python, and we have used our experience to include the practical aspects of data analysis in this course.</p><p>We are also the creators of some of the most popular online courses - with over 150,000 enrollments and thousands of 5-star reviews like these ones:</p><p>This is very good, i love the fact the all explanation given can be understood by a layman - Joshua</p><p>Thank you Author for this wonderful course. You are the best and this course is worth any price. - Daisy</p><p>Our Promise</p><p>Teaching our students is our job and we are committed to it. If you have any questions about the course content, machine learning, R, predictive modelling, practice sheet or anything related to any topic, you can always post a question in the course or send us a direct message.</p><p>Download Practice files, take Quizzes, and complete Assignments</p><p>With each lecture, there are class notes attached for you to follow along. You can also take quizzes to check your understanding of concepts of machine learning, R and predictive modelling. Each section contains a practice assignment for you to practically implement your learning on machine learning, R and predictive modelling.</p><p>Below is a list of popular FAQs of students who want to start their Machine learning journey-</p><p>What is Machine Learning?</p><p>Machine Learning is a field of computer science which gives the computer the ability to learn without being explicitly programmed. It is a branch of artificial intelligence based on the idea that systems can learn from data, identify patterns, and make decisions with minimal human intervention.</p><p>What are the steps I should follow to be able to build a Machine Learning model?</p><p>You can divide your learning process into 3 parts:</p><p>Statistics and Probability - Implementing Machine learning techniques require basic knowledge of Statistics and probability concepts. Second section of the course covers this part.</p><p>Understanding of Machine learning - Fourth section helps you understand the terms and concepts associated with Machine learning and gives you the steps to be followed to build a machine learning model</p><p>Programming Experience - A significant part of machine learning is programming. Python and R clearly stand out to be the leaders in the recent days. Third section will help you set up the Python environment and teach you some basic operations. In later sections there is a video on how to implement each concept taught in theory lecture in Python</p><p>Understanding of models - Fifth and sixth section cover Classification models and with each theory lecture comes a corresponding practical lecture where we actually run each query with you.</p><p>Why use R for Machine Learning?</p><p>Understanding R is one of the valuable skills needed for a career in Machine Learning. Below are some reasons why you should learn Machine learning in R</p><p>1. It’s a popular language for Machine Learning at top tech firms. Almost all of them hire data scientists who use R. Facebook, for example, uses R to do behavioral analysis with user post data. Google uses R to assess ad effectiveness and make economic forecasts. And by the way, it’s not just tech firms: R is in use at analysis and consulting firms, banks and other financial institutions, academic institutions and research labs, and pretty much everywhere else data needs analyzing and visualizing.</p><p>2. Learning the data science basics is arguably easier in R than Python. R has a big advantage: it was designed specifically with data manipulation and analysis in mind.</p><p>3. Amazing packages that make your life easier. As compared to Python, R was designed with statistical analysis in mind, it has a fantastic ecosystem of packages and other resources that are great for data science.</p><p>4. Robust, growing community of data scientists and statisticians. As the field of data science has exploded, usage of R and Python has exploded with it, becoming one of the fastest-growing languages in the world (as measured by StackOverflow). That means it’s easy to find answers to questions and community guidance as you work your way through projects in R.</p><p>5. Put another tool in your toolkit. No one language is going to be the right tool for every job. Like Python, adding R to your repertoire will make some projects easier – and of course, it’ll also make you a more flexible and marketable employee when you’re looking for jobs in data science.</p><p>What are the major advantages of using R over Python?</p><ul><li><p>As compared to Python, R has a higher user base and the biggest number of statistical packages and libraries available. Although, Python has almost all features that analysts need, R triumphs over Python.</p></li><li><p>R is a function-based language, whereas Python is object-oriented. If you are coming from a purely statistical background and are not looking to take over major software engineering tasks when productizing your models, R is an easier option, than Python.</p></li><li><p>R has more data analysis functionality built-in than Python, whereas Python relies on Packages</p></li><li><p>Python has main packages for data analysis tasks, R has a larger ecosystem of small packages</p></li><li><p>Graphics capabilities are generally considered better in R than in Python</p></li><li><p>R has more statistical support in general than Python</p></li></ul><p>What is the difference between Data Mining, Machine Learning, and Deep Learning?</p><p>Put simply, machine learning and data mining use the same algorithms and techniques as data mining, except the kinds of predictions vary. While data mining discovers previously unknown patterns and knowledge, machine learning reproduces known patterns and knowledge—and further automatically applies that information to data, decision-making, and actions.</p><p>Deep learning, on the other hand, uses advanced computing power and special types of neural networks and applies them to large amounts of data to learn, understand, and identify complicated patterns. Automatic language translation and medical diagnoses are examples of deep learning.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Linear &amp; Logistic Regression, Decision Trees, XGBoost, SVM &amp; other ML models in R programming language - R studio",
      "id": 2503534,
      "id_name": "machine-learning-with-r-studio",
      "image": "https://img-b.udemycdn.com/course/480x270/2503534_72f9_3.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/2503534_72f9_3.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Start-Tech Academy": "https://www.udemy.com/user/start-tech-academy/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": true,
      "is_in_any_ufb_content_collection": true,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [
        "Machine Learning",
        "R (programming language)",
        "Regression Analysis",
        "Decision Trees"
      ],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:12 GMT",
      "last_updated": "Fri, 04 Oct 2024 00:00:00 GMT",
      "num_assignments": 1,
      "num_coding_exercises": 0,
      "num_curriculum_items": 146,
      "num_lectures": 136,
      "num_practice_tests": 0,
      "num_quizzes": 9,
      "num_reviews": 2519,
      "num_subscribers": 265158,
      "objectives": [
        "Learn how to solve real life problem using the Machine learning techniques",
        "Machine Learning models such as Linear Regression, Logistic Regression, KNN etc.",
        "Advanced Machine Learning models such as Decision trees, XGBoost, Random Forest, SVM etc.",
        "Understanding of basics of statistics and concepts of Machine Learning",
        "How to do basic statistical operations and run ML models in R",
        "Indepth knowledge of data collection and data preprocessing for Machine Learning problem",
        "How to convert business problem into a Machine learning problem"
      ],
      "primary_category": "Development",
      "primary_subcategory": "Data Science",
      "quality_review_admin_rating": 7,
      "quality_review_score": 80,
      "quality_status": "approved",
      "rating": 4.3,
      "requirements_data": [
        "Students will need to install R and R studio software but  we have a separate lecture to help you install the same"
      ],
      "sm_sending_time": {
        "telegram": {
          "@programming_courses": "Fri, 08 Nov 2024 12:02:22 GMT",
          "@udemy_dev": "Fri, 08 Nov 2024 12:15:09 GMT"
        }
      },
      "status_label": "Live",
      "target_audiences": [
        "People pursuing a career in data science",
        "Working Professionals beginning their Data journey",
        "Statisticians needing more practical experience"
      ],
      "title": "Complete Machine Learning with R Studio - ML for 2024",
      "what_you_will_learn_data": [
        "Learn how to solve real life problem using the Machine learning techniques",
        "Machine Learning models such as Linear Regression, Logistic Regression, KNN etc.",
        "Advanced Machine Learning models such as Decision trees, XGBoost, Random Forest, SVM etc.",
        "Understanding of basics of statistics and concepts of Machine Learning",
        "How to do basic statistical operations and run ML models in R",
        "Indepth knowledge of data collection and data preprocessing for Machine Learning problem",
        "How to convert business problem into a Machine learning problem"
      ],
      "who_should_attend_data": [
        "People pursuing a career in data science",
        "Working Professionals beginning their Data journey",
        "Statisticians needing more practical experience"
      ]
    },
    {
      "badges": ["Highest Rated"],
      "campaign_type": "instructor_coupon",
      "caption_languages": [
        "English [Auto]",
        "Korean [Auto]",
        "Turkish [Auto]"
      ],
      "content_info_short": "22 hours",
      "coupon_code": "E7901EA55C7D54D457CD",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 815,
      "created_date": "Tue, 16 Apr 2019 22:54:16 GMT",
      "description": "<p>Unlock the power of managerial and cost accounting with our comprehensive Udemy course. This course dives deep into the crucial managerial accounting concept of cost-volume-profit (CVP) analysis, a dynamic tool that helps businesses determine how changes in costs and volumes affect their profits.</p><p>We kick off the course with a robust introduction to managerial accounting and cost accounting, clearly outlining their differences. The central tool for our exploration will be the Contribution Margin Income Statement, providing a roadmap as we delve into each component of CVP analysis.</p><p>Intricate concepts such as mixed costs are broken down, discussing their implications, and how to handle them effectively using methods like the high-low method and scatter diagram method.</p><p>Grasp the fundamental concept of break-even point in both units and revenue, building a strong foundation for subsequent topics in cost-volume-profit analysis. Forecasting becomes less daunting as we illuminate how CVP analysis can be leveraged for accurate projections and informed decision-making.</p><p>For businesses with multiple inventory products, we elucidate techniques to apply CVP analysis effectively, ensuring a wide application of the knowledge acquired.</p><p>Further, we navigate the concept of operating leverage - understanding its calculation and usefulness in business operations. We openly discuss the assumptions that underlie CVP analysis and address its potential limitations, ensuring you have a well-rounded understanding of its application in real-world scenarios.</p><p>The course features a comprehensive problem worked out using Excel, with step-by-step instructional videos to ensure you can follow along and fully grasp the application of the concepts learned.</p><p>With numerous Excel worksheets to assist your learning, you'll be able to practice and consolidate your understanding at every stage. Worksheets typically include three tabs - one with the completed problem, another with a preformatted worksheet to fill in, and a blank worksheet, enabling you to build your own tables from scratch if desired.</p><p>Whether you're an aspiring accountant, a business owner, a financial professional or a student, this course will arm you with the skills to navigate and apply cost-volume-profit analysis, and take your understanding of managerial and cost accounting to new heights.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Strategic Profit Management: In-depth Exploration of Cost-Volume-Profit Analysis in Managerial Accounting",
      "id": 2325776,
      "id_name": "cost-volume-profit-analysis-cvp-managerial-accounting",
      "image": "https://img-b.udemycdn.com/course/480x270/2325776_ac35_2.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/2325776_ac35_2.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Robert (Bob) Steele": "https://www.udemy.com/user/c91d6786-95f3-48d8-ab94-cc92431d2aa4/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": true,
      "is_in_any_ufb_content_collection": true,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["Management Accounting"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:13 GMT",
      "last_updated": "Sun, 30 Aug 2020 00:00:00 GMT",
      "num_assignments": 6,
      "num_coding_exercises": 0,
      "num_curriculum_items": 155,
      "num_lectures": 149,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 251,
      "num_subscribers": 56099,
      "objectives": [
        "Define key principles of managerial and cost accounting to solidify foundational knowledge.",
        "Demonstrate construction and use of a Contribution Margin Income Statement.",
        "Classify business costs into fixed, variable, and mixed categories.",
        "Calculate the break-even point in units and revenue for effective planning.",
        "Forecast future business performance using CVP analysis techniques.",
        "Adapt CVP analysis to scenarios with multiple inventory products.",
        "Explain operating leverage, compute it, and discuss its implications.",
        "Evaluate assumptions underpinning CVP analysis and recognize its limitations.",
        "Apply learned concepts to solve comprehensive Excel-based problems.",
        "Assess the impact of changes in cost and volume on profit, using CVP analysis tools.",
        "Formulate strategies to optimize profitability using the results of CVP analysis.",
        "Identify the relevance and application of CVP analysis in various business contexts.",
        "Distinguish between the high-low method and scatter diagram method for handling mixed costs."
      ],
      "primary_category": "Office Productivity",
      "primary_subcategory": "Other Office Productivity",
      "quality_review_admin_rating": 7,
      "quality_review_score": 80,
      "quality_status": "approved",
      "rating": 4.7,
      "requirements_data": [
        "Basic Accounting Knowledge: Understanding of fundamental accounting concepts and terminologies.",
        "Familiarity with Financial Statements: Basic knowledge of income statements and balance sheets will be beneficial.",
        "Mathematical Skills: Basic mathematical and analytical skills are needed for calculations involved in CVP analysis.",
        "Willingness to Learn: Most importantly, students should have an eagerness to learn and understand complex accounting concepts."
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Aspiring Accountants: Those who are pursuing a career in accounting and want to gain a deeper understanding of managerial and cost accounting principles.",
        "Business Owners/Entrepreneurs: Individuals running their own business who want to have a better understanding of how costs, volume, and profit are interconnected.",
        "Finance Professionals: Professionals working in finance who wish to improve their skills and knowledge of cost management and profit optimization.",
        "Students: Students studying business, finance, or accounting who want to supplement their college education with practical, real-world applications.",
        "Management Consultants: Consultants who advise businesses on cost management and efficiency improvements.",
        "Anyone Interested in Business Finance: This course is also suitable for anyone with an interest in understanding the financial dynamics of a business better."
      ],
      "title": "Cost Volume Profit Analysis (CVP) – Managerial Accounting",
      "what_you_will_learn_data": [
        "Define key principles of managerial and cost accounting to solidify foundational knowledge.",
        "Demonstrate construction and use of a Contribution Margin Income Statement.",
        "Classify business costs into fixed, variable, and mixed categories.",
        "Calculate the break-even point in units and revenue for effective planning.",
        "Forecast future business performance using CVP analysis techniques.",
        "Adapt CVP analysis to scenarios with multiple inventory products.",
        "Explain operating leverage, compute it, and discuss its implications.",
        "Evaluate assumptions underpinning CVP analysis and recognize its limitations.",
        "Apply learned concepts to solve comprehensive Excel-based problems.",
        "Assess the impact of changes in cost and volume on profit, using CVP analysis tools.",
        "Formulate strategies to optimize profitability using the results of CVP analysis.",
        "Identify the relevance and application of CVP analysis in various business contexts.",
        "Distinguish between the high-low method and scatter diagram method for handling mixed costs."
      ],
      "who_should_attend_data": [
        "Aspiring Accountants: Those who are pursuing a career in accounting and want to gain a deeper understanding of managerial and cost accounting principles.",
        "Business Owners/Entrepreneurs: Individuals running their own business who want to have a better understanding of how costs, volume, and profit are interconnected.",
        "Finance Professionals: Professionals working in finance who wish to improve their skills and knowledge of cost management and profit optimization.",
        "Students: Students studying business, finance, or accounting who want to supplement their college education with practical, real-world applications.",
        "Management Consultants: Consultants who advise businesses on cost management and efficiency improvements.",
        "Anyone Interested in Business Finance: This course is also suitable for anyone with an interest in understanding the financial dynamics of a business better."
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": [],
      "content_info_short": "200 questions",
      "coupon_code": "HAPPYDIWALI",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 890,
      "created_date": "Wed, 19 Jan 2022 18:53:42 GMT",
      "description": "<p>Hi, and Welcome to this course on Solidity Practice Tests and Interview Questions. </p><p><br></p><p>Are you looking to jump aboard the Web3 wagon and be a blockchain developer deploying smart contracts ?</p><p>Are you looking to practice Solidity language and work as a freelance blockchain developer - which is already making millionaires in this space?</p><p>Are you practicing for your upcoming Blockchain developer Interview in your dream company and want to boost your chances?</p><p>Or are you a Solidity developer, looking to refresh/update your coding skills and knowledge on Solidity?</p><p>As we all now can imagine, Blockchain is one of the most disruptive technologies of this decade. It is poised to drastically change many industries in the coming years.</p><p><br></p><p>Did you know:</p><ul><li><p>Spending on blockchain solutions is estimated to jump from $1.5 billion in 2021 to over $16 billion in 2024*</p></li><li><p>26% of companies plan on investing between $1 million and $5 million in blockchain technology*</p></li><li><p>32% of companies are currently in the development stage of blockchain projects*</p></li><li><p><br></p></li></ul><p>Today, The time that is right now, is the best time and a golden opportunity to break into this space and jumpstart a profitable career as a blockchain developer on Ethereum network and beyond. Solidity is the most popular language used for developing on Ethereum. Therefore, in this course we are focused on smart contract development using solidity, and we bring to you over 100 questions around various topics on Solidity, like its Syntax and Codes, Pragmas, the structure of a Solidity Code that includes variables, functions, modifiers, events, errors etc, advanced topics like deploying smart contracts and even basics like comments and more. </p><p>These questions are all based on latest version of Solidity - 0.8.x.</p>",
      "detected_language": "en",
      "has_certificate": false,
      "has_closed_caption": false,
      "headline": "Update / Refresh your knowledge on Solidity, or prepare better for your Solidity Developer Interview with Practice Tests",
      "id": 4504042,
      "id_name": "solidity-interview-questions-and-practice-tests-for-blockchain-devs",
      "image": "https://img-b.udemycdn.com/course/480x270/4504042_5679_3.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/4504042_5679_3.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        { "Prince Patni": "https://www.udemy.com/user/prince-patni/" }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": true,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["Solidity"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:20 GMT",
      "last_updated": "Wed, 03 Aug 2022 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 6,
      "num_lectures": 0,
      "num_practice_tests": 6,
      "num_quizzes": 6,
      "num_reviews": 30,
      "num_subscribers": 24464,
      "objectives": [
        "All levels of questions on Solidity - from Basics to Advanced",
        "Common Solidity / Blockchain Developer Interview Questions",
        "Engineers who want to understand Solidity and how to build apps with it",
        "All the knowledge you should have on Web3, Solidity, Crypto, Ethereum, Blockchain etc.",
        "Anyone who want to become Proficient In Solidity Programming",
        "Be Able To Comprehend The Structure Of Solidity Code.",
        "Fully Updated for 2022 and the latest version of Solidity",
        "Get a very good understanding of Solidity Contract Programming Language (syntax and concepts like state variables, storage, functions, visibility, code, errors)",
        "Become an advanced and confident Solidity developer from scratch"
      ],
      "primary_category": "Development",
      "primary_subcategory": "Web Development",
      "quality_review_admin_rating": null,
      "quality_review_score": null,
      "quality_status": "approved",
      "rating": 4.8,
      "requirements_data": [
        "Basic knowledge of Solidity",
        "Advanced Blockchain knowledge is not required"
      ],
      "sm_sending_time": {
        "telegram": { "-1002210106833": "Sun, 29 Sep 2024 21:26:01 GMT" }
      },
      "status_label": "Live",
      "target_audiences": [
        "Individuals Who Want To Benefit From One Of The Most In-Demand Skills in 2022",
        "Technologists Who Want To Join The Highest Paid Developer Workforce - Blockchain.",
        "Freelancers Who Want To Earn Money Writing Building Blockchain Apps.",
        "Developers Who Want To Build Ethereum Blockchain Applications Using Solidity.",
        "Professionals Who Want To Add 'Blockchain Developer'  or 'Solidity Developer' To Their Resume.",
        "Anybody about to be interviewed as a Blockchain Developer.",
        "Anybody about to take interview for Blockchain Developers in their team.",
        "Anybody who want to update / refresh their Solidity knowledge."
      ],
      "title": "Solidity Interview Questions & Practice Tests (updated)",
      "what_you_will_learn_data": [
        "All levels of questions on Solidity - from Basics to Advanced",
        "Common Solidity / Blockchain Developer Interview Questions",
        "Engineers who want to understand Solidity and how to build apps with it",
        "All the knowledge you should have on Web3, Solidity, Crypto, Ethereum, Blockchain etc.",
        "Anyone who want to become Proficient In Solidity Programming",
        "Be Able To Comprehend The Structure Of Solidity Code.",
        "Fully Updated for 2022 and the latest version of Solidity",
        "Get a very good understanding of Solidity Contract Programming Language (syntax and concepts like state variables, storage, functions, visibility, code, errors)",
        "Become an advanced and confident Solidity developer from scratch"
      ],
      "who_should_attend_data": [
        "Individuals Who Want To Benefit From One Of The Most In-Demand Skills in 2022",
        "Technologists Who Want To Join The Highest Paid Developer Workforce - Blockchain.",
        "Freelancers Who Want To Earn Money Writing Building Blockchain Apps.",
        "Developers Who Want To Build Ethereum Blockchain Applications Using Solidity.",
        "Professionals Who Want To Add 'Blockchain Developer'  or 'Solidity Developer' To Their Resume.",
        "Anybody about to be interviewed as a Blockchain Developer.",
        "Anybody about to take interview for Blockchain Developers in their team.",
        "Anybody who want to update / refresh their Solidity knowledge."
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "1 hour",
      "coupon_code": "64061CF603EE7C4C1CA6",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 84,
      "created_date": "Wed, 19 Jul 2023 10:05:18 GMT",
      "description": "<p>1. How to make a grouped frequency distribution table where the data in respect of concentration of sulphur dioxide in the air of a certain city for the last few days is given along with class intervals.</p><p>2. How to prepare a frequency distribution table in respect of the data of number of heads occurred when a few coins were tossed many times simultaneously.</p><p>3. The students will learn to form a frequency distribution table when the data in respect of the value of π up to many decimal places is given.</p><p>4. How to form a grouped frequency distribution table when the data in respect of many students is given who watched the TV programmes for different hours in the previous week.</p><p>5. The students will also learn to construct a grouped frequency distribution table where the data in respect of lives of few car batteries is given.</p><p>6. When the large amount of data is to be presented, we can condense the data in to groups and these groupings are called “classes” or “class-intervals” and their size is called the class-size or class width. In each of these groupings/classes, the least number is called the lower class limit and the greater number is called the upper class limit.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Advanced Techniques for Data  Analysis and Interpretation",
      "id": 5452502,
      "id_name": "exploring-frequency-distribution-tables-part-2",
      "image": "https://img-b.udemycdn.com/course/480x270/5452502_9e18_2.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5452502_9e18_2.jpg",
      "instructional_level_simple": "Intermediate",
      "instructors": [
        {
          "Prabh Kirpa Classes": "https://www.udemy.com/user/prabh-kirpa-classes/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:11 GMT",
      "last_updated": "Wed, 18 Oct 2023 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 6,
      "num_lectures": 6,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 6,
      "num_subscribers": 5712,
      "objectives": [
        "How to make a grouped frequency distribution table where the data in respect of concentration of sulphur dioxide in the air of a certain city for the last few.",
        "How to prepare a frequency distribution table in respect of the data of number of heads occurred when many coins were tossed many times simultaneously.",
        "How to form a frequency distribution table when the data in respect of the value of π up to many decimal places is given.",
        "How to form a grouped frequency distribution table when the data in respect of many students is given who watched the TV programmes for different hours.",
        "How to construct a grouped frequency distribution table where the data in respect of lives of few car batteries is given."
      ],
      "primary_category": "Teaching & Academics",
      "primary_subcategory": "Math",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.8,
      "requirements_data": [
        "Basic knowledge of Algebra and Geometric concepts"
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Students and any individual who enjoys learning about various mathematical concepts."
      ],
      "title": "Frequency Distribution  Mastery: Part 2",
      "what_you_will_learn_data": [
        "How to make a grouped frequency distribution table where the data in respect of concentration of sulphur dioxide in the air of a certain city for the last few.",
        "How to prepare a frequency distribution table in respect of the data of number of heads occurred when many coins were tossed many times simultaneously.",
        "How to form a frequency distribution table when the data in respect of the value of π up to many decimal places is given.",
        "How to form a grouped frequency distribution table when the data in respect of many students is given who watched the TV programmes for different hours.",
        "How to construct a grouped frequency distribution table where the data in respect of lives of few car batteries is given."
      ],
      "who_should_attend_data": [
        "Students and any individual who enjoys learning about various mathematical concepts."
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "1.5 hours",
      "coupon_code": "E643DAAEF7B648E4C457",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 67,
      "created_date": "Wed, 12 Jul 2023 18:01:22 GMT",
      "description": "<p>1. What are those points which should be looked into while purchasing antivirus?</p><p>2. Our antivirus should provide real time protection. What is the meaning of real time protection?</p><p>3. Our antivirus should be compatible with the operating system of our computer. What it means?</p><p>4. What is the purpose of fire wall?</p><p>5. What is meant by password manager?</p><p>6. Some antivirus offer parental control features. What is the benefit of parental control feature?</p><p>7. Why the antivirus will continue to face numerous challenges in future?</p><p>8. What are the various future challenges for antivirus software?</p><p>9. What is the meaning of advanced persistent threats?</p><p>10. What is meant by cloud-based threats?</p><p>11. Give an example from the real world which demonstrates the important role played by antivirus in cybersecurity.</p><p>12. There is need for international collaboration in cybersecurity efforts. Give an example of the same from the real world.</p><p>13. What are various legal considerations in antivirus software usage?</p><p>14. We should have a legitimate licence to use the antivirus software. Why?</p><p>15. Antivirus software vendors must adhere to consumer protection laws. Comment.</p><p>16. What are various ethical considerations related to antivirus software?</p><p>17. Antivirus software vendor should provide clear information to the users regarding antivirus software. What this clear information refers to?</p><p>18. The user of antivirus software should follow responsible disclosure practices. What is meant by that?</p><p>19. The user of antivirus software should not engage in unethical or illegal activities. Comment.</p><p>20. What are emerging trends in Antivirus?</p><p>21. What is meant by Cloud-Based Antivirus?</p><p>22. What is the meaning of zero-day threats?</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Choosing the Right Antivirus for  Your Digital Protection Needs",
      "id": 5440008,
      "id_name": "11-key-factors-to-consider-before-purchasing-antivirus",
      "image": "https://img-b.udemycdn.com/course/480x270/5440008_3c8d.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5440008_3c8d.jpg",
      "instructional_level_simple": "Beginner",
      "instructors": [
        {
          "Prabh Kirpa Classes": "https://www.udemy.com/user/prabh-kirpa-classes/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:16 GMT",
      "last_updated": "Wed, 18 Oct 2023 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 7,
      "num_lectures": 7,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 11,
      "num_subscribers": 7034,
      "objectives": [
        "What are the key factors or important points which we should consider before purchasing antivirus?",
        "What are the various future challenges for antivirus software?",
        "What are the legal considerations in antivirus software usage?",
        "What are the ethical considerations related to antivirus software?",
        "What are the emerging trends in antivirus software?"
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "Network & Security",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 3.9,
      "requirements_data": [
        "Basic Computer Skills, Basic understanding of cybersecurity principles and genuine interest in the subject matter."
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": ["Students, Business owners and General Public"],
      "title": "Making Informed Choices: 11  Antivirus Buying Factors",
      "what_you_will_learn_data": [
        "What are the key factors or important points which we should consider before purchasing antivirus?",
        "What are the various future challenges for antivirus software?",
        "What are the legal considerations in antivirus software usage?",
        "What are the ethical considerations related to antivirus software?",
        "What are the emerging trends in antivirus software?"
      ],
      "who_should_attend_data": ["Students, Business owners and General Public"]
    },
    {
      "badges": ["New"],
      "campaign_type": "instructor_coupon",
      "caption_languages": [],
      "content_info_short": "40 questions",
      "coupon_code": "06DDDE4C00BC39B44211",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 928,
      "created_date": "Wed, 02 Oct 2024 06:47:06 GMT",
      "description": "<p>The 1V0-21.20: Associate VMware Data Center Virtualization certification serves as a foundational step for those beginning their journey into the world of virtualization and data center management using VMware’s industry-leading vSphere platform. This course is designed for IT professionals, students, and those aspiring to enter the virtualization space who are seeking a comprehensive introduction to VMware vSphere, its core components, and basic operational management.</p><p>Throughout the course, you'll explore fundamental concepts related to data center virtualization, such as virtual machines, ESXi hosts, vCenter Server, storage and network configurations, and basic administrative tasks. The course emphasizes building a strong understanding of virtualization and prepares you for the VMware Certified Technical Associate (VCTA) exam, which validates your skills at the entry level, making you a competitive candidate for junior roles in system administration and IT infrastructure support.</p><p>Who is this Course For?</p><ul><li><p>Aspiring IT Professionals: Individuals with an interest in virtualization and cloud technologies who are looking to break into the industry and gain foundational knowledge of VMware vSphere.</p></li><li><p>Students and Recent Graduates: College students or recent graduates pursuing careers in IT infrastructure, system administration, or data center management who want to gain practical skills in virtualization technology.</p></li><li><p>Entry-Level System Administrators: Current IT professionals who are new to virtualization and want to expand their skill set by learning about VMware vSphere and its role in modern data centers.</p></li><li><p>Anyone Interested in VMware Certifications: If you're looking to start a path toward more advanced VMware certifications, this course will give you the foundation needed to continue on to professional and advanced levels, such as VCP-DCV.</p></li></ul><p>Learning Outcomes:</p><p>Upon completing the 1V0-21.20: Associate VMware Data Center Virtualization course, you will be able to:</p><ol><li><p>Understand Data Center Virtualization:</p><ul><li><p>Grasp the core concepts of data center virtualization and its role in modern IT infrastructures.</p></li><li><p>Learn about the benefits and use cases of virtualization for businesses, including cost savings, scalability, and improved resource utilization.</p></li></ul></li><li><p>Understand VMware vSphere Architecture:</p><ul><li><p>Learn about VMware vSphere’s core components, including ESXi, vCenter Server, and virtual machines (VMs).</p></li><li><p>Understand how VMware vSphere consolidates physical servers and simplifies IT management in data center environments.</p></li></ul></li><li><p>Install and Configure VMware vSphere Components:</p><ul><li><p>Install and configure VMware ESXi hosts, and gain an understanding of vCenter Server setup.</p></li><li><p>Learn about basic network and storage configurations within VMware environments.</p></li></ul></li><li><p>Create and Manage Virtual Machines:</p><ul><li><p>Gain hands-on experience creating and managing virtual machines in a VMware vSphere environment.</p></li><li><p>Learn about the configuration and allocation of resources such as CPU, memory, and storage to virtual machines.</p></li></ul></li><li><p>Understand Virtual Networking and Storage:</p><ul><li><p>Learn about virtual networking concepts and how to configure standard switches to provide network connectivity to VMs.</p></li><li><p>Understand storage technologies such as VMFS, NFS, and iSCSI, and how they are used to store virtual machine data.</p></li></ul></li><li><p>Monitor and Manage VMware Environments:</p><ul><li><p>Learn how to monitor virtual machine performance and resource usage using vSphere tools.</p></li><li><p>Understand basic management tasks in vSphere, such as VM migrations, snapshots, and backups.</p></li></ul></li><li><p>Basic Troubleshooting Techniques:</p><ul><li><p>Gain insight into common issues in VMware environments and basic troubleshooting techniques to resolve them.</p></li><li><p>Learn to diagnose problems using vSphere logs and other built-in tools.</p></li></ul></li></ol>",
      "detected_language": "en",
      "has_certificate": false,
      "has_closed_caption": false,
      "headline": "\"Foundations of Virtualization and Cloud Management with VMware vSphere 7.x\"",
      "id": 6214519,
      "id_name": "1v0-2120-associate-vmware-data-center-virtualization-exams",
      "image": "https://img-b.udemycdn.com/course/480x270/6214519_9f41.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6214519_9f41.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "MD ZAHEDUL ISLAM": "https://www.udemy.com/user/md-zahedul-islam-10/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": true,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:20 GMT",
      "last_updated": "Mon, 07 Oct 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 2,
      "num_lectures": 0,
      "num_practice_tests": 2,
      "num_quizzes": 2,
      "num_reviews": 1,
      "num_subscribers": 1465,
      "objectives": [
        "VMware vSphere Architecture",
        "VM Creation and Management",
        "vSphere Networking",
        "vSphere Storage"
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "IT Certifications",
      "quality_review_admin_rating": null,
      "quality_review_score": null,
      "quality_status": "approved",
      "rating": 5,
      "requirements_data": [
        "Basic IT Knowledge",
        "Understanding of Data Centers",
        "nterest in Virtualization"
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "System Engineers, Infrastructure Engineers, IT Professionals, Data Center Administrators"
      ],
      "title": "1V0-21.20: Associate VMware Data Center Virtualization Exam",
      "what_you_will_learn_data": [
        "VMware vSphere Architecture",
        "VM Creation and Management",
        "vSphere Networking",
        "vSphere Storage"
      ],
      "who_should_attend_data": [
        "System Engineers, Infrastructure Engineers, IT Professionals, Data Center Administrators"
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": [],
      "content_info_short": "12.5 hours",
      "coupon_code": "83CBD9B85978B85051A4",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 83,
      "created_date": "Wed, 17 Apr 2024 10:47:19 GMT",
      "description": "<p>У данного курса также есть бесплатная краткая версия (первые 2 часа видео).Ее можно найти в профиле автора.</p><p><br></p><p>SQL - это сложно,непонятно?Вовсе нет! </p><p>Язык запросов к базам данных - вполне себе логичный и интуитивно понятный язык.</p><p>И в данном курсе мы обязательно убедимся этом.</p><p><br></p><p>При этом знание баз данных нужно абсолютно всем АйТишникам: и программистам, и тестировщикам,и аналитикам,и даже менеджерам... Все понимают,что SQL - очень востребованный навык в нашей индустрии.</p><p><br></p><p>Это исключительно практический курс. Мы спроектируем базу данных популярного мессенджера и научимся писать запросы к ней. Обсудим вопросы взаимодействия с сервером, начиная с установки рабочего окружения и закончим командами набора DDL и DML. Научимся писать все виды типовых запросов.</p><p><br></p><p>Кому может быть полезен этот курс:</p><ul><li><p>Новичкам - Отличная возможность познакомиться с базами данных и языком SQL на живом примере</p></li><li><p>Студентам - Получите отличную практику проектирования БД и написания запросов к ней</p></li><li><p>ИТ-специалистам - Расширите и структурируете свои знания в SQL, закроете пробелы. Получите +1 проект в портфолио</p></li></ul><p><br></p><p>Чему можно научиться в курсе:</p><ul><li><p>Проектировать БД - Обсудим подробно на конкретном примере набор команд DDL (data definition language)</p></li><li><p>Писать SQL запросы - Будем практиковаться с разными видами запросов к базе данных</p></li><li><p>Взаимодействовать с сервером - На примере базы MySQL данных научимся типовым операциям на сервере БД</p></li></ul><p><br></p><p>Попробуйте! Если что-то пойдет не так,то Вы знаете,что платформа Udemy гарантирует 30-дневную возможность вернуть деньги за курс.</p><p><br></p><p>Добро пожаловать на борт!</p><p>И успехов Вам в учебе и в ИТ индустрии!</p>",
      "detected_language": "ru",
      "has_certificate": true,
      "has_closed_caption": false,
      "headline": "Спроектируем базу данных популярного мессенджера и научимся писать все виды запросов к ней (видео, тесты, SQL-задачи)",
      "id": 5929080,
      "id_name": "mysql-basics-ru",
      "image": "https://img-b.udemycdn.com/course/480x270/5929080_eaee_3.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/5929080_eaee_3.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Pragmatic Programmer .": "https://www.udemy.com/user/kirill-ivanov-11/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "Russian",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:16 GMT",
      "last_updated": "Mon, 22 Jul 2024 00:00:00 GMT",
      "num_assignments": 1,
      "num_coding_exercises": 10,
      "num_curriculum_items": 163,
      "num_lectures": 146,
      "num_practice_tests": 1,
      "num_quizzes": 16,
      "num_reviews": 13,
      "num_subscribers": 1975,
      "objectives": [
        "Спроектируем базу данных популярного мессенджера",
        "Научимся писать запросы к ней.",
        "Обсудим вопросы взаимодействия с сервером, начиная с установки рабочего окружения",
        "Познакомимся с командами набора DDL и DML.",
        "Научимся писать все виды типовых запросов."
      ],
      "primary_category": "Development",
      "primary_subcategory": "Database Design & Development",
      "quality_review_admin_rating": 7,
      "quality_review_score": 0,
      "quality_status": "approved",
      "rating": 5,
      "requirements_data": [
        "Начальные знания о пользовании ПК (мышь, клавиатура)."
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Для новичков в SQL",
        "Для студентов",
        "Для ИТ-специалистов",
        "Для всех интересующихся SQL"
      ],
      "title": "SQL практикум для начинающих и продолжающих (полный курс)",
      "what_you_will_learn_data": [
        "Спроектируем базу данных популярного мессенджера",
        "Научимся писать запросы к ней.",
        "Обсудим вопросы взаимодействия с сервером, начиная с установки рабочего окружения",
        "Познакомимся с командами набора DDL и DML.",
        "Научимся писать все виды типовых запросов."
      ],
      "who_should_attend_data": [
        "Для новичков в SQL",
        "Для студентов",
        "Для ИТ-специалистов",
        "Для всех интересующихся SQL"
      ]
    },
    {
      "badges": ["New"],
      "campaign_type": "instructor_coupon",
      "caption_languages": [],
      "content_info_short": "50 questions",
      "coupon_code": "9530641230E0F7E3E2B5",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 821,
      "created_date": "Sat, 31 Aug 2024 05:32:42 GMT",
      "description": "<p>Welcome to the Cisco CCNA 200-301 course, your gateway to mastering the essential skills needed for a successful career in networking. This comprehensive program is designed to equip you with a thorough understanding of networking fundamentals, Cisco technologies, and practical skills necessary for managing and troubleshooting modern network infrastructures.</p><p>Course Overview:</p><p>The Cisco CCNA 200-301 course covers a broad range of networking topics, integrating foundational concepts with advanced techniques to prepare you for real-world networking scenarios. Whether you are just starting your journey in IT or seeking to enhance your current skills, this course provides the knowledge and hands-on experience needed to excel in the field of network administration.</p><p>Course Objectives:</p><ol><li><p>Understand Networking Fundamentals:</p><ul><li><p>Gain a solid grounding in networking concepts, including the OSI and TCP/IP models, IP addressing, and subnetting. Learn how data is transmitted across networks and how to interpret and use various network devices.</p></li><li><p>Explore different types of networks such as LANs (Local Area Networks) and WANs (Wide Area Networks), and understand their roles and configurations.</p></li></ul></li><li><p>Get to Know Cisco Devices:</p><ul><li><p>Learn about Cisco routers and switches, including their components, functions, and how they fit into a network. Understand how to configure these devices and manage their settings using Cisco IOS (Internetwork Operating System).</p></li><li><p>Develop the skills to set up and configure Cisco devices for various networking scenarios, ensuring they operate effectively within your network infrastructure.</p></li></ul></li><li><p>Master IP Addressing and Subnetting:</p><ul><li><p>Deep dive into IPv4 and IPv6 addressing, including how to assign IP addresses, create subnets, and manage IP addressing schemes.</p></li><li><p>Practice subnetting and address management to ensure efficient and scalable network configurations.</p></li></ul></li><li><p>Configure Routing and Switching:</p><ul><li><p>Understand the principles of routing and switching, including how to set up static and dynamic routing protocols like OSPF (Open Shortest Path First) and EIGRP (Enhanced Interior Gateway Routing Protocol).</p></li><li><p>Learn how to configure VLANs (Virtual Local Area Networks), manage VLAN memberships, and understand the role of VLANs in network segmentation and traffic management.</p></li></ul></li><li><p>Implement Network Security:</p><ul><li><p>Explore fundamental network security concepts and practices, including the use of firewalls, access control lists (ACLs), and secure management of network devices.</p></li><li><p>Learn to implement security measures to protect your network from common threats and vulnerabilities, ensuring a secure network environment.</p></li></ul></li><li><p>Explore Wireless Networking:</p><ul><li><p>Gain an understanding of wireless networking principles, including wireless standards (e.g., 802.11), security protocols, and configuration of wireless access points.</p></li><li><p>Learn how to integrate wireless networks with wired infrastructure and troubleshoot common wireless issues.</p></li></ul></li><li><p>Develop Troubleshooting Skills:</p><ul><li><p>Learn systematic troubleshooting techniques to diagnose and resolve network issues efficiently. Practice using various network troubleshooting tools and commands to identify and fix problems.</p></li><li><p>Engage in hands-on labs and simulations to apply troubleshooting techniques in real-world scenarios.</p></li></ul></li><li><p>Apply Knowledge in Real-World Scenarios:</p><ul><li><p>Work on practical exercises and case studies that reflect real-world networking challenges. Apply the skills and knowledge acquired throughout the course to solve complex networking problems.</p></li><li><p>Gain experience through interactive labs and simulations that provide hands-on practice with Cisco networking devices and configurations.</p></li></ul></li></ol><p>Course Structure:</p><p>The Cisco CCNA 200-301 course is structured to provide a comprehensive learning experience:</p><ol><li><p>Introduction to Networking:</p><ul><li><p>Overview of networking fundamentals, network topologies, and the role of various network devices.</p></li><li><p>Introduction to network protocols, including TCP/IP and the OSI model.</p></li></ul></li><li><p>Cisco Device Configuration:</p><ul><li><p>Detailed exploration of Cisco routers and switches, including device setup, configuration, and management using Cisco IOS.</p></li><li><p>Hands-on practice with device configurations and management tasks.</p></li></ul></li><li><p>IP Addressing and Subnetting:</p><ul><li><p>In-depth coverage of IPv4 and IPv6 addressing, subnetting techniques, and address planning.</p></li><li><p>Practical exercises in subnetting and IP address management.</p></li></ul></li><li><p>Routing and Switching:</p><ul><li><p>Configuration of routing protocols (e.g., OSPF, EIGRP) and switching technologies (e.g., VLANs, STP).</p></li><li><p>Hands-on labs focused on routing and switching configurations and troubleshooting.</p></li></ul></li><li><p>Network Security:</p><ul><li><p>Fundamentals of network security, including ACLs, firewalls, and secure device management.</p></li><li><p>Practical implementation of security measures to protect network infrastructure.</p></li></ul></li><li><p>Wireless Networking:</p><ul><li><p>Understanding of wireless networking principles, security, and configuration.</p></li><li><p>Hands-on practice with wireless access points and integration with wired networks.</p></li></ul></li><li><p>Troubleshooting and Practical Application:</p><ul><li><p>Systematic approach to network troubleshooting, including the use of diagnostic tools and commands.</p></li><li><p>Real-world case studies and interactive labs to apply troubleshooting skills.</p></li></ul></li></ol><p>Target Audience:</p><ul><li><p>Aspiring Network Engineers: Ideal for individuals starting their career in networking, providing a solid foundation in Cisco technologies and networking principles.</p></li><li><p>IT Professionals: Suitable for IT support specialists, systems administrators, and network technicians looking to enhance their networking skills and knowledge.</p></li><li><p>Career Changers: Perfect for those transitioning into IT or networking from other fields, offering a comprehensive introduction to Cisco networking.</p></li><li><p>Certification Seekers: Essential for those preparing for the CCNA 200-301 certification exam, with a focus on all the necessary topics and hands-on practice required for success.</p></li></ul><p>Why Choose This Course:</p><p>This course offers a balanced approach to learning, combining theoretical knowledge with practical skills. Our expert instructors provide clear explanations, real-world examples, and hands-on labs to ensure a thorough understanding of each topic. By the end of the course, you will be well-prepared to tackle the CCNA 200-301 exam and apply your skills in real-world networking scenarios.</p><p>Enroll today to start your journey toward becoming a Cisco Certified Network Associate and advance your career in networking!</p>",
      "detected_language": "en",
      "has_certificate": false,
      "has_closed_caption": false,
      "headline": "Cisco CCNA 200-301: Comprehensive Networking Fundamentals and Hands-On Skills for IT Professionals",
      "id": 6157803,
      "id_name": "100-101-interconnecting-cisco-networking-devices-part-1",
      "image": "https://img-b.udemycdn.com/course/480x270/6157803_cf36_2.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6157803_cf36_2.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "MD ZAHEDUL ISLAM": "https://www.udemy.com/user/md-zahedul-islam-10/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": true,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:10 GMT",
      "last_updated": "Thu, 19 Sep 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 2,
      "num_lectures": 0,
      "num_practice_tests": 2,
      "num_quizzes": 2,
      "num_reviews": 4,
      "num_subscribers": 2725,
      "objectives": [
        "Networking Fundamentals",
        "Introduction to Cisco Devices",
        "IP Addressing and Subnetting",
        "Routing Basics",
        "Switching Essentials"
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "IT Certifications",
      "quality_review_admin_rating": null,
      "quality_review_score": null,
      "quality_status": "approved",
      "rating": 4.2,
      "requirements_data": [
        "Basic Understanding of Networking Concepts",
        "Experience with Computer Hardware",
        "Basic Experience with Operating Systems"
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Entry-Level Network Engineers, IT Support Specialists"
      ],
      "title": "100-101: Interconnecting Cisco Networking Devices Part 1",
      "what_you_will_learn_data": [
        "Networking Fundamentals",
        "Introduction to Cisco Devices",
        "IP Addressing and Subnetting",
        "Routing Basics",
        "Switching Essentials"
      ],
      "who_should_attend_data": [
        "Entry-Level Network Engineers, IT Support Specialists"
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "38 mins",
      "coupon_code": "CF475C716B37947F8679",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 72,
      "created_date": "Mon, 06 Jun 2022 17:47:13 GMT",
      "description": "<p>Now people prefer to use Blogs and other Digital formats to write Diary but the traditional style of writing in a Paper Diary is still a popular form of expression of one’s feelings, emotions and thoughts. Diary writing is a personal form of writing where a person maintains a diary and writes about feelings, events, conversations, observations and happenings in his/her personal life. He can record incidents, reactions and any other memorable things that happened during the day.</p><p> In this course, we will learn:</p><p>1. What is Diary Writing?</p><p>2. Paper Diary vs. Electronic Diary, which is better?</p><p>3. Why write a Diary? or Benefits of Diary Writing.</p><p>4. Guidelines for writing a Diary or Tips on Diary Writing</p><p>5. Whether we should worry about grammar and spelling while writing Diary?</p><p>6. Date is an important part of every diary entry. Discuss.</p><p>7. Whether it is necessary to add subject or heading while writing a diary on any day?</p><p>8. Diary should be written in the first person. Discuss.</p><p>9. Whether it is necessary to give name to the diary?</p><p>10. Diary should be written in Present Tense or Past Tense or Future Tense. Discuss.</p><p>11. Format of Diary writing with examples-</p><p><br></p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Understanding How Journaling  Can Enhance Mental,  Emotional, and Physical Well-Being",
      "id": 4721290,
      "id_name": "diary-writing",
      "image": "https://img-b.udemycdn.com/course/480x270/4721290_f095.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/4721290_f095.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Prabh Kirpa Classes": "https://www.udemy.com/user/prabh-kirpa-classes/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["Writing"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:22 GMT",
      "last_updated": "Mon, 23 Oct 2023 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 5,
      "num_lectures": 5,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 84,
      "num_subscribers": 12174,
      "objectives": [
        "What is Diary Writing?",
        "Why write a Diary?  OR   Benefits of Diary Writing",
        "Guidelines for writing a diary     OR    Tips on Diary Writing",
        "Format of Diary Writing with examples"
      ],
      "primary_category": "Personal Development",
      "primary_subcategory": "Creativity",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 3.4,
      "requirements_data": ["Nil"],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Students who are interested to learn about Diary Writing"
      ],
      "title": "Diary Writing Benefits:  Unlocking the Magic of  Reflection",
      "what_you_will_learn_data": [
        "What is Diary Writing?",
        "Why write a Diary?  OR   Benefits of Diary Writing",
        "Guidelines for writing a diary     OR    Tips on Diary Writing",
        "Format of Diary Writing with examples"
      ],
      "who_should_attend_data": [
        "Students who are interested to learn about Diary Writing"
      ]
    },
    {
      "badges": ["New"],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "2.5 hours",
      "coupon_code": "D4BC1C9F3BE878E57E00",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 165,
      "created_date": "Tue, 05 Nov 2024 16:23:16 GMT",
      "description": "<p>Are you a new or seasoned manager seeking to elevate your 1:1 meetings from routine check-ins to meaningful, productive sessions? This course is your guide to developing the essential skills needed for effective 1:1s that build strong relationships, promote growth, and drive team performance.</p><p>This course combines the best of many worlds: it features in-depth video instruction from TJ Walker’s advanced AI video clone, live weekly office hours to connect directly with the instructor, and 24/7 interactive responses to your questions through the TJ Walker clone, available in video, audio, and text formats. Whether you need instant feedback or personal guidance, this course provides an unparalleled learning experience.</p><p>In today's dynamic work environment, especially with remote and hybrid teams, managers face unique challenges in creating spaces for authentic communication and impactful performance discussions. This course equips you with the frameworks and strategies to make every 1:1 count, whether you're engaging with team members remotely or in person.</p><p>What You’ll Learn:</p><ul><li><p>The Power of 1:1 Meetings<br>Discover why regular, focused 1:1 meetings are crucial for building trust, motivating your team, and supporting individual development. Learn the profound impact that consistent check-ins can have on morale, productivity, and retention, and gain insights into setting up meetings that make your direct reports feel valued and empowered.</p></li><li><p>Preparation Techniques for Success<br>Effective 1:1s start long before the meeting itself. We'll dive into proven strategies for preparing, including setting clear objectives, creating personalized agendas, and gathering relevant feedback and data. With preparation tools and templates, you’ll learn how to ensure every meeting has a purpose and leads to actionable outcomes.</p></li><li><p>Conducting Productive Meetings<br>Explore methods for structuring meetings that keep conversations focused, engaging, and goal-oriented. You’ll gain practical tips on asking the right questions, managing time efficiently, and addressing sensitive topics with empathy and clarity. Through real-world scenarios, we’ll also cover how to balance performance reviews with developmental feedback, so you can foster growth and accountability.</p></li><li><p>Active Listening and Communication Techniques<br>Communication is at the core of every successful 1:1. Learn active listening techniques that allow you to truly understand your team’s needs, motivations, and challenges. This section also covers how to navigate complex conversations, express genuine appreciation, and respond effectively to concerns, helping you become a more empathetic and approachable manager.</p></li><li><p>Leveraging Technology for Engagement<br>In remote and hybrid settings, technology plays a vital role in enhancing connection and accountability. You’ll learn about tools and platforms that support virtual 1:1s, from video conferencing to project management software, and gain tips for overcoming the unique challenges that remote meetings bring, such as maintaining eye contact, gauging non-verbal cues, and fostering engagement from a distance.</p></li><li><p>Follow-Up Strategies for Continuous Improvement<br>A strong 1:1 meeting doesn’t end when the conversation wraps up. This course will guide you through effective follow-up practices, including documenting action items, tracking progress, and scheduling next steps. We’ll also provide resources for maintaining consistency and accountability, so each meeting builds on the last and contributes to long-term growth.</p></li><li><p>Avoiding Common Pitfalls<br>We’ll identify common mistakes managers make in 1:1s, such as dominating the conversation, skipping regular check-ins, or failing to follow up. By understanding these pitfalls, you can avoid common challenges and build a meeting culture that feels supportive and productive.</p></li></ul><p>By the end of this course, you’ll walk away with practical skills, ready-to-use templates, and a renewed confidence in leading 1:1s that are impactful, efficient, and enjoyable. Transform your management style, foster a motivated team, and elevate your leadership presence in your organization.</p><p>Who Should Take This Course:</p><ul><li><p>New managers eager to build strong management foundations</p></li><li><p>Experienced managers seeking to improve or revitalize their 1:1 approach</p></li><li><p>Team leaders in remote or hybrid settings who want to deepen connections and drive performance</p></li></ul><p>If you're ready to lead 1:1 meetings that inspire, develop, and empower your team, join us to gain the skills that will make you a truly effective manager. </p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Build Trust, Boost Performance &amp; Foster Growth with Practical Skills for Successful 1:1 Meetings in Any Work Setting",
      "id": 6272077,
      "id_name": "managers-guide-to-effective-11-meetings-n",
      "image": "https://img-b.udemycdn.com/course/480x270/6272077_ca08.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6272077_ca08.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Media Training Worldwide Digital": "https://www.udemy.com/user/media-training-worldwide-digital/"
        },
        { "Peter Alkema": "https://www.udemy.com/user/peter-alkema-2/" }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:22 GMT",
      "last_updated": "Fri, 08 Nov 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 53,
      "num_lectures": 52,
      "num_practice_tests": 1,
      "num_quizzes": 1,
      "num_reviews": 0,
      "num_subscribers": 835,
      "objectives": [
        "Leaders",
        "Managers",
        "Aspiring Managers",
        "Aspiring Leaders"
      ],
      "primary_category": "Business",
      "primary_subcategory": "Management",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 0,
      "requirements_data": [
        "No programming experience needed. You will learn what you need in the course."
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "New Managers",
        "Aspiring Leaders",
        "Brand Managers",
        "Experienced Managers looking to Improve",
        "Leaders",
        "Managers",
        "Aspiring Managers"
      ],
      "title": "Managers Guide to Effective 1:1 Meetings",
      "what_you_will_learn_data": [
        "Leaders",
        "Managers",
        "Aspiring Managers",
        "Aspiring Leaders"
      ],
      "who_should_attend_data": [
        "New Managers",
        "Aspiring Leaders",
        "Brand Managers",
        "Experienced Managers looking to Improve",
        "Leaders",
        "Managers",
        "Aspiring Managers"
      ]
    },
    {
      "badges": ["New"],
      "campaign_type": "instructor_coupon",
      "caption_languages": [],
      "content_info_short": "40 questions",
      "coupon_code": "DC76485974B81EE60530",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 977,
      "created_date": "Fri, 18 Oct 2024 17:38:21 GMT",
      "description": "<p>The DEA-1TT4 Dell EMC Information Storage and Management (ISM) v4 Course is a comprehensive program designed for IT professionals seeking to gain foundational knowledge in information storage technologies and practices. This course provides an in-depth understanding of various storage architectures, data protection strategies, and emerging trends in the storage domain, preparing participants for the DEA-1TT4 certification exam.</p><p>Throughout the course, you will explore key concepts such as:</p><ul><li><p>Storage Systems and Architectures: Learn about different types of storage systems, including block, file, and object storage, and understand the architecture and components of storage solutions. Dive into RAID concepts and their significance in data protection and availability.</p></li><li><p>Data Protection: Understand essential data protection methods, including backup and recovery strategies, disaster recovery planning, and the use of snapshots and replication techniques to safeguard critical data.</p></li><li><p>Storage Networking Technologies: Explore storage networking concepts, including Storage Area Networks (SAN), Network-Attached Storage (NAS), and the various protocols that facilitate storage connectivity, such as Fibre Channel and iSCSI.</p></li><li><p>Cloud Computing and Virtualization: Gain insights into cloud storage models and the impact of virtualization on storage infrastructures. Understand how software-defined storage is shaping the future of data management.</p></li><li><p>Security in Storage: Learn about the security measures necessary to protect storage systems, including encryption, access controls, and data sanitization techniques.</p></li><li><p>Emerging Technologies: Stay up-to-date with the latest trends and advancements in storage technology, including flash storage, hyper-converged infrastructures, and the role of Big Data and artificial intelligence in storage solutions.</p></li></ul><p>The course includes a mix of theoretical knowledge and practical, hands-on labs to reinforce your learning experience. By the end of the course, you will be well-prepared to take the DEA-1TT4 certification exam and advance your career in information storage and management.</p><p>Enroll today and take the first step toward becoming a Dell EMC Certified Associate in Information Storage and Management!</p><p><br></p>",
      "detected_language": "en",
      "has_certificate": false,
      "has_closed_caption": false,
      "headline": "Foundations of Information Storage and Management for IT Professionals",
      "id": 6243001,
      "id_name": "dea-1tt4-dell-emc-associate-practice-test",
      "image": "https://img-b.udemycdn.com/course/480x270/6243001_d84c.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6243001_d84c.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "MD ZAHEDUL ISLAM": "https://www.udemy.com/user/md-zahedul-islam-10/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": true,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_updated": "Fri, 25 Oct 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 2,
      "num_lectures": 0,
      "num_practice_tests": 2,
      "num_quizzes": 2,
      "num_reviews": 0,
      "num_subscribers": 833,
      "objectives": [
        "Storage Systems",
        "Storage Networking Technologies",
        "Backup, Archive, and Replication",
        "Storage Security and Management"
      ],
      "primary_category": "IT & Software",
      "primary_subcategory": "IT Certifications",
      "quality_review_admin_rating": null,
      "quality_review_score": null,
      "quality_status": "approved",
      "rating": 0,
      "requirements_data": [
        "Experience in Storage Systems",
        "Networking and IT Infrastructure Knowledge",
        "Familiarity with VMware or Virtualization Platforms"
      ],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": [
        "Storage Administrators/Engineers, IT Consultants/Architects, Backup and Recovery Specialists"
      ],
      "title": "DEA-1TT4: Dell EMC Associate Practice test 2024",
      "what_you_will_learn_data": [
        "Storage Systems",
        "Storage Networking Technologies",
        "Backup, Archive, and Replication",
        "Storage Security and Management"
      ],
      "who_should_attend_data": [
        "Storage Administrators/Engineers, IT Consultants/Architects, Backup and Recovery Specialists"
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "8 hours",
      "coupon_code": "1FBB906C37D3816F16F5",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 839,
      "created_date": "Sun, 28 Apr 2019 02:52:35 GMT",
      "description": "<p>This comprehensive Udemy course combines insights from college topics generally covered by managerial accounting textbooks with practical applications to provide a deep understanding of essential tools in managerial accounting.</p><p>To set the right foundation, we begin by introducing managerial accounting topics and contrasting them with financial accounting. This establishes the correct mindset for the course, ensuring a clear understanding of the distinctive features and objectives of managerial accounting.</p><p>We then delve into flexible budgets, exploring their advantages over static or fixed budgets. Through interactive example problems and step-by-step instructional videos, you will grasp the benefits of flexible budgets and learn how to utilize them effectively.</p><p>Next, we define and analyze standard costs and cost variance analysis. While providing an overview of cost variance analysis concepts, we will progressively dive deeper into each topic, equipping you with practical skills to identify and interpret cost variances.</p><p>Sales variance analysis will be thoroughly covered, including its purpose, calculation methods, and real-world applications. By working through example problems and following detailed instructional videos, you will gain hands-on experience in calculating sales variances.</p><p>Direct materials variance analysis will be explored comprehensively, demonstrating its practical use and calculation methods. Through instructional videos and example problems, you will master the application of direct materials variance analysis concepts.</p><p>Direct labor variance analysis will also receive extensive attention, ensuring a comprehensive understanding of its purpose and applications. Through instructional videos and practical examples, you will acquire the skills to calculate and interpret direct labor variances.</p><p>Overhead variance analysis will be discussed in detail, highlighting its significance in cost management. You will understand why overhead variance analysis is used and learn how to calculate and analyze overhead variances. Through demonstration presentations, example problems, and step-by-step instructional videos, you will navigate the intricacies of overhead variance analysis.</p><p>As a capstone, we will provide comprehensive problems on overhead variance and variance analysis. With preformatted Excel worksheets and accompanying instructional videos, you will have the opportunity to apply your knowledge and skills in solving complex variance analysis scenarios. The Excel worksheets will guide you through the step-by-step problem-solving process, enabling a hands-on experience to reinforce your understanding.</p><p>Join us on this transformative journey of mastering managerial and cost accounting tools. Enroll now and unlock the power of variance analysis and budgeting for effective decision-making and financial management.</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Maximizing Financial Insight: Mastering Variance Analysis and Budgeting for Strategic Decision-Making",
      "id": 2342436,
      "id_name": "flexible-budgets-standard-costs-variance-analysis",
      "image": "https://img-b.udemycdn.com/course/480x270/2342436_1fec_2.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/2342436_1fec_2.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Robert (Bob) Steele": "https://www.udemy.com/user/c91d6786-95f3-48d8-ab94-cc92431d2aa4/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": true,
      "is_in_any_ufb_content_collection": true,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["Management Accounting"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:16 GMT",
      "last_updated": "Thu, 06 Jun 2019 00:00:00 GMT",
      "num_assignments": 7,
      "num_coding_exercises": 0,
      "num_curriculum_items": 98,
      "num_lectures": 91,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 384,
      "num_subscribers": 68151,
      "objectives": [
        "Differentiate between managerial accounting and financial accounting, understanding their distinct roles and objectives in business decision-making.",
        "Apply flexible budgeting techniques, demonstrating an understanding of their benefits and how they can be utilized to adapt to changing business conditions.",
        "Analyze standard costs and perform cost variance analysis, interpreting the variances to identify areas of cost inefficiencies and opportunities for improvement",
        "Calculate and interpret sales variances, evaluating the impact of sales performance on overall profitability and making informed decisions based on the analysis",
        "Perform direct materials variance analysis, assessing the efficiency and effectiveness of material usage and identifying potential cost-saving opportunities.",
        "Evaluate direct labor variances, understanding the factors that contribute to labor cost variations and implementing strategies for better labor cost management",
        "Interpret overhead variances, analyzing the discrepancies between actual and budgeted overhead costs and identifying potential areas for cost control.",
        "Solve comprehensive problems related to overhead variance analysis and variance analysis, integrating knowledge and skills to make informed decisions and provid",
        "Apply Excel skills to construct and analyze budgets, utilizing preformatted worksheets and step-by-step instructional videos for effective budgeting processes.",
        "Demonstrate critical thinking and problem-solving abilities in real-world scenarios, utilizing variance analysis and budgeting techniques to support strategic d"
      ],
      "primary_category": "Business",
      "primary_subcategory": "Management",
      "quality_review_admin_rating": 7,
      "quality_review_score": 80,
      "quality_status": "approved",
      "rating": 4.6,
      "requirements_data": [
        "Basic Accounting Knowledge: Familiarity with fundamental accounting principles, including an understanding of financial statements, terminology, and basic accounting concepts.",
        "Managerial Accounting Foundations: A solid understanding of managerial accounting principles, such as cost behavior, cost classification, cost-volume-profit analysis, and basic cost accounting techniques.",
        "Willingness to Learn: An eagerness to expand knowledge in managerial accounting tools, variance analysis, and cost management, along with a commitment to actively engage with course materials, participate in hands-on exercises, and apply learned concepts."
      ],
      "sm_sending_time": {
        "telegram": { "@udemy_business": "Fri, 08 Nov 2024 10:46:51 GMT" }
      },
      "status_label": "Live",
      "target_audiences": [
        "Accounting Professionals: Accountants seeking to enhance their expertise in managerial accounting tools and cost analysis, and those looking to specialize in managerial accounting roles.",
        "Finance Professionals: Financial analysts, financial managers, and professionals in finance-related roles who want to expand their knowledge of managerial accounting and develop proficiency in variance analysis and cost management.",
        "Business Owners and Entrepreneurs: Small business owners and entrepreneurs who want to gain insights into cost analysis and budgeting techniques to optimize business performance and financial decision-making.",
        "Aspiring Managers: Individuals aspiring to managerial positions who wish to develop a comprehensive understanding of managerial accounting tools and techniques to support strategic planning and decision-making.",
        "Business and Accounting Students: Students pursuing degrees in business, finance, accounting, or related fields who want to complement their academic knowledge with practical skills in managerial accounting and variance analysis.",
        "Anyone Interested in Financial Analysis: Individuals with a keen interest in understanding financial performance, cost management, and budgeting for effective decision-making."
      ],
      "title": "Flexible Budgets, Standard Costs, & Variance Analysis",
      "what_you_will_learn_data": [
        "Differentiate between managerial accounting and financial accounting, understanding their distinct roles and objectives in business decision-making.",
        "Apply flexible budgeting techniques, demonstrating an understanding of their benefits and how they can be utilized to adapt to changing business conditions.",
        "Analyze standard costs and perform cost variance analysis, interpreting the variances to identify areas of cost inefficiencies and opportunities for improvement",
        "Calculate and interpret sales variances, evaluating the impact of sales performance on overall profitability and making informed decisions based on the analysis",
        "Perform direct materials variance analysis, assessing the efficiency and effectiveness of material usage and identifying potential cost-saving opportunities.",
        "Evaluate direct labor variances, understanding the factors that contribute to labor cost variations and implementing strategies for better labor cost management",
        "Interpret overhead variances, analyzing the discrepancies between actual and budgeted overhead costs and identifying potential areas for cost control.",
        "Solve comprehensive problems related to overhead variance analysis and variance analysis, integrating knowledge and skills to make informed decisions and provid",
        "Apply Excel skills to construct and analyze budgets, utilizing preformatted worksheets and step-by-step instructional videos for effective budgeting processes.",
        "Demonstrate critical thinking and problem-solving abilities in real-world scenarios, utilizing variance analysis and budgeting techniques to support strategic d"
      ],
      "who_should_attend_data": [
        "Accounting Professionals: Accountants seeking to enhance their expertise in managerial accounting tools and cost analysis, and those looking to specialize in managerial accounting roles.",
        "Finance Professionals: Financial analysts, financial managers, and professionals in finance-related roles who want to expand their knowledge of managerial accounting and develop proficiency in variance analysis and cost management.",
        "Business Owners and Entrepreneurs: Small business owners and entrepreneurs who want to gain insights into cost analysis and budgeting techniques to optimize business performance and financial decision-making.",
        "Aspiring Managers: Individuals aspiring to managerial positions who wish to develop a comprehensive understanding of managerial accounting tools and techniques to support strategic planning and decision-making.",
        "Business and Accounting Students: Students pursuing degrees in business, finance, accounting, or related fields who want to complement their academic knowledge with practical skills in managerial accounting and variance analysis.",
        "Anyone Interested in Financial Analysis: Individuals with a keen interest in understanding financial performance, cost management, and budgeting for effective decision-making."
      ]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "4 hours",
      "coupon_code": "39F5EF849B59C8455C44",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 1000,
      "coupon_uses_remaining": 924,
      "created_date": "Wed, 26 Jun 2024 06:50:01 GMT",
      "description": "<p>Do you struggle with managing data in spreadsheets? Wish you could harness the power of Excel to simplify your work and life?</p><p>This course is your one-stop shop for mastering Excel, regardless of your experience level. We'll equip you with the essential skills you need to transform your spreadsheets from basic to brilliant.</p><p>In this course, you will:</p><ul><li><p>Learn the building blocks of Excel: Understand the interface, navigate menus, and master fundamental concepts.</p></li><li><p>Formula & Function Frenzy: Unleash the power of formulas and functions to automate calculations, analyze data, and save time.</p></li><li><p>Formatting Finesse: Format your spreadsheets like a pro using conditional formatting, styles, and charts to create visually appealing and informative presentations.</p></li><li><p>Data Analysis Decoded: Learn how to sort, filter, and analyze your data to extract valuable insights.</p></li><li><p>Essential Tools for Everyday Use: Master features like budgeting templates, goal-setting tools, and everyday spreadsheet applications.</p></li></ul><p>This course is perfect for:</p><ul><li><p>Anyone who wants to leverage Excel for work or personal use</p></li></ul><p>By the end of this course, you'll be confident using Excel to:</p><ul><li><p>Manage your finances and create budgets.</p></li><li><p>Organize and analyze data effectively.</p></li><li><p>Create professional-looking reports and presentations.</p></li><li><p>Automate repetitive tasks and boost your productivity. </p></li></ul><p>Spreadsheets got you stressed? Turn Excel frustration into confidence and control with this comprehensive course!</p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "Analyze Data, Create Charts and Automate Tasks with Confidence",
      "id": 6043382,
      "id_name": "excel-for-everyone-essential-skills-for-work-and-life",
      "image": "https://img-b.udemycdn.com/course/480x270/6043382_b2e6_2.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/6043382_b2e6_2.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        { "James Joab Soren": "https://www.udemy.com/user/james-joab-soren/" },
        {
          "Hudson Dynamic Lab": "https://www.udemy.com/user/hudson-dynamic-lab/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": [],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:21 GMT",
      "last_updated": "Thu, 04 Jul 2024 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 17,
      "num_lectures": 17,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 111,
      "num_subscribers": 10095,
      "objectives": [
        "Confidently navigate and manage data in Excel spreadsheets.",
        "Automate tasks and calculations using formulas and functions.",
        "Create visually appealing and informative spreadsheets for various purposes.",
        "Analyze and interpret data to extract valuable insights and make informed decisions."
      ],
      "primary_category": "Office Productivity",
      "primary_subcategory": "Microsoft",
      "quality_review_admin_rating": 7,
      "quality_review_score": 45,
      "quality_status": "approved",
      "rating": 4.3,
      "requirements_data": ["No experience required"],
      "sm_sending_time": {
        "telegram": {
          "@programming_courses": "Mon, 11 Nov 2024 09:28:19 GMT",
          "@udemy_business": "Mon, 11 Nov 2024 09:21:16 GMT",
          "@udemy_dev": "Mon, 11 Nov 2024 10:10:53 GMT"
        }
      },
      "status_label": "Live",
      "target_audiences": ["Anyone who wants to learn Excel"],
      "title": "Excel for Everyone: Essential Skills for Work and Life",
      "what_you_will_learn_data": [
        "Confidently navigate and manage data in Excel spreadsheets.",
        "Automate tasks and calculations using formulas and functions.",
        "Create visually appealing and informative spreadsheets for various purposes.",
        "Analyze and interpret data to extract valuable insights and make informed decisions."
      ],
      "who_should_attend_data": ["Anyone who wants to learn Excel"]
    },
    {
      "badges": [],
      "campaign_type": "instructor_coupon",
      "caption_languages": ["English [Auto]"],
      "content_info_short": "6 hours",
      "coupon_code": "6204FAB0E089AE6715F8",
      "coupon_discount_percent": 100,
      "coupon_max_uses": 100,
      "coupon_uses_remaining": 27,
      "created_date": "Wed, 25 Aug 2021 14:59:11 GMT",
      "description": "<p>1. Application for sick leave</p><p>2. Application to the Librarian for issuance of some books</p><p>3. Application to the Principal for remission of fine</p><p>4. Application for issuance of school leaving certificate</p><p>5. Application to the Principal for leave for going out of station</p><p>6. Application for fee concession</p><p>7. Application to the Librarian for extension of due date for return of borrowed books</p><p>8. Application to the Librarian regarding the loss of a library book</p><p>9. Application to the Principal for remission of fine imposed by the Librarian</p><p>10. Application to the Bookseller for supply of books</p><p>11. Application to the Principal for addition of books in the library</p><p>12. Application to the Principal regarding insufficient water supply in the school</p><p>13. Application to the Principal regarding urgent piece of work at home</p><p>14. Application to the Principal regarding lack of basic sanitation facility in the school</p><p>15.Application to the police regarding the theft of your motor cycle</p><p>16.Letter to the Editor regarding inadequate street lights in your locality</p><p>17.Letter to the Editor of a newspaper regarding road accidents due to rash driving</p><p>18.Application to the Mayor regarding inadequate street lights in your locality</p><p>19.Application to the Editor of a newspaper regarding the bad condition of roads in your locality.</p><p>20.Application to the Mayor regarding bad condition of roads in your locality</p><p>21.Letter to your friend congratulating him on his success in the examination</p><p>22.Application to the Bank Manager for issuance of cheque book/ATM Card/passbook/bank statement</p><p>\t\t\t\t23.Application to the police regarding non compliance of COVID-19 safety rules by some residents</p><p>24. Application to the Principal for issuance of character certificate</p><p>25. Complaint to police regarding nuisance caused by excessive and indiscriminate use of loudspeakers</p><p>26. Application to the police regarding the loss of mobile phone</p><p>27. Complaint to the police regarding theft of mobile phone</p><p>28. Application to the Police regarding loss of wallet</p><p>29.Application to the Police regarding loss of important documents/certificates</p><p>1. A Chain Snatching Incident</p><p>2. My Best Friend</p><p>3. Yoga for health</p><p>4. Deforestation</p><p>5. Begging is a Crime</p><p>6. Library</p><p>7. Role of Teachers</p><p>8. Generation Gap</p><p>9. Globalization</p><p>10. Importance of Positive Thinking for a Healthy Life</p><p>11. Eating Healthy</p><p>12. Our school celebrated cleanliness week</p><p>13. Urbanization</p><p>14. Pollution</p><p>15. Plastic Bags</p><p>16. Life in a big city</p><p>17. International Women’s Day</p><p>18. Computer</p><p>19. Online Education</p><p>20. Save Water</p><p>21. Importance of Education</p><p>22. Child Labour</p><p>23. Effects of social media on society</p><p>24. A Picnic</p><p>25. My Aim in Life</p><p>26. A Rainy Day</p><p>27. Diwali</p><p>28. Smoking is Injurious to Health</p><p>29. Importance of Games and Sports</p><p>30. Nothing is Impossible</p><p>31. Role of Mothers</p><p>32. Save Trees</p><p>33. Importance of Reading Books</p><p>34. A Healthy Mind in a Healthy Body</p><p>35. Role of Discipline</p><p>36. Scene at Railway Station</p><p>37. Clean India Green India</p><p>38. Honesty is the Best Policy</p><p>39. Holi</p><p>40. Fashion</p><p>41.Taj Mahal</p><p>\t42. Swachh Bharat Abhiyan</p><p>43. Work is Worship</p><p>44. Conservation of Natural Resources</p><p>45. Online Shopping</p><p>46. Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (PM-JAY)</p><p>47. Each One Teach One</p><p>48. Need for counselling of students before board exams</p><p>49. Information Technology and Young Generation</p><p>50. Save Water Save Life</p><p><br></p>",
      "detected_language": "en",
      "has_certificate": true,
      "has_closed_caption": true,
      "headline": "From Ideas to Impact: Writing Articles and Letters.",
      "id": 4262986,
      "id_name": "articles-and-lettersapplications",
      "image": "https://img-b.udemycdn.com/course/480x270/4262986_4cda.jpg",
      "image_hq": "https://img-b.udemycdn.com/course/750x422/4262986_4cda.jpg",
      "instructional_level_simple": "All Levels",
      "instructors": [
        {
          "Prabh Kirpa Classes": "https://www.udemy.com/user/prabh-kirpa-classes/"
        }
      ],
      "is_approved": true,
      "is_banned": false,
      "is_course_in_ub_ever": false,
      "is_in_any_ufb_content_collection": false,
      "is_language_course": false,
      "is_paid": true,
      "is_practice_test_course": false,
      "is_private": false,
      "is_published": true,
      "is_taking_disabled": false,
      "labels": ["Teacher Training"],
      "language": "English",
      "last_db_change_time": "Mon, 11 Nov 2024 16:53:25 GMT",
      "last_udemy_refresh": "Mon, 11 Nov 2024 16:53:13 GMT",
      "last_updated": "Mon, 30 Aug 2021 00:00:00 GMT",
      "num_assignments": 0,
      "num_coding_exercises": 0,
      "num_curriculum_items": 84,
      "num_lectures": 84,
      "num_practice_tests": 0,
      "num_quizzes": 0,
      "num_reviews": 23,
      "num_subscribers": 10236,
      "objectives": [
        "1. Application for sick leave",
        "2. Application to the Librarian for issuance of some books",
        "3. Application to the Principal for remission of fine",
        "4. Application for issuance of school leaving certificate",
        "5. Application to the Principal for leave for going out of station",
        "6. Application for fee concession",
        "7. Application to the Librarian for extension of due date for return of borrowed books",
        "8. Application to the Librarian regarding the loss of a library book",
        "9. Application to the Principal for remission of fine imposed by the Librarian",
        "10. Application to the Bookseller for supply of books",
        "11. Application to the Principal for addition of books in the library",
        "12. Application to the Principal regarding insufficient water supply in the school",
        "13. Application to the Principal regarding urgent piece of work at home",
        "14. Application to the Principal regarding lack of basic sanitation facility in the school",
        "15. Application to the police regarding the theft of your motor cycle",
        "16. Letter to the Editor regarding inadequate street lights in your locality",
        "17. Letter to the Editor of a newspaper regarding road accidents due to rash driving",
        "18. Application to the Mayor regarding inadequate street lights in your locality",
        "19. Application to the Editor of a newspaper regarding the bad condition of roads in your locality.",
        "20. Application to the Mayor regarding bad condition of roads in your locality",
        "21. Letter to your friend congratulating him  on his success in the examination",
        "22. Application to the Bank Manager for issuance of cheque book/ATM Card/passbook/bank statement",
        "23 .Application to the police regarding non-compliance of COVID-19 safety rules by \tsome residents",
        "24.  Application to the Principal for issuance of character certificate",
        "25. Complaint to police regarding nuisance caused by excessive and indiscriminate use of loudspeakers",
        "26. Application to the police regarding the loss of mobile phone",
        "27. Complaint to the police regarding theft of mobile phone",
        "28. Application to the Police regarding loss of wallet",
        "29. Application to the Police regarding loss of important documents/certificates",
        "30. Invitation Letter to parents for school Annual function",
        "31. Letter to the Editor of newspaper regarding the problem of stray animals",
        "32. Letter to the Dealer regarding replacement of faulty refrigerator",
        "33. Letter to the Bookseller by school librarian for supply of books",
        "1. A Chain Snatching Incident",
        "2. My Best Friend",
        "3. Yoga for health",
        "4. Deforestation",
        "5. Begging is a Crime",
        "6. Library",
        "7. Role of Teachers",
        "8. Generation Gap",
        "9. Globalization",
        "10. Importance of Positive Thinking for a Healthy Life",
        "11. Eating Healthy",
        "12. Our school celebrated cleanliness week",
        "13. Urbanization",
        "14. Pollution",
        "15. Plastic Bags",
        "16. Life in a big city",
        "17. International Women’s Day",
        "18. Computer",
        "19. Online Education",
        "20. Save Water",
        "21. Importance of Education",
        "22. Child Labour",
        "23. Effects of social media on society",
        "24. A Picnic",
        "25. My Aim in Life",
        "26. A Rainy Day",
        "27. Diwali",
        "28. Smoking is Injurious to Health",
        "29. Importance of Games and Sports",
        "30. Nothing is Impossible",
        "31. Role of Mothers",
        "32. Save Trees",
        "33. Importance of Reading Books",
        "34. A Healthy Mind in a Healthy Body",
        "35. Role of Discipline",
        "36. Scene at Railway Station",
        "37. Clean India Green India",
        "38. Honesty is the Best Policy",
        "39. Holi",
        "40. Fashion",
        "41. Taj Mahal",
        "42. Swachh Bharat Abhiyan",
        "43. Work is Worship",
        "44. Conservation of Natural Resources",
        "45. Online Shopping",
        "46. Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (PM-JAY)",
        "47. Each One Teach One",
        "48. Need for counselling of students before board exams",
        "49. Information Technology and Young Generation",
        "50. Save Water Save Life"
      ],
      "primary_category": "Teaching & Academics",
      "primary_subcategory": "Other Teaching & Academics",
      "quality_review_admin_rating": 7,
      "quality_review_score": 0,
      "quality_status": "approved",
      "rating": 4.9,
      "requirements_data": ["NIL"],
      "sm_sending_time": {},
      "status_label": "Live",
      "target_audiences": ["All Classes"],
      "title": "Writing with Impact: Compelling Articles and Letters",
      "what_you_will_learn_data": [
        "1. Application for sick leave",
        "2. Application to the Librarian for issuance of some books",
        "3. Application to the Principal for remission of fine",
        "4. Application for issuance of school leaving certificate",
        "5. Application to the Principal for leave for going out of station",
        "6. Application for fee concession",
        "7. Application to the Librarian for extension of due date for return of borrowed books",
        "8. Application to the Librarian regarding the loss of a library book",
        "9. Application to the Principal for remission of fine imposed by the Librarian",
        "10. Application to the Bookseller for supply of books",
        "11. Application to the Principal for addition of books in the library",
        "12. Application to the Principal regarding insufficient water supply in the school",
        "13. Application to the Principal regarding urgent piece of work at home",
        "14. Application to the Principal regarding lack of basic sanitation facility in the school",
        "15. Application to the police regarding the theft of your motor cycle",
        "16. Letter to the Editor regarding inadequate street lights in your locality",
        "17. Letter to the Editor of a newspaper regarding road accidents due to rash driving",
        "18. Application to the Mayor regarding inadequate street lights in your locality",
        "19. Application to the Editor of a newspaper regarding the bad condition of roads in your locality.",
        "20. Application to the Mayor regarding bad condition of roads in your locality",
        "21. Letter to your friend congratulating him  on his success in the examination",
        "22. Application to the Bank Manager for issuance of cheque book/ATM Card/passbook/bank statement",
        "23 .Application to the police regarding non-compliance of COVID-19 safety rules by \tsome residents",
        "24.  Application to the Principal for issuance of character certificate",
        "25. Complaint to police regarding nuisance caused by excessive and indiscriminate use of loudspeakers",
        "26. Application to the police regarding the loss of mobile phone",
        "27. Complaint to the police regarding theft of mobile phone",
        "28. Application to the Police regarding loss of wallet",
        "29. Application to the Police regarding loss of important documents/certificates",
        "30. Invitation Letter to parents for school Annual function",
        "31. Letter to the Editor of newspaper regarding the problem of stray animals",
        "32. Letter to the Dealer regarding replacement of faulty refrigerator",
        "33. Letter to the Bookseller by school librarian for supply of books",
        "1. A Chain Snatching Incident",
        "2. My Best Friend",
        "3. Yoga for health",
        "4. Deforestation",
        "5. Begging is a Crime",
        "6. Library",
        "7. Role of Teachers",
        "8. Generation Gap",
        "9. Globalization",
        "10. Importance of Positive Thinking for a Healthy Life",
        "11. Eating Healthy",
        "12. Our school celebrated cleanliness week",
        "13. Urbanization",
        "14. Pollution",
        "15. Plastic Bags",
        "16. Life in a big city",
        "17. International Women’s Day",
        "18. Computer",
        "19. Online Education",
        "20. Save Water",
        "21. Importance of Education",
        "22. Child Labour",
        "23. Effects of social media on society",
        "24. A Picnic",
        "25. My Aim in Life",
        "26. A Rainy Day",
        "27. Diwali",
        "28. Smoking is Injurious to Health",
        "29. Importance of Games and Sports",
        "30. Nothing is Impossible",
        "31. Role of Mothers",
        "32. Save Trees",
        "33. Importance of Reading Books",
        "34. A Healthy Mind in a Healthy Body",
        "35. Role of Discipline",
        "36. Scene at Railway Station",
        "37. Clean India Green India",
        "38. Honesty is the Best Policy",
        "39. Holi",
        "40. Fashion",
        "41. Taj Mahal",
        "42. Swachh Bharat Abhiyan",
        "43. Work is Worship",
        "44. Conservation of Natural Resources",
        "45. Online Shopping",
        "46. Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (PM-JAY)",
        "47. Each One Teach One",
        "48. Need for counselling of students before board exams",
        "49. Information Technology and Young Generation",
        "50. Save Water Save Life"
      ],
      "who_should_attend_data": ["All Classes"]
    }
  ]
}
